[
  {
    "text": "You are in a tavern after a hard day of adventuring. The place is full of the normal patrons and a healthy amount of travelers who are in town for the local festival.\n",
    "option1Name": "⌄",
    "option1Key": "sitincorner",
    "key": "starthere"
  },
  {
    "text": "As you are sitting in a corner with a drink doing your best impression of Strider trying to scare off anyone who might even look at you. You notice that the guy at the table next to you is getting a little handsy with the wait staff. \n\nHow do you respond?\n",
    "option1Name": "Sword in hand, I stand up and look angry",
    "option1Key": "imafighter",
    "option2Name": "I use magic to knock him out of his seat",
    "option2Key": "imawizard",
    "option3Name": "I don't. It ain't my business",
    "option3Key": "ignorethejerk",
    "key": "sitincorner",
    "image": "HoodedFigure"
  },
  {
    "text": "Of course, you do, that's what makes you a fighter.\n\nYou step up to the guy sword in hand.\n\nWhat do you say?",
    "option1Name": "Take your stinking paws off her you damned dirty ape",
    "option1Key": "cheston",
    "option2Name": "Nothing. I just bash his head in.",
    "option2Key": "overaggressive",
    "option3Name": "Hey man, let's be cool man.",
    "option3Key": "superpassive",
    "key": "imafighter",
    "action": "imafighter"
  },
  {
    "text": "Of course, you do, you're a wizard and you like to take the subtle approach.\n\nWhat sort of spell do you want to use? Maybe just a little forceful hand to literally push him out of his chair? Maybe a fear spell so that he sees illusory monsters that are out to get him? Or, there's always Power Word Death.",
    "option1Name": "Forceful Hand",
    "option1Key": "farfightfh",
    "option2Name": "Fear",
    "option2Key": "farfightfear",
    "option3Name": "Power Word Death",
    "option3Key": "barfightpwdeath",
    "key": "imawizard",
    "action": "imawizard"
  },
  {
    "text": "Not saying anything makes you part of the problem. You don't want to be part of the problem, do you? \n\nHow do you really respond?\n",
    "option1Name": "Sword in hand, I stand up and look angry",
    "option1Key": "imafighter",
    "option2Name": "I use magic to knock him out of his seat",
    "option2Key": "imawizard",
    "option3Name": "No really, it's none of my business",
    "option3Key": "ignorethejerk2",
    "key": "ignorethejerk"
  },
  {
    "text": "Okay, look.\n\nIt's important for you to choose one of the other options for the game to go on. I'm trying to assign you a class here.",
    "option1Name": "Sword in hand, I stand up and look angry",
    "option1Key": "imafighter",
    "option2Name": "I use magic to knock him out of his seat",
    "option2Key": "imawizard",
    "key": "ignorethejerk2"
  },
  {
    "text": "The guy sneers at you and stands up. He has an unmistakable long scar going down one side of his face. You recognize him from a wanted poster that you've seen somewhere. His clothes are dirty and torn. They remind you of the bandits that you've seen in the area. \n\nHe looks at your sword and pulls his own out. \"I ain't no ape.\"\n\nHe steps in to attack.",
    "option1Name": "Roll",
    "option1Key": "fightinbar",
    "key": "cheston"
  },
  {
    "text": "You are amazed at how hard this guys head must be. You hit him with the broadside of your sword right on the side of the head. He fell out of his chair, and you figured that would have knocked him out cold, but he just stood up. It was a really satisfying hit too. It's not like you just tapped him. But now he's standing up, his own sword drawn, and he looks really angry.\n\nHe curses and steps in to attack.",
    "option1Name": "Roll!",
    "option1Key": "fightinbar",
    "key": "overaggressive"
  },
  {
    "text": "The guy sneers at you. He has an unmistakable long scar going down one side of his face. You recognize him from a wanted poster that you've seen somewhere. His clothes are dirty and torn. They remind you of the bandits that you've seen in the area. \n\n\"Mind yer own business.\"\n\nThe guy takes another drink of his mead, and when it's clear to him that you aren't going to let this go, he stands up and pulls his sword.\n\n\"Alright, if you want to make something of this, let's dance.\"",
    "option1Name": "Roll",
    "option1Key": "fightinbar",
    "key": "superpassive"
  },
  {
    "text": "In this game, you will occasionally do some sort of check that will involve rolling dice. You will always roll 2 standard six-sided dice, add them together, and add in a relevant ability score. In this case, that will be Intelligence, because you are casting a spell. \n\nIf you roll a 10 or better, then you will see the best possible outcome. \nOn a 7 - 9, you will usually get what you want, but there will be some sort of negative consequence. \nIf you roll a 6 or less, then something bad will happen.",
    "option1Name": "Continue",
    "option1Key": "fightinbar6-",
    "option2Name": "",
    "option2Key": "fightinbar79",
    "option3Name": "",
    "option3Key": "fightinbar10+",
    "key": "fightinbar",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "The handsy guy charges at you as he swings his sword. You try to sidestep, but you stumble over a chair and fall on your ass. The guy starts laughing at you. The waitress also starts laughing at you. \n\n\"He's my boyfriend,\" she says before taking the guy by the hand and leading him off to the sleeping rooms. \n\nYou get back in your seat and pull the hood of your cloak up to try to cover your shame. That really didn't go as expected. ",
    "option1Name": "Continue",
    "option1Key": "fellonass",
    "key": "fightinbar6-"
  },
  {
    "text": "The handsy guy charges at you as he swings his sword. Without thinking much, you just kind of stick your sword out in front of you and the guy impales himself on it. It really wasn't what you were expecting to happen. \n\nThe waitress screams and runs off. \n\nYou find yourself, just kind of standing there with a dead guy on your sword. There's a huge mess of blood growing at your feet.",
    "option1Name": "Continue",
    "option1Key": "deadguyonsword",
    "key": "fightinbar79"
  },
  {
    "text": "The handsy guy steps in as he swings his sword wildly. You easily deflect it with your sword, grab his wrist with your other hand, then pulling him forward and off balance, you hit him square in the temple with the pommel of your sword. He falls limply to the ground. \n\nThe waitress thanks you for intervening, then hurries off to take care of the other patrons. ",
    "option1Name": "Continue",
    "option1Key": "wonfightinbar",
    "key": "fightinbar10+"
  },
  {
    "text": "You feel a hand on your shoulder. When you turn to see who it is, you see the friendly round face of the barkeep. \n\n\"That one always was a bad egg. Thanks for standing up for my staff. Your drinks are on me tonight.\"\n\nThe barkeep heads off to pour you another round. You go back to your table and you notice a few of the other patrons of the tavern giving you appreciative nods. No one really seems to notice the pile of ruffian in the middle of the floor. In fact, after a few minutes, you seem to completely forget that he's there.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wonfightinbar"
  },
  {
    "text": "Later in the evening, you are approached by a middle-aged woman.\n\n\"I saw what happened earlier, and I can tell that you are a person of action, perhaps you can help me.\"\n",
    "option1Name": "Continue",
    "option1Key": "oldLady",
    "key": "waitingforadventure",
    "action": "clear"
  },
  {
    "text": "After a few moments of standing there a bit dumbstruck, the barkeep taps you on the shoulder to get your attention.\n\n\"I appreciate you wanting to stand up for my staff, but this isn't the sort of place where we take to murdering our customers... even if they are wanted.\" He says in a growling voice. \"Take the corpse outside, then go in the back and get a mop.\"",
    "option1Name": "Continue",
    "option1Key": "deadguyonsword2",
    "key": "deadguyonsword"
  },
  {
    "text": "You do as he said, and once there isn't a drop of blood left in the place, the barkeep brings you a hot meal on the house. \n\nWhen you're halfway through eating it, you notice the barkeep talking to a local guardsman who came in. You see the guardsman give the barkeep some gold, and you realize that the barkeep totally just took the reward for killing the wanted guy. You think about calling him out on it, but you decide against making yet another scene tonight. You go back to enjoying the free meal.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "deadguyonsword2"
  },
  {
    "text": "After a few minutes, the barkeep puts a mug of mead on your table.\n\n\"I appreciate the thought of standing up for my staff. Don't feel too bad lad, they're both leaving in the morning, and you'll never see them again. You're lucky that went the way it did, you could have gotten a lot more than your pride hurt.\"\n\nThe barkeep leaves, and you slowly start to feel better as you enjoy the mead.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "fellonass"
  },
  {
    "text": "That's a good choice. It's subtle, it'll embarrass him, and he'll never know that it came from you.",
    "option1Name": "Continue",
    "option1Key": "barfightfh2",
    "key": "farfightfh"
  },
  {
    "text": "Yes, this guy needs to be taught a lesson, and who better to do it than whatever terrors lurk in his own subconscious.",
    "option1Name": "Continue",
    "option1Key": "barfightfear2",
    "key": "farfightfear"
  },
  {
    "text": "Really? You know that will make him just drop dead on the spot right?\n\nSeems a little harsh for being a bit handsy.\n\nYeah, you're right. Down with the Patriarchy!",
    "option1Name": "Continue",
    "option1Key": "barfightpwdeath2",
    "key": "barfightpwdeath"
  },
  {
    "text": "In this game, you will occasionally do some sort of check that will involve rolling dice. You will always roll 2 standard six-sided dice, add them together, and add in a relevant ability score. In this case, that will be Intelligence, because you are casting a spell. \n\nIf you roll a 10 or better, then you will see the best possible outcome. \nOn a 7 - 9, you will usually get what you want, but there will be some sort of negative consequence. \nIf you roll a 6 or less, then something bad will happen.",
    "option1Name": "Roll",
    "option1Key": "barfight6-",
    "option2Name": "barfight79",
    "option2Key": "barfight79",
    "option3Name": "barfight10+",
    "option3Key": "barfight10+",
    "key": "barfightfh2",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Instead of pushing the guy over, you accidentally knock the waitress over. The handsy guy catches her on the way down saving for from hitting her head. She thanks him.\n\nYou decide that you should probably leave things alone. You watch the waitress slowly become more flirty with the guy as the night goes on. You know that he'll eventually break her heart and that she's too good for him. It's pretty depressing to watch, but there's not really much you can do. You've already made things worse.\n\nYou spend the evening trying not to watch and sipping your drink. ",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "barfight6-"
  },
  {
    "text": "Well, you totally knock him out of his chair like you intended. You probably should have waited until he was distracted. As he was going down, he felt the push and looked in your direction only to see you holding your hand out in a pushing motion. Sure you're 20 feet away, but it was still pretty obvious what had happened.\n",
    "option1Name": "Continue",
    "option1Key": "barfight79-2",
    "key": "barfight79"
  },
  {
    "text": "Awesome! You time it right when he's taking a drink, so that he falls sideways out of his chair, spills ale all over himself, and hits his head on the floor. Not so bad that he'll have a concussion or anything, just enough to give him a headache for bit. \n\nThe barkeep yells at him \"You've had enough tonight, why don't you get back home.\"\n\nEmbarrassed, the guy picks himself up, glances around and notices that everyone in the place is watching him. Without a word, he heads out the door.",
    "option1Name": "Continue",
    "option1Key": "barfightfhdone",
    "key": "barfight10+"
  },
  {
    "text": "Satisfied that you've done a good thing without drawing any attention to yourself, you go back to sitting in the shadows enjoying your drink.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "barfightfhdone"
  },
  {
    "text": "\"You, Wizard\" he says while picking himself up, \"You looking to pick a fight?\"\n\nHow do you respond?\n",
    "option1Name": "Deny Everything!",
    "option1Key": "wibdeny",
    "option2Name": "Kick his ass",
    "option2Key": "wibkickass",
    "option3Name": "Quick, make a distraction!",
    "option3Key": "wibdistraction",
    "key": "barfight79-2"
  },
  {
    "text": "You try to deny what he's talking about. No one else seems to have seen you make a spell, so it's your word against his.\n\nRoll + Charisma to see if you can talk your way out of this.",
    "option1Name": "Roll!",
    "option1Key": "wibdeny6-",
    "option2Name": "wibdeny79",
    "option2Key": "wibdeny79",
    "option3Name": "wibdeny10+",
    "option3Key": "wibdeny10+",
    "key": "wibdeny",
    "moveStat": "Charisma",
    "moveTriggered": true
  },
  {
    "text": "You do?\n\nReally?\n\nThat's not a very wizardly thing to do...\n\nYou can try, but it's probably not going to go well...",
    "option1Name": "YES!",
    "option1Key": "wibkacommit",
    "option2Name": "Nope. Deny Everything!",
    "option2Key": "wibdeny",
    "option3Name": "Uhh... Quick, make a distraction",
    "option3Key": "wibdistraction",
    "key": "wibkickass"
  },
  {
    "text": "Good idea, you try to cast another spell to create an illusion to get the attention off of you.",
    "option1Name": "Roll!",
    "option1Key": "wibdistraction6-",
    "option2Name": "wibdistraction79",
    "option2Key": "wibdistraction79",
    "option3Name": "wibdistraction10+",
    "option3Key": "wibdistraction10+",
    "key": "wibdistraction",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Nobody believes you. In fact, you get kicked out of the establishment and are told not to come back anytime soon.\nYou distinctly remember the barkeep saying \"No good wizard going around casting spells on my loyal patrons.\"\n\nThe worst part is that you miss the key thing that happens that really starts the story.\n\nYou spend the next few days bumming around town doing your thing, and then you die in a zombie apocalypse.\n\nThe End.\n",
    "option1Name": "Start Over",
    "option1Key": "end",
    "key": "wibdeny6-"
  },
  {
    "text": "No one is really sure who to believe. The guy has had a lot to drink, but you look kind of sketchy sitting by yourself in the dark corner looking of arcane and wizardy. The barkeep announces that he's got his eye on both of you. One more outburst and you'll be kicked out into the rain.\n\nYou go back to working on your drink, but it's not as enjoyable now that you're being watched.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibdeny79"
  },
  {
    "text": "You totally talk your way out of it. Everyone thinks that he just fell over and was trying to blame that wizard guy in the corner instead of owning up to being a little too drunk.\n\nAngrily he insults everyone's mothers and leave the bar. You go back to sitting in the shadows enjoying your drink.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibdeny10+"
  },
  {
    "text": "Okay then.\n\nYou stand up, walk over to the guy who is now getting up off the floor. You probably say something that you think sounds really heroic about keeping his hands to himself, and you put up your dukes.",
    "option1Name": "Roll!",
    "option1Key": "wibkacommit6-",
    "option2Name": "wibkacommit79",
    "option2Key": "wibkacommit79",
    "option3Name": "wibkacommit10+",
    "option3Key": "wibkacommit10+",
    "key": "wibkacommit",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "Your head really hurts. \n\nYou open your eyes and look around, the bar is empty, and there's sunlight coming in through the windows. It seems you spent the night on the floor of the bar where you landed when you got knocked out. \n\nThe worst part is that you totally missed the key thing  that really starts the story.\n\nYou spend the next few days bumming around town doing your thing, and then you die in a zombie apocalypse.\n\nThe End.",
    "option1Name": "Start Over",
    "option1Key": "end",
    "key": "wibkacommit6-"
  },
  {
    "text": "Your hand really hurts. You probably broke a finger when you punched that guy in the nose. He did run out of the inn holding a very bloody (probably broken) nose, so that's a win.\n\nYou lose @X HP. \n\nYou'll have to use a healing potion when you get back to the room to fix your hand. \n\nYou go back to sitting in the corner enjoying your drink and wondering what inspired you to do such a thing.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibkacommit79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "First there's the distinct sound of a fist hitting flesh, then the sound of a body hitting the floor, then silence as the entire place stares in shock.\n\nTonight's going to be one that people will talk about for weeks. It'll go down as the night a wizard totally dropped a guy twice his size with a throat punch.\n\nA few people buy you drinks, telling you how awesome that was, and how the guy deserved that as he's a complete jerk. The waitress who he was being handsy with thanks you, and you go back to sitting in the corner with a smug sense of satisfaction. \n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibkacommit10+"
  },
  {
    "text": "No one is fooled by your illusion of a purple hippopotomus that suddenly appears in the middle of the bar. You get kicked out of the establishment.\n\nYou distinctly remember the barkeep saying \"No good wizard going around casting spells on my loyal patrons.\"\n\nThe worst part is that you miss the key thing that happens that really starts the story.\n\nYou spend the next few days bumming around town doing your thing, and then you die in a zombie apocalypse.\n\nThe End.",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "wibdistraction6-"
  },
  {
    "text": "You create the illusion of a dragon landing outside the inn. It makes a horrible roar, and everyone dives under their tables. Someones yells for you to get rid of it because you're obviously a powerful wizard.\n\nYou spend the next 20 minutes putting on a show of fighting off the dragon that is actually your illusion. You'd really rather spend that time sitting in the corner and enjoying your drink, but you're kind of committed to the lie now. Eventually, you make your way back inside and sit back down at your table. You're exhausted. \n\nAnd your drink is missing.\nYou order a new one, and go back to sitting in the corner.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibdistraction79"
  },
  {
    "text": "You create the illusion of a town guardsman coming in the door.\n\nIt points at the guy, and yells \"In the name of the king, you're under arrest!\"\n\nThe guy looks at it, then dives out one of the windows and runs away. You make the illusion look like it gives chase out the window then dispell it once it's out of sight. \n\nGreat job! The guy is gone, and no one knows that you had anything to do with it. You go back to enjoying your drink in the corner.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibdistraction10+"
  },
  {
    "text": "In this game, you will occasionally do some sort of check that will involve rolling dice. You will always roll 2 standard six-sided dice, add them together, and add in a relevant ability score. In this case, that will be Intelligence, because you are casting a spell. \n\nIf you roll a 10 or better, then you will see the best possible outcome. \nOn a 7 - 9, you will usually get what you want, but there will be some sort of negative consequence. \nIf you roll a 6 or less, then something bad will happen.",
    "option1Name": "Roll!",
    "option1Key": "farfightfear6-",
    "option2Name": "barfightfear79",
    "option2Key": "barfightfear79",
    "option3Name": "barfightfear10+",
    "option3Key": "barfightfear10+",
    "key": "barfightfear2",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You really need to learn to control your spells a bit better. Instead of casting it on the handsy guy, you cast it on the waitress. \n\nThe way this spell works is that the target will see illusions of whatever their darkest fears are. It's really handy for causing distractions when you're in a fight. \n\nAfter screaming in absolute terror, the waitress ran from the inn. The memories of that illusion are going to keep her awake at night for weeks. She could have handled some handsy jerk. In fact, she was about to tell him to leave. But this spell is meant to be something that breaks the human psyche. Good job.\n\nYou spend the rest of the evening sipping your drink and contemplating your mistake.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "farfightfear6-"
  },
  {
    "text": "The good news is that the spell totally worked. You don't know what that guy is seeing, and you really don't care. All you know is that he's petrified.\n\nIn fact, he fainted. The waitress got a couple of other patrons to help her carry the guy to one of the rooms. She keeps checking on him, and it's possible that she suspects something because she keeps giving you the side eye.\n\nYou spend the rest of the evening trying to keep a low profile.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "barfightfear79"
  },
  {
    "text": "That worked really well. The guy looked right at the waitress.\n\"noContinue no.. pleaseContinue noContinue\"\n\nThen he took off running. Whatever it is he's afraid of, he is projecting that onto the waitress. You doubt that he'll be back to this place.\n\nYou spend the evening feeling a bit smug sipping your drink.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "barfightfear10+"
  },
  {
    "text": "In this game, you will occasionally do some sort of check that will involve rolling dice. You will always roll 2 standard six-sided dice, add them together, and add in a relevant ability score. In this case, that will be Intelligence, because you are casting a spell. \n\nIf you roll a 10 or better, then you will see the best possible outcome. \nOn a 7 - 9, you will usually get what you want, but there will be some sort of negative consequence. \nIf you roll a 6 or less, then something bad will happen.",
    "option1Name": "Roll!",
    "option1Key": "pwdeath6-",
    "option2Name": "pwdeath79",
    "option2Key": "pwdeath79",
    "option3Name": "pwdeath10+",
    "option3Key": "pwdeath10+",
    "key": "barfightpwdeath2",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You wait until the guy takes a bite of his food, then you cast the spell. \n\nNothing happens.\n\nYou felt the surge of magic when you cast the spell, so you know that it was cast.",
    "option1Name": "???",
    "option1Key": "pwd6-2",
    "key": "pwdeath6-"
  },
  {
    "text": "You wait until the guy takes a bite of his food, then you cast the spell. \n\nThe guy slumps over. There's a thud and a clatter as his head lands on the table knocking his dinner onto the floor. Someone screams, and the waitress checks on him. She announces that he's dead, and that starts a large commotion. Someone is sent to get his wife. No one can figure out what happened, but everyone is devastated. There's a lot of crying. It appears that this guy was one of the pillars of the community. \n\nYou are very lucky that they don't know it was you.",
    "option1Name": "Continue",
    "option1Key": "pwdeath79-2",
    "key": "pwdeath79"
  },
  {
    "text": "You wait until the guy takes a bite of his food, then you cast the spell. \n\nThe guy slumps over. There's a thud and a clatter as his head lands on the table knocking his dinner onto the floor. Someone checks on him, and there's a large commotion as people realize that he's dead. You overhear a few people talk with relief that he's gone. Apparently, the guy was pretty much all around a bad egg.\n\nYou continue to eat your dinner in peace.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "pwdeath10+"
  },
  {
    "text": "You spend the rest of the evening trying to keep a low profile. You give condolences to people when appropriate, but mostly you just stay out of the way. You're forced to stick around at least for a while as it would be too suspicious for you to just leave. \n\nEventually, things start to calm down a bit, and you're able to go back to sitting in the corner nursing a drink.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "pwdeath79-2"
  },
  {
    "text": "You make a small confused sound. The guy turns to you and winks.\n\nYou're sure that the spell hit. The only possible explanation is that this isn't some ruffian. You are looking at a very powerful creature. There are very few beings that can shrug off this spell like it's nothing, and you just cast it on one of them.  Your life is pretty much in his hands. If he decides to retaliate, you are not anywhere near powerful enough to defend yourself. ",
    "option1Name": "Spend the rest of the evening looking away",
    "option1Key": "pwd6-ignore",
    "option2Name": "Buy him a drink",
    "option2Key": "pwd6-drink",
    "key": "pwd6-2"
  },
  {
    "text": "You decide that the best course of action, is to just lie low and pretend that nothing happened.\n\nAfter a little while, the being whom you attacked gets up and walks out of the bar. As he passes by your table, he places a coin in front of you. You don't recognize it at all, and the script on it is unintelligible to you.\n\nIt's probably either cursed or some sort of death mark. What do you want to do with it?\n",
    "option1Name": "Pocket it",
    "option1Key": "pocketthecoin",
    "option2Name": "Pay your bar tab with it",
    "option2Key": "paywithcoin",
    "key": "pwd6-ignore"
  },
  {
    "text": "In a desperate attempt to placate this being, you order him a glass of the most expensive wine in the place. It takes most of the coin that you have to buy it, and you're not sure how you'll afford to eat tomorrow, but at least maybe you will be alive tomorrow.",
    "option1Name": "Continue",
    "option1Key": "pwd6-drink2",
    "key": "pwd6-drink"
  },
  {
    "text": "When the waitress delivers the wine, you can see her telling him that it came from you with your most sincere apologies. The being gives you a brief nod and smile. Feeling secure in that you aren't about to be squished like a bug, you go back to focusing on the drink at your own table.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "pwd6-drink2"
  },
  {
    "text": "Before you have a chance to reply to her, she continues,\n\n\"My son, Jimmy went missing this afternoon. He was last seen going into the mines. No one else will go looking for him. I saw how you stood up to that man earlier, would you please help me?\"\n",
    "option1Name": "Yes of course!",
    "option1Key": "helpOldLady",
    "option2Name": "Sure, I'll help",
    "option2Key": "helpOldLady",
    "option3Name": "Nope.",
    "option3Key": "donthelpOldLady",
    "key": "oldLady"
  },
  {
    "text": "\"Thank you so much! I've been worried sick over him!\"\n\nWith that, the woman leaves you. What do you do?\n",
    "option1Name": "Go at once to the mine",
    "option1Key": "toTheMine!",
    "option2Name": "Ask around about the kid",
    "option2Key": "askAround",
    "option3Name": "Get a good night sleep first",
    "option3Key": "sleepytime",
    "key": "helpOldLady"
  },
  {
    "text": "Jimmy is in danger, it's been two days already, and you know something terrible will happen if you don't get to him right away.\n\nYou finish the last of your drink, gather your things and head out the door.\n",
    "option1Name": "Continue",
    "option1Key": "minewardHO",
    "key": "toTheMine!"
  },
  {
    "text": "It does seem like a resonable and prudent idea to ask around a bit before heading right into the mine. Maybe someone here can tell you something about the boy, or maybe even the mine itself.\n\nWho do you ask?\n",
    "option1Name": "The Bartender",
    "option1Key": "askbartender",
    "option2Name": "The Waitress",
    "option2Key": "askwaitress",
    "option3Name": "The Grizzled Looking Miner",
    "option3Key": "askaminer",
    "key": "askAround"
  },
  {
    "text": "It's very late, and you decide that going into some strange mine that's apparently been closed for a few years is something best done well rested.\n\nYou finish off your last drink, and head up to your room.\n",
    "option1Name": "Good Night",
    "option1Key": "sleepytime2",
    "key": "sleepytime",
    "action": "doom"
  },
  {
    "text": "You find the entrance to the mine roughly a mile outside town. There is a faded sign welcoming you to\n\nTHE MINES OF IMMORTIA\n",
    "option1Name": "Continue",
    "option1Key": "minewardHO2",
    "key": "minewardHO",
    "action": "clear"
  },
  {
    "text": "The bartender is a short fellow with a large nose. You suspect that he might be part Gnome, but you don't ask. That would be impolite.\n\nIt's later in the evening now, and things are starting to slow down. You find him polishing a glass mug when you walk up to him.",
    "option1Name": "Continue",
    "option1Key": "askbartenderlist",
    "key": "askbartender"
  },
  {
    "text": "Next time the waitress comes near your table, you flag her down. She's carrying a tray full of empty glasses as she heads back to the kitchen. She looks a bit tired and frazzled from a long evening. ",
    "option1Name": "Continue",
    "option1Key": "askwaitresslist",
    "key": "askwaitress"
  },
  {
    "text": "You see a dwarf sitting by himself. He has a very impressive beard, and there's a mining pick hanging from his large pack that is sitting in on the chair next to him. \n\nYou go over to his table, and take a seat opposite of him.\n",
    "option1Name": "Continue",
    "option1Key": "askaminerlist",
    "key": "askaminer"
  },
  {
    "text": "What do you ask about?",
    "option1Name": "Jimmy",
    "option1Key": "askbartenderjimmy",
    "option2Name": "The Mines",
    "option2Key": "askbartendermines",
    "option3Name": "Provisions",
    "option3Key": "askbartenderprovisions",
    "option4Name": "I'm done talking to him",
    "option4Key": "askaround2",
    "key": "askbartenderlist",
    "persistant": true
  },
  {
    "text": "\"What can you tell my about the boy Jimmy?\" you ask.\n\nThe bartender sets his glass down, \"That kid ain't nothing but trouble. He's always where he shouldn't be, and he's more interested in the dead than the living.\"\n",
    "option1Name": "Continue",
    "option1Key": "askbartenderlist",
    "key": "askbartenderjimmy"
  },
  {
    "text": "\"I'm heading into the mines to find Jimmy, what do I need to know?\" You ask.\n\n\"Many a person has gone into those mines and not come out. Those that do come out, usually come here for a drink before they go home.\" The bartender looks you over.\n\n\"I'm sure you'll be just fine.\"\n",
    "option1Name": "Thanks",
    "option1Key": "askbartenderlist",
    "key": "askbartendermines",
    "action": "doom"
  },
  {
    "text": "\"Could I get some provisions for a little spelunking expedition?\" You ask.\n\n\"Hang on, let me see what I have available.\" The bartender says.\n",
    "option1Name": "Hanging on",
    "option1Key": "abtprovision2",
    "key": "askbartenderprovisions"
  },
  {
    "text": "Now that you feel more prepared to go on this adventure, are you ready to head out, or would you rather start out after a good night's sleep?\n",
    "option1Name": "Let's do it!",
    "option1Key": "minewardHO",
    "option2Name": "Sleep sounds good",
    "option2Key": "sleepytime",
    "key": "doneasking"
  },
  {
    "text": "\"Here, I have this pack full of things that some other idiot was going to take into the mines, but he disappeared in the night leaving it in his room.\"\n\nYou gain the Attribute: Well Prepared! That's probably going to come in handy later.\n",
    "option1Name": "Good Job!",
    "option1Key": "askbartenderlist",
    "key": "abtprovision2",
    "action": "getPrepared"
  },
  {
    "text": "Who do you want to talk to next?\n",
    "option1Name": "The Bartender",
    "option1Key": "askbartender",
    "option2Name": "The Waitress",
    "option2Key": "askwaitress",
    "option3Name": "The Grizzled Looking Miner",
    "option3Key": "askaminer",
    "option4Name": "I'm done asking around",
    "option4Key": "doneasking",
    "key": "askaround2",
    "persistant": true
  },
  {
    "text": "\"What can you tell my about the boy Jimmy?\" you ask.\n\n\"I don't really know much about him. He doesn't come in here very often. Seems like an okay kid from what I've seen.\"\n",
    "option1Name": "Continue",
    "option1Key": "askwaitresslist",
    "key": "askwaitressjimmy"
  },
  {
    "text": "\"I'm going to go into the mine looking for Jimmy, what do you know about it?\" You ask.\n\n\"Well, I used to date a miner. He left 3 years ago when they closed the mine down. He said that the mine owners were having some trouble with miners disappearing, and monsters attacking.\"\n",
    "option1Name": "Continue",
    "option1Key": "askwaitresslist",
    "key": "askwaitressmine"
  },
  {
    "text": "She looks at the collection of empty mugs that you've acquired throughout the evening. \n\n\"It's your liver.\" She says as she turns to walk away.\n",
    "option1Name": "Continue",
    "option1Key": "askwaitresslist",
    "key": "askwaitressdrink"
  },
  {
    "text": "What do you ask about?\n",
    "option1Name": "The kid",
    "option1Key": "askwaitressjimmy",
    "option2Name": "The mine",
    "option2Key": "askwaitressmine",
    "option3Name": "Another Round",
    "option3Key": "askwaitressdrink",
    "option4Name": "I'm done talking to her",
    "option4Key": "askaround2",
    "key": "askwaitresslist",
    "persistant": true
  },
  {
    "text": "What do you ask about?\n",
    "option1Name": "Jimmy",
    "option1Key": "askminerjimmy",
    "option2Name": "The mine",
    "option2Key": "askminermine",
    "option3Name": "Hot spelunking tips",
    "option3Key": "askminertips",
    "option4Name": "I'm done talking to him",
    "option4Key": "askaround2",
    "key": "askaminerlist",
    "persistant": true
  },
  {
    "text": "\"I don't know him, but any kid who is going to go into a closed mine by themselves is both brave, stupid, and probably easily influenced. I suspect that something dark is brewing here.\"\n\n\"and I don't mean the coffee.\"",
    "option1Name": "Continue",
    "option1Key": "askaminerlist",
    "key": "askminerjimmy"
  },
  {
    "text": "\"What do you know about the mine?\" You ask.\n\nThe dwarf sets down his drink and levels with you, \"The mine here has been closed for years. I'm just passing through town. Sorry, that's all I know about it.\"\n",
    "option1Name": "Continue",
    "option1Key": "askaminerlist",
    "key": "askminermine"
  },
  {
    "text": "\"I'm going to be heading into a mine looking for a missing kid. Do you have any advice?\" You ask.\n\nThe dwarf frowns at you, \"Don't, wandering around mines and caves with no idea of what you're doing is a good way to end up dead.\"\n",
    "option1Name": "Continue",
    "option1Key": "askaminertips2",
    "key": "askminertips"
  },
  {
    "text": "When he sees the look of dedication in your eyes, he continues, \"If you insist on going, I recommend bringing plenty of supplies. Being unprepared kills as many miners as monsters.\"\n\n\"I recommend talking to the bartender about provisions.\"\n",
    "option1Name": "Thanks",
    "option1Key": "askaminerlist",
    "key": "askaminertips2"
  },
  {
    "text": "You wake up feeling well rested. All of your HP is restored.\n\nAfter grabbing a quick breakfast from the inn, you grab your things and head out to the mine.\n",
    "option1Name": "And we're off!",
    "option1Key": "minewardHOam",
    "key": "sleepytime2",
    "action": "longrest"
  },
  {
    "text": "You find the entrance to the mine roughly a mile outside town. There is a faded sign welcoming you to\n\nTHE MINES OF IMMORTIA\n",
    "option1Name": "Continue",
    "option1Key": "minewardHO2am",
    "key": "minewardHOam",
    "action": "clear"
  },
  {
    "text": "Double-click this passage to edit it.",
    "key": "end"
  },
  {
    "text": "You tell the woman to bugger off.\n\nThe rest of the evening is fairly uneventful.\n",
    "option1Name": "Continue",
    "option1Key": "donthelp2",
    "key": "donthelpOldLady"
  },
  {
    "text": "You spend a few days hanging around town looking for work, but not really much pops up.\n",
    "option1Name": "Continue",
    "option1Key": "donthelp3",
    "key": "donthelp2"
  },
  {
    "text": "You die several days later in a zombie apocalypse. As life fades from you, you notice that the zombie who killed you looks like a Jimmy.\n",
    "option1Name": "RIP",
    "option1Key": "end",
    "key": "donthelp3"
  },
  {
    "text": "The first chamber in the mine is clearly a staging ground for deeper exploration. The remains of a wooden table that was long ago smashed by something are on one side of the chamber.\n\nYou can make out a variety of tracks going deeper into the mine.\n",
    "option1Name": "Continue down the mine",
    "option1Key": "entrancecont",
    "key": "enterthemine"
  },
  {
    "text": "The entrance to the mine seems especially dark and foreboding at night. The mine goes straight into the side of a mountain. The entrance is boarded over, but some of the boards are rotted, and others have been removed leaving enough space for just about anyone to squeeze through.\n",
    "option1Name": "Torch in hand I go in",
    "option1Key": "enterthemine",
    "key": "minewardHO2",
    "image": "MineEntrance"
  },
  {
    "text": "The mine goes straight into the side of a mountain. The entrance is boarded over, but some of the boards are rotted, and others have been removed leaving enough space for just about anyone to squeeze through. It seems fairly dark inside.\n",
    "option1Name": "Torch in hand I go in",
    "option1Key": "enterthemine",
    "key": "minewardHO2am",
    "image": "MineEntrance"
  },
  {
    "text": "You are walking through a tunnel just large enough for a couple of people to walk side by side. You come to a section that is covered in wood planks. Without any other options, you carefully take a step on the planks followed by another and another when you suddenly hear a loud creaking.\n",
    "option1Name": "Roll Dexterity",
    "option1Key": "entrancecont6-",
    "option2Name": "entrancecont79",
    "option2Key": "entrancecont79",
    "option3Name": "entrancecont10+",
    "option3Key": "entrancecont10+",
    "key": "entrancecont",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "You feel the wood beneath you begin to give. You jump forward just in time, and you reach your arms out and grab onto some of the more solid planks.\n\nYou find yourself dangling above what seems to be a rather deep hole. Unfortunately, it seems that you didn't come out unscathed. After you pull yourself up onto solid ground, you find that you have a bit of a gash on your belly. Lose @X HP.\n",
    "option1Name": "Awww Man!",
    "option1Key": "entrancecont792",
    "key": "entrancecont79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You can tell that the wood is about to give away under you so you dive forward into a roll.\n\nYou find yourself laying on solid ground with a rather deep looking hole behind you. It's a good thing you took all those Gymnastics classes when you were younger.\n\nYou stand up and continue on your journey.\n",
    "option1Name": "Continue",
    "option1Key": "pastpit1",
    "key": "entrancecont10+"
  },
  {
    "text": "The wood crumbles out from beneath you. You scrabble to grab onto something, but everything that you can get a hand on breaks off in your grip. \n\nYou fall",
    "option1Name": "Continue",
    "option1Key": "fallinentrance",
    "key": "entrancecont6-"
  },
  {
    "text": "The ground below is quite hard. You know this because it really hurts when you meet it.\n\nYou lose @X HP.\n",
    "option1Name": "Ouch!",
    "option1Key": "bottomofpit1",
    "key": "fallinentrance",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "The good news is, you're still alive. We still don't know if you managed to stay conscious through that severe head trauma.\n\nWhy don't you roll Constitution to find out.",
    "option1Name": "okay...",
    "option1Key": "bottomofpit16-",
    "option2Name": "bottomofpit179",
    "option2Key": "bottomofpit179",
    "option3Name": "bottomofpit110+",
    "option3Key": "bottomofpit110+",
    "key": "bottomofpit1",
    "moveTriggered": true,
    "moveStat": "Constitution"
  },
  {
    "text": "Apparently not.\n\nYou wake up later with a pretty nasty headache. You don't know how much time has passed, but you think about poor Jimmy and you manage to pull yourself to your feet.\n",
    "option1Name": "Continue",
    "option1Key": "stillinthepit",
    "key": "bottomofpit16-",
    "action": "doom"
  },
  {
    "text": "You manage to maintain consciousness, but you're pretty sure that you're going to be really sore in the morning.\n\nAfter laying there for a minute, you manage to pull yourself back to your feet.",
    "option1Name": "Continue",
    "option1Key": "stillinthepit",
    "key": "bottomofpit179"
  },
  {
    "text": "You don't black out. You don't even get the wind knocked out. Somewhere in the back of your head the pain registers, but you can't be bothered with it.\n\nYou pull yourself back to your feet to continue your journey.\n",
    "option1Name": "Continue",
    "option1Key": "stillinthepit",
    "key": "bottomofpit110+"
  },
  {
    "text": "You have reached 0 hit points and you have died.\n\nThis happens sometimes. The good news is that you can play the game all over again! Isn't that exciting?!?!\n",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "dead"
  },
  {
    "text": "The torch that you were carrying went out in the fall, but you manage to find it because the hot end is still glowing. You get it re-lit and examine the room that you are in.\n\nThis chamber is a small natural cavern, not something that was carved out by the miners. There is a natural shaft going straight up (which you recently travelled through).\n\nYou can hear water running, and there is a small tunnel that you can squeeze through to go forward. Which do you want to do?\n",
    "option1Name": "Climb up the shaft",
    "option1Key": "climbshaft",
    "option2Name": "Squeeze through tunnel",
    "option2Key": "squeezetunnel",
    "key": "stillinthepit"
  },
  {
    "text": "This dialog should not ever display",
    "option1Name": "climbshaftwithrope",
    "option1Key": "climbshaftwithrope",
    "option2Name": "climbshaftsansrope",
    "option2Key": "climbshaftsansrope",
    "key": "climbshaft",
    "action": "checkPrepared"
  },
  {
    "text": "You crouch down and try to get some of your torchlight to shine down the tunnel. You can't see very far, but it looks like you should be able to make it at least as far as you can see.\n",
    "option1Name": "Continue",
    "option1Key": "squeezetunnel2",
    "key": "squeezetunnel"
  },
  {
    "text": "Fortunately for you, you have that pack of supplies that you got from the bartender. You rummage in it and find some rope and a hook.\n\nYou spin it around and throw it up the shaft like some sort of ninja.\n\nYou feel the hook grab something fairly solid, and you shimmy back up the rope. You find yourself on the other side of the whole that you fell through.\n\nAfter dusting yourself off, you continue down the tunnel.\n",
    "option1Name": "That was handy",
    "option1Key": "pastpit1",
    "key": "climbshaftwithrope"
  },
  {
    "text": "You look at the long shaft. It looks very slick. Maybe if you had a rope or something you might be able to climb it. Since you don't, you decide that the narrow tunnel is a better option.\n",
    "option1Name": "Fine...",
    "option1Key": "squeezetunnel",
    "key": "climbshaftsansrope"
  },
  {
    "text": "You walk down the tunnel another 50 feet or so, and you come to a large shaft.\n\nThere is a wooden platform in the shaft with a pulley system that allows it to be raised and lowered. The pulley is tied off to prevent it from going down. There is a wheel attached with gears to make it possible for one person to raise or lower the platform by spinning the wheel, or several people to operate it with a heavy load.\n\nOf course, if you let go of the wheel without the rope tied off you will plummet to your death.\n",
    "option1Name": "Continue",
    "option1Key": "topoftheshaft",
    "key": "pastpit1"
  },
  {
    "text": "You bandage yourself up using a piece of fabric that you rip off of another piece of your clothing.\n\nAll bandaged up, you continue down the tunnel.\n",
    "option1Name": "Continue",
    "option1Key": "pastpit1",
    "key": "entrancecont792"
  },
  {
    "text": "You start to crawl through the tunnel. It's difficult as you're still holding the torch in one hand and trying to pull your pack behind you. The smoke from the torch is stinging your eyes, and your elbow is getting sore from supporting your weight on the rocky ground.\n",
    "option1Name": "Continue",
    "option1Key": "squeezetunnel3",
    "key": "squeezetunnel2"
  },
  {
    "text": "After what seems like forever, you are relieved to reach a large chamber. The good news is that you can be done crawling and swimming. The bad news is that the tunnel comes out 30 feet up on a wall. You're a bit concerned about the long drop as you've recently had a bad experience with something similar.\n",
    "option1Name": "Continue",
    "option1Key": "tunneldropchoice",
    "key": "squeezetunnelend"
  },
  {
    "text": "This should never be typed\n",
    "option1Name": "tdropwizard",
    "option1Key": "tdropwizard",
    "option2Name": "tdropfighterexcheck",
    "option2Key": "tdropfighterexcheck",
    "option3Name": "error",
    "option3Key": "error",
    "key": "tunneldropchoice",
    "action": "checkClass"
  },
  {
    "text": "Fortunately, you are a wizard, and you can simply cast Feather Fall to get to the ground easily. That's pretty handy.\n\nOf course, to cast a spell, you'll need to roll your Intelligence.\n",
    "option1Name": "Roll!",
    "option1Key": "tdropwizard6-",
    "option2Name": "tdropwizard79",
    "option2Key": "tdropwizard79",
    "option3Name": "tdropwizard10+",
    "option3Key": "tdropwizard10+",
    "key": "tdropwizard",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Okay, you mentally prepare yourself to climb down the wall to the bottom of the cavern. You peer over the edge, and it looks like there should be enough small ledges to use as handholds to lower yourself.\n\nYou turn around, and carefully start down the wall.\n\nOf course, that means you'll need to roll Dexterity.\n",
    "option1Name": "Roll!",
    "option1Key": "tdropfighter6-",
    "option2Name": "tdropfighter10+",
    "option2Key": "tdropfighter10+",
    "option3Name": "tdropfighter10+",
    "option3Key": "tdropfighter10+",
    "key": "tdropfighter",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "UmmmContinue this is awkward.\n\nYou shouldn't be ever seeing this.\nSomething went wrong.\nYou need to start over from the beginning.\nI'm so sorry.\nPlease report this to steve@radicalbomb.com\n",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "error"
  },
  {
    "text": "You jump off the ledge as you recite the incantation for Feather Fall. Unfortunately, you forgot that you need to actually have a feather to make the spell happen.\n\nThe ground is very hard when you meet it. You lose @X HP.\n",
    "option1Name": "Continue",
    "option1Key": "tdropwizard6-2",
    "key": "tdropwizard6-",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You pull a feather out of your pocket, recite the right incantation, then step off the ledge.\n\nYou gently float to the ground. That all seemed too easy. You have a lingering sense of dread...\n\nOnce you've landed, you take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "largecavern1",
    "key": "tdropwizard79",
    "action": "doom"
  },
  {
    "text": "You pull a feather out of your pocket, recite the right incantation, then step off the ledge.\n\nYou gently float to the ground.\n\nOnce you've landed, you take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "largecavern1",
    "key": "tdropwizard10+"
  },
  {
    "text": "A bit shaken from the fall, you pick yourself up off the ground and look around.\n",
    "option1Name": "Continue",
    "option1Key": "largecavern1",
    "key": "tdropwizard6-2"
  },
  {
    "text": "This text should never display. Please let me know if you are reading this.\n",
    "option1Name": "spiderroom",
    "option1Key": "spiderroom",
    "option2Name": "cavetrolls",
    "option2Key": "cavetrolls",
    "key": "largecavern1",
    "action": "randomroom"
  },
  {
    "text": "You start climbing down the face of the wall.\n\nYou have a feeling of Déjà vu as your grip slips and you start to plummet to the bottom of the cavern.\n\nThe ground is very hard when you meet it. You lose @X Hit Point.\n",
    "option1Name": "Continue",
    "option1Key": "trdopfighter6-2",
    "key": "tdropfighter6-",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You deftly scale down the rock wall into the main cavern. \n\nOnce you get to the bottom, you take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "largecavern1",
    "key": "tdropfighter10+"
  },
  {
    "text": "A bit shaken from the fall, you pick yourself up off the ground and look around.\n",
    "option1Name": "Continue",
    "option1Key": "largecavern1",
    "key": "trdopfighter6-2"
  },
  {
    "text": "As you're crawling, put your hand into water. You realize that the tunnel has a decline to it, and is flooded going forward.\n\nYou peer ahead, and it looks like it will be completely submerged within 10 feet. You really don't know if it will even keep continuing on underwater or if it will let out somewhere.\n",
    "option1Name": "Continue",
    "option1Key": "squeezetunnel4",
    "key": "squeezetunnel3"
  },
  {
    "text": "Of course, if it didn't that would be really boring for the narrative. So, you brave on.\n\nWhen you're about to run out of your last chance for a good breath, you douse the torch and take a deep breath. Then blind and not knowing how long this will last, you continue on underwater.\n\nRoll Constitution to see if you make it.\n",
    "option1Name": "Roll",
    "option1Key": "squeezetunnel46-",
    "option2Name": "squeezetunnel479",
    "option2Key": "squeezetunnel479",
    "option3Name": "squeezetunnel410+",
    "option3Key": "squeezetunnel410+",
    "key": "squeezetunnel4",
    "moveTriggered": true,
    "moveStat": "Constitution"
  },
  {
    "text": "Apparently swimming underwater in a dark tunnel with no way to breath is not one of your better ideas.\n\nThe good news is ...\n\nOkay, so there isn't any good news. But the bad news is you drown.\n\nClick below to try again.\n",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "squeezetunnel46-"
  },
  {
    "text": "Swimming underwater in a dark tunnel with no way to breath is is probably not the best of ideas.\n\nThe good news is...\n\nYou're alive. You find the other end of the tunnel, and get to the surface just in the nick of time. The bad news is that the event left you exhausted and you are struggling to keep moving. You take a moment to relight your torch, and you continue on.\n",
    "option1Name": "Continue",
    "option1Key": "squeezetunnelend",
    "key": "squeezetunnel479",
    "action": "addAttribute",
    "attribute": "exhausted"
  },
  {
    "text": "Swimming underwater in a dark tunnel with no way to breath? Psh... that's child's play.\n\nYou find the other end of the tunnel, and get to the surface with plenty of breath again. The experience was a bit thrilling. You take a moment to relight your torch, and you continue on.\n",
    "option1Name": "Continue",
    "option1Key": "squeezetunnelend",
    "key": "squeezetunnel410+"
  },
  {
    "text": "[[tdropfighterexhausted]]",
    "option1Name": "tdropfighterexhausted",
    "option1Key": "tdropfighterexhausted",
    "option2Name": "tdropfighter",
    "option2Key": "tdropfighter",
    "key": "tdropfighterexcheck",
    "action": "checkAttribute",
    "attribute": "Exhausted"
  },
  {
    "text": "Okay, you mentally prepare yourself to climb down the wall to the bottom of the cavern. You peer over the edge, and it looks like there should be enough small ledges to use as handholds to lower yourself. You're still pretty exhausted from your swimming adventure. This probably isn't a good idea. There really isn't much choice though.\n\nYou turn around, and carefully start down the wall.\n\nOf course, that means you'll need to roll Dexterity.\n",
    "option1Name": "Roll!",
    "option1Key": "tdropfighterexhausted6-",
    "option2Name": "tdropfighterexhausted79",
    "option2Key": "tdropfighterexhausted79",
    "option3Name": "tdropfighterexhausted10+",
    "option3Key": "tdropfighterexhausted10+",
    "key": "tdropfighterexhausted",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "You're so weak from almost drowning, that you don't have a chance in holding onto the edge of a wall. You slip almost immediately. Your head gets hit several times on the way down, and you land in a heap.\n\nYou are dead.\n\nWould you like to play again?",
    "key": "tdropfighterexhausted6-"
  },
  {
    "text": "You deftly scale down the rock wall into the main cavern. \n\nOnce you get to the bottom, you take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "largecavern1",
    "key": "tdropfighterexhausted10+"
  },
  {
    "text": "You start climbing down the face of the wall.\n\nYou have a feeling of Déjà vu as your grip slips and you start to plummet to the bottom of the cavern.\n\nThe ground is very hard when you meet it. You lose 1 HP.\n",
    "option1Name": "Continue",
    "option1Key": "trdopfighter6-2",
    "key": "tdropfighterexhausted79"
  },
  {
    "text": "You carefully walk onto the platform and examine the apparatus and shaft. Above you is just the ceiling with the pulleys for the lift. The only way to go is down.\n",
    "option1Name": "Let's do it",
    "option1Key": "topoftheshaft2",
    "key": "topoftheshaft"
  },
  {
    "text": "You grab the wheel to hold it steady, and you start to untie the rope. You realize that this operation would be a lot easier with two people as it's tricky to hold the wheel steady while untying the rope.\n\nRoll Dexterity to see if you can do it.\n",
    "option1Name": "Roll",
    "option1Key": "untyingshaft6-",
    "option2Name": "untyingshaft79",
    "option2Key": "untyingshaft79",
    "option3Name": "untyingshaft10+",
    "option3Key": "untyingshaft10+",
    "key": "topoftheshaft2",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "The knot is a lot trickier to untie than you expected. You have to pull pretty hard on it, and when it finally lets loose, you slip and lose your hand hold on the wheel.\n\nYou are now falling, very quickly.\n\nRoll Strength to see if you can grab the wheel and stop the fall.\n",
    "option1Name": "Roll",
    "option1Key": "stopthefall6-",
    "option2Name": "stopthefall79",
    "option2Key": "stopthefall79",
    "option3Name": "stopthefall10+",
    "option3Key": "stopthefall10+",
    "key": "untyingshaft6-",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "The knot is a bit tricky to untie. You have to really pull to get it to release, and in doing so your grip on the wheel slips for a just a moment.\n\nYou are able to grab it again before you really lose control, but the platform drops a foot or two, then wobbles a bit.\n\nYou should have worn your brown pants.\n",
    "option1Name": "Continue",
    "option1Key": "untyingshaft792",
    "key": "untyingshaft79"
  },
  {
    "text": "It's a tricky operation, but you manage to keep a hand on the wheel and hold the platform steady while untying.\n\nYou begin to slowly lower yourself down the hole.\n",
    "option1Name": "Continue",
    "option1Key": "downtheshaft",
    "key": "untyingshaft10+"
  },
  {
    "text": "You've been lowering yourself for about 10 minutes. The light from your torch no longer reaches the top of the shaft where you started.\n\nYou get to a point where a couple of tunnels just barely too narrow for you to actually fit in meet the shaft.\n\nYou are attempting to peer down one of the tunnels when you hear a scraping/shuffling noise coming the other one.\n",
    "option1Name": "Continue",
    "option1Key": "downtheshaft2",
    "key": "downtheshaft"
  },
  {
    "text": "You grab hold of the wheel, and it comes right off in your hands. You now have no way to stop the fall.\n\nAs you plummet to your death, you think that maybe you should have stayed out of abandoned mines.\n\nWant to try again?",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "stopthefall6-"
  },
  {
    "text": "You grab the spinning wheel to stop the fall. The good news is that the fall gets stopped. The bad news is that you got flipped over when you grabbed it and you hit pretty hard on your back.\n\nYou lose @X HP.\n",
    "option1Name": "Continue",
    "option1Key": "stopthefall792",
    "key": "stopthefall79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "The adrenaline rush of the fall allows you to spring into action. With two hands you grab the wheel gingerly and slowly bring it to a stop.\n\nNow that you have it under control, you catch your breath, then slowly start back down the shaft.\n",
    "option1Name": "Continue",
    "option1Key": "downtheshaft",
    "key": "stopthefall10+"
  },
  {
    "text": "You stand back up carefully not to let go of the wheel again, slowly you start to lower yourself further down the shaft.\n",
    "option1Name": "Continue",
    "option1Key": "downtheshaft",
    "key": "stopthefall792"
  },
  {
    "text": "After calming down a bit, you slowly start to descend down the shaft.\n",
    "option1Name": "Continue",
    "option1Key": "downtheshaft",
    "key": "untyingshaft792"
  },
  {
    "text": "You turn around just in time to see a pair of goblins jump out of the tunnel and land on the platform.\n\nThey are holding short swords and look angry.\n\nWhat do you do?",
    "option1Name": "Attempt to reason with them",
    "option1Key": "parleygoblins",
    "option2Name": "Fight!",
    "option2Key": "fightgoblins",
    "key": "downtheshaft2"
  },
  {
    "text": "You realize that fighting goblins on a platform that is being held by a rope and will fall if you let go a wheel is a bad idea. \n\nSo, you try to parley with them.\n\nRoll your Charisma.",
    "option1Name": "Roll",
    "option1Key": "parleygoblins6-",
    "option2Name": "parleygoblins79",
    "option2Key": "parleygoblins79",
    "option3Name": "parleygoblins10+",
    "option3Key": "parleygoblins10+",
    "key": "parleygoblins",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "Should never see this\n",
    "option1Name": "fightgoblinswizard",
    "option1Key": "fightgoblinswizard",
    "option2Name": "fightgoblinsfighter",
    "option2Key": "fightgoblinsfighter",
    "key": "fightgoblins",
    "action": "checkClass"
  },
  {
    "text": "With one hand on the wheel, and the other raised in front of you, you prepare to cast magic missile at the goblins.\n\n(You know better than to try a fireball when standing on a wooden platform.)\n\nRoll Intelligence to cast the spell.\n",
    "option1Name": "Roll",
    "option1Key": "fightgoblinswizard6-",
    "option2Name": "fightgoblinswizard79",
    "option2Key": "fightgoblinswizard79",
    "option3Name": "fightgoblinswizard10+",
    "option3Key": "fightgoblinswizard10+",
    "key": "fightgoblinswizard",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You pull your sword, and prepare to fight.\n\nRoll your Strength\n",
    "option1Name": "roll",
    "option1Key": "fightgoblinsfighter6-",
    "option2Name": "fightgoblinsfighter79",
    "option2Key": "fightgoblinsfighter79",
    "option3Name": "fightgoblinsfighter10+",
    "option3Key": "fightgoblinsfighter10+",
    "key": "fightgoblinsfighter",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "Whatever it is you said and did, it apparently wasn't the right thing.\n\nThe goblins spring to attack.\n",
    "option1Name": "Continue",
    "option1Key": "fightgoblins",
    "key": "parleygoblins6-"
  },
  {
    "text": "Using gestures you manage to get the point across that if you let go of the wheel, all three of you will plummet to your deaths.\n\nThe Goblins talk to each other in their strange language. They seem to see reason in that logic, and decide that you aren't worth the trouble.\n",
    "option1Name": "Continue",
    "option1Key": "parleygoblins792",
    "key": "parleygoblins79"
  },
  {
    "text": "Luckily, you speak Goblin.\n\nYou learn that their names are Bradley and Philip. They were angered by the platform moving as they had recently taken it back to the top where it belongs because some kid recently rode it to the bottom and left it there.\n\nYou promise them to take it back to the top when you are done with your adventure.\n",
    "option1Name": "Continue",
    "option1Key": "goblinsleave",
    "key": "parleygoblins10+"
  },
  {
    "text": "Philip and Bradley bid you farewell and wish you luck on your adventure. Because you were so well mannered, Bradley casts a healing spell on you. You regain all of your HP.\n\nAfter that, they climb back into the tunnel. You proceed on your way.\n\nOnce you get to the bottom, You rest the platform on the ground, and take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "bottomofshaft",
    "key": "goblinsleave"
  },
  {
    "text": "This text should never display. Please let me know if you are reading this.\n",
    "option1Name": "spiderroom",
    "option1Key": "spiderroom",
    "option2Name": "cavetrolls",
    "option2Key": "cavetrolls",
    "key": "bottomofshaft",
    "action": "randomroom"
  },
  {
    "text": "Using different gestures, the goblins make it pretty clear that if they see you again, they won't hesitate to fight you.\n\nAfter that, they climb back into the tunnel. You proceed on your way.\n\nOnce you get to the bottom, You rest the platform on the ground, and take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "bottomofshaft",
    "key": "parleygoblins792"
  },
  {
    "text": "You try to concentrate on the spell, but the wobbling of the platform, and the fact that you have to keep it from falling breaks your conecentration. The spell fizzles.\n\nThe two goblins charge in causing you to let go of the wheel.\n",
    "option1Name": "Continue",
    "option1Key": "fightgoblinswizard6-2",
    "key": "fightgoblinswizard6-"
  },
  {
    "text": "You manage to cast your magic missile. A handful of bolts fly from your hand and take down one of the goblins. The other one managed to get through and cut you with his sword.\n\nYou lose @X HP.\n",
    "option1Name": "Continue",
    "option1Key": "fightgoblinswizard792",
    "key": "fightgoblinswizard79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "Two bolts of energy spring from your open hand, each one taking a goblin in the chest. The blasts knock them back, and they both hit the wall of the shaft, and fall through the gap between the platform and the wall. You're confident that they won't survive that fall.\n",
    "option1Name": "Continue",
    "option1Key": "fightgoblinsover",
    "key": "fightgoblinswizard10+"
  },
  {
    "text": "You are falling. So are the goblins.\n\nThis sudden change in events makes them reconsider their actions. You may not speak goblin, but you're pretty sure that one of them just said \"Oh no, not again.\"\n\nYou all hit the bottom. You lose @X HP.\n",
    "option1Name": "Continue",
    "option1Key": "fightgoblinswizard6-3",
    "key": "fightgoblinswizard6-2",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "That hurt, a lot.\nYou lay on the ground for a minute. You look around and both of the goblins are dead.\n\nYou pick yourself up off the ground, and take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "bottomofshaft",
    "key": "fightgoblinswizard6-3"
  },
  {
    "text": "With the Goblins gone, you finish lowering yourself to the bottom of the shaft. \n\nYou rest the platform on the ground, and take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "bottomofshaft",
    "key": "fightgoblinsover"
  },
  {
    "text": "After noticing that his companion is dead, the goblin flees back into the tunnel.\n\nWith the goblins gone, you finish lowering yourself to the bottom of the shaft. \n\nYou rest the platform on the ground, and take a look around.\n",
    "option1Name": "Continue",
    "option1Key": "bottomofshaft",
    "key": "fightgoblinswizard792"
  },
  {
    "text": "The goblis come in to attack. You do your best to fend them off. In the commotion of the melee, you lose your grip on the wheel.\n",
    "option1Name": "Continue",
    "option1Key": "fightgoblinswizard6-2",
    "key": "fightgoblinsfighter6-"
  },
  {
    "text": "With one hand occupied, you're fighting ability isn't so great. You manage to take down one of the goblins. The other one managed to get through and cut you with his sword.\n\nYou lose 2 HP.\n",
    "option1Name": "Continue",
    "option1Key": "fightgoblinswizard792",
    "key": "fightgoblinsfighter79"
  },
  {
    "text": "Even with one hand occupied, two goblins are no match for your skill. You quickly dispatch both of them. They fall through the gap between the platform at the wall of the shaft.\n",
    "option1Name": "Continue",
    "option1Key": "fightgoblinsover",
    "key": "fightgoblinsfighter10+"
  },
  {
    "text": "This room is a naturally formed cavern that was once the main extraction chamber for the mine. There are a few broken hand carts on the ground near the central elevator shaft. There are places on the walls and columns where it is clear minerals were removed via pick-axe.\n\nAlso, everything is covered in spider webs.\n",
    "option1Name": "Continue",
    "option1Key": "spiderroom2",
    "key": "spiderroom",
    "action": "clear"
  },
  {
    "text": "This room is a naturally formed cavern that was once the main extraction chamber for the mine. There are a few smashed hand carts on the ground near the central elevator shaft. There are places on the walls and columns where it is clear minerals were removed via pick-axe.\n\nYou also see some large figures on the far side of the room, but you can't see them well in the torch light.\n",
    "option1Name": "Continue",
    "option1Key": "cavetrolls2",
    "key": "cavetrolls",
    "action": "clear"
  },
  {
    "text": "You found the Deep Gnome room.\nHowever, I haven't written it yet. You must be playing in an alpha for beta version. If you are reading this and you bought the game on an app store, please send me a nasty letter because I forgot to come back and write this.\n\nSo that you can continue testing, choose either Spiders or Cave Trolls\n",
    "option1Name": "Spiders",
    "option1Key": "spiderroom",
    "option2Name": "Cave Trolls",
    "option2Key": "cavetrolls",
    "key": "deepgnomes",
    "action": "clear"
  },
  {
    "text": "Not regular little spider webs mind you. These are really big spider webs. If you're not careful, you might actually get stuck in them.\n\nYou think you can see another tunnel on the far side leading deeper into the caverns. It's difficult to tell in the torch light.\n",
    "option1Name": "Continue",
    "option1Key": "spiderroom3",
    "key": "spiderroom2"
  },
  {
    "text": "As you're looking around the room, you hear a scuttling sound behind you.\n\nYou slowly turn around to see what's making the sound.",
    "option1Name": "Continue",
    "option1Key": "spiderroomturnaround",
    "key": "spiderroom3"
  },
  {
    "text": "You see before you, the biggest, meanest, fuzziest, giantest, hugest (did I mention that it's really big?) spider that you've ever seen.\n\nNow, what do you do?",
    "option1Name": "Yeah, I should run.",
    "option1Key": "spiderrunaway",
    "option2Name": "There's a torch in my hand...",
    "option2Key": "burnitwithfire",
    "key": "spiderroomturnaround"
  },
  {
    "text": "You turn and start running from the giant spider. Unfortunately, the room is still full of giant spider webs making it difficult to run. \n\nYou're going to need to roll Dexterity to get through the room.\n",
    "option1Name": "Roll!",
    "option1Key": "runfromthegiantspider6-",
    "option2Name": "runfromtheflaminspider79",
    "option2Key": "runfromtheflaminspider79",
    "option3Name": "runfromthegiantspider10+",
    "option3Key": "runfromthegiantspider10+",
    "key": "spiderrunaway",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "There IS a torch in your hand. Setting the giant spider on fire seems like a brilliant idea, especially since you're reacting more and thinking less.\n\nOf course to hit the spider with the torch in your hand, that's a strength roll.\n",
    "option1Name": "Roll!",
    "option1Key": "burnitwithfire6-",
    "option2Name": "burnitwithfire79",
    "option2Key": "burnitwithfire79",
    "option3Name": "burnitwithfire10+",
    "option3Key": "burnitwithfire10+",
    "key": "burnitwithfire",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "That didn't work very well.\n\nYou tried throwing the torch at the spider in a panic. It bounced off it's carapace and you're not entirely sure where it went. But You are sure that it's no longer lit. It's very dark in here. \n\nThere's also a giant spider that you now can't see.\n\nI'll spare you the gruesome details, but it's time to restart the game.\n\nRIP\n",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "burnitwithfire6-"
  },
  {
    "text": "You succeed in burning the spider a little bit, catching part of it's fuzz on fire. However, you got a bit close to it when you were doing that, and it managed to catch you in the leg with one of it's claws. \n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "burnitwithfire792",
    "key": "burnitwithfire79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "As the spider opens it's dripping mandibles, you hit the spider in the eye with the torch giving you a moment to prepare yourself for a followup while it writhes in pain.\n",
    "option1Name": "Continue",
    "option1Key": "burnitwithfirehugesuccess",
    "key": "burnitwithfire10+"
  },
  {
    "text": "You'll never read this. Please tell me if you do.\n",
    "option1Name": "biwfhsWizard",
    "option1Key": "biwfhsWizard",
    "option2Name": "biwfhsFighter",
    "option2Key": "biwfhsFighter",
    "key": "burnitwithfirehugesuccess",
    "action": "checkClass"
  },
  {
    "text": "With the spider backing up a bit, you now the opportunity to blast it with a fireball. Which seems a good idea since fire is apparently effective against it.\n\nLet's roll some dice.\n",
    "option1Name": "Fireball!",
    "option1Key": "biwfhsWizard6-",
    "option2Name": "biwfhsWizard79",
    "option2Key": "biwfhsWizard79",
    "option3Name": "biwfhsWizard10+",
    "option3Key": "biwfhsWizard10+",
    "key": "biwfhsWizard",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "The spider backs up, giving you the opportunity to draw your sword and finish it off.\n\nLet's roll some dice.\n",
    "option1Name": "Roll Strength",
    "option1Key": "biwfhsFighter6-",
    "option2Name": "biwfhsFighter79",
    "option2Key": "biwfhsFighter79",
    "option3Name": "biwfhsFighter10+",
    "option3Key": "biwfhsFighter10+",
    "key": "biwfhsFighter",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "This spider seems to be more resiliant to heat than you previously imagined. It's on fire, but that doesn't seem to be bothering it much anymore. \n\nAlso, some of the spider webs that are filling the cavern are catching on fire. \n\nIt's time to make like a tree and get out of here.\n",
    "option1Name": "Run Away!",
    "option1Key": "runfromtheflaminspider",
    "key": "biwfhsWizard6-"
  },
  {
    "text": "The spider is now really on fire. You're pretty sure that it's going to die any moment now. Also all the spiderwebs filling the cavern are also on fire. It's time to make a quick exit from this cavern.\n",
    "option1Name": "Run Away",
    "option1Key": "fleeflamingwebs",
    "key": "biwfhsWizard79"
  },
  {
    "text": "In a spectacular display of pyrotechnics the spider burns to a crisp, no longer able to threaten you again.\n\nWell done.\n\nAs long as you are mindful of the many spiderwebs in the cavern, you are free to expore.\n",
    "option1Name": "Continue",
    "option1Key": "explorespidercavern",
    "key": "biwfhsWizard10+"
  },
  {
    "text": "The fire seems to be causing the spider some pain as it backs up a bit giving you a chance to attack again.\n",
    "option1Name": "Continue",
    "option1Key": "burnitwithfirehugesuccess",
    "key": "burnitwithfire792"
  },
  {
    "text": "It appears that the history of this cavern is rich indeed. The evidence that you noticed before of the mining is very apparent. When you search around a bit more,  it looks like there had been another occupant of the cavern before the spider arrived. There isn't a lot to go on, but someone had set up a camp here briefly. It's likely that they were driven out, or eaten by the spider.\n",
    "option1Name": "Continue",
    "option1Key": "explorespidercavern2",
    "key": "explorespidercavern"
  },
  {
    "text": "While the spider might not be long for this world, it's still moving, and pretty scarry looking. Also, this cavern is getting pretty hot, so your best bet is to start running.\n\nOf course, running in a room full of flaming spider webs with a giant spider that is on fire and may also be chasing you isn't a simple task.\n\nLet's roll Dexterity.\n",
    "option1Name": "Roll!",
    "option1Key": "runfromtheflaminspider6-",
    "option2Name": "runfromtheflaminspider79",
    "option2Key": "runfromtheflaminspider79",
    "option3Name": "runfromtheflaminspider10+",
    "option3Key": "runfromtheflaminspider10+",
    "key": "fleeflamingwebs",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "So, you're running from a flaming spider. \n\nGood times.\n\nLet's roll Dexterity to see how that works out for you.\n",
    "option1Name": "Roll!",
    "option1Key": "runfromtheflaminspider6-",
    "option2Name": "runfromtheflaminspider79",
    "option2Key": "runfromtheflaminspider79",
    "option3Name": "runfromtheflaminspider10+",
    "option3Key": "runfromtheflaminspider10+",
    "key": "runfromtheflaminspider",
    "moveTriggered": true,
    "moveStat": "Dexterity",
    "action": "doom"
  },
  {
    "text": "You trip on some spider webs that haven't caught on fire yet.\n\nYou land in more spider webs. They're really big, and really sticky, and your stuck. This is pretty much the worst thing ever.\n\nBut it gets worse when a giant spider that is still on fire walks up to you and devours you.\n\nThat's the end of your adventure.\nWould you like to try again?\n",
    "option1Name": "Yes",
    "option1Key": "end",
    "key": "runfromtheflaminspider6-"
  },
  {
    "text": "This should never get displayed.\n",
    "option1Name": "runfromtheflaminspider79exhausted",
    "option1Key": "runfromtheflaminspider79exhausted",
    "option2Name": "runfromtheflaminspider79notexhausted",
    "option2Key": "runfromtheflaminspider79notexhausted",
    "key": "runfromtheflaminspider79",
    "action": "checkAttribute",
    "attribute": "Exhausted"
  },
  {
    "text": "You make it to the far end of the cavern where a tunnel leads futher down. You are relieved that the tunnel is too narrow for the spider to fit in. \n\nRelieved that the ordeal is over, you lean against the wall and catch your breath.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "runfromtheflaminspider10+"
  },
  {
    "text": "As you're running, you think you should be able to make it there. However you are still really exhausted from nearly drowning a few minutes ago.\n\nThe escape route that you're running for seems a lot further away than it did before.\n\nYour feet start to slow down, and eventually you collapse.\n\nAs the spider approaches you are almost relieved that this horrible experience is over.\n\nRIP\n",
    "option1Name": "Try again",
    "option1Key": "end",
    "key": "runfromtheflaminspider79exhausted"
  },
  {
    "text": "This text won't display\n",
    "option1Name": "rftfs79nePrepared",
    "option1Key": "rftfs79nePrepared",
    "option2Name": "rftfs79neNotPrepared",
    "option2Key": "rftfs79neNotPrepared",
    "key": "runfromtheflaminspider79notexhausted",
    "attribute": "Well-Prepared",
    "action": "checkAttribute"
  },
  {
    "text": "You make it to the far end of the cavern where a tunnel leads futher down. You are relieved that the tunnel is too narrow for the spider to fit in. However, in your mad dash to escape you dropped the supplies that you got from the Inn Keeper.\n\nA look back into the cavern makes you realize that it's not worth it.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "rftfs79nePrepared",
    "action": "removeAttribute",
    "attribute": "Well-Prepared"
  },
  {
    "text": "You make it to the far end of the cavern where a tunnel leads futher down. You are relieved that the tunnel is too narrow for the spider to fit in. However, in your mad dash to escape your boots got stuck to some spider webbing and you had to pull your feet free and get away barefoot.\n\nA look back into the cavern makes you realize that it's not worth it.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "rftfs79neNotPrepared",
    "action": "addAttribute",
    "attribute": "lostBoots"
  },
  {
    "text": "Since you seem to be in relative safety, would you like to rest for a short bit before continuing on?\n\n(A short rest will recover some Hit Points and help with any exhaustion.)\n",
    "option1Name": "Yes, that would be lovely!",
    "option1Key": "resttunnel",
    "option2Name": "Nope, I'm good",
    "option2Key": "skipresttunnel",
    "key": "tunnel2"
  },
  {
    "text": "Your sword deflects off the creatures Carapace. It's apparently too stout to really do much with a sword. It's time to escape.\n\nAs you turn to run, you feel searing pain in your leg. You look down and see that the spider bit you. \n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "biwfhsFighter6-2",
    "key": "biwfhsFighter6-",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "Your sword deflects off the creatures Carapace. It's apparently too stout to really do much with a sword. It's time to escape.\n\nThe spider attacks, but you are able to dodge it's attack as you turn to run.\n",
    "option1Name": "Continue",
    "option1Key": "biwfhsFighter792",
    "key": "biwfhsFighter79"
  },
  {
    "text": "You lunge forward and thrust your sword right into one of the spider's eyes. It collapses to the ground.\n\nThe smell is pretty aweful, but at least you made it through the encounter unscathed.\n\n\nAs long as you are mindful of the many spiderwebs in the cavern, you are free to expore.\n",
    "option1Name": "Continue",
    "option1Key": "explorespidercavern",
    "key": "biwfhsFighter10+"
  },
  {
    "text": "So, you're running from a giant spider that you can't hurt with your sword. \n\nGood times.\n\nLet's roll Dexterity to see how that works out for you.\n",
    "option1Name": "Roll!",
    "option1Key": "runfromthegiantspider6-",
    "option2Name": "runfromtheflaminspider79",
    "option2Key": "runfromtheflaminspider79",
    "option3Name": "runfromthegiantspider10+",
    "option3Key": "runfromthegiantspider10+",
    "key": "biwfhsFighter6-2",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "You find yourself in a sticky situation... quite literally.\n\nYou tripped while running, and landed in one of the spider webs. These webs are meant for capturing something bigger than other bugs... a lot bigger. You are quite stuck.\n",
    "option1Name": "Continue",
    "option1Key": "stuckinwebcheckexhausted",
    "key": "runfromthegiantspider6-"
  },
  {
    "text": "You make it to the far end of the cavern where a tunnel leads futher down. Luckily, the tunnel is too narrow for the spider to fit in. \n\nRelieved that the ordeal is over, you lean against the wall and catch your breath.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "runfromthegiantspider10+"
  },
  {
    "text": "So, you're running from a giant spider that you can't hurt with your sword. \n\nGood times.\n\nLet's roll Dexterity to see how that works out for you.\n",
    "option1Name": "Roll!",
    "option1Key": "runfromthegiantspider6-",
    "option2Name": "runfromtheflaminspider79",
    "option2Key": "runfromtheflaminspider79",
    "option3Name": "runfromthegiantspider10+",
    "option3Key": "runfromthegiantspider10+",
    "key": "biwfhsFighter792",
    "moveTriggered": true,
    "mvoeSTat": "Dexterity"
  },
  {
    "text": "When you pick up the coin, you feel a sense of power emanating from it.\n\nYou decide to put the coin in your pocket for safe keeping. It's probably best to not let it out of your possession. It's probably going to spell your doom eventually.\n\nYou spend the rest of the evening sipping on your bevarage trying to lay low.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "pocketthecoin",
    "action": "addAttribute",
    "attribute": "Cursed-Coin"
  },
  {
    "text": "Really? You're going to give the barkeep this coin that came from some unknown otherworldly entity of immense power?\n\nYeah, best not hang on to that. When you pick the coin up, it feels fairly unremarkable. The barkeep accepts it as he would any other coin. You hope that you didn't just doom him with it.",
    "option1Name": "Continue",
    "option1Key": "paywithcoin2",
    "key": "paywithcoin"
  },
  {
    "text": "You spend the rest of the evening sitting in the corner with your bevarage of choice.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "paywithcoin2"
  },
  {
    "text": "This won't display\n",
    "option1Name": "stuckinwebexhausted",
    "option1Key": "stuckinwebexhausted",
    "option2Name": "stuckinwebnotexhausted",
    "option2Key": "stuckinwebnotexhausted",
    "key": "stuckinwebcheckexhausted",
    "action": "checkAttribute",
    "attribute": "exhausted"
  },
  {
    "text": "You try to pull yourself free, but you are simply too exhausted from your ordeals so far and you are unable to do it.\n\nAs the spider approaches, you think back to the woman in the bar, and you wish that you had turned her down.\n\nWould you like to play again?",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "stuckinwebexhausted"
  },
  {
    "text": "As you struggle, you feel a slight give in the web. If you pull just right, you might be able to break free.\n\nMaybe...\n\nRoll your strength.\n",
    "option1Name": "Roll",
    "option1Key": "siwne6-",
    "option2Name": "siwne79",
    "option2Key": "siwne79",
    "option3Name": "siwne10+",
    "option3Key": "siwne10+",
    "key": "stuckinwebnotexhausted",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "You try to pull yourself free, but you are unable to get loose.\n\nAs the spider approaches to devour you, you think back to the woman in the bar, and you wish that you had turned her down.\n\nWould you like to play again?",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "siwne6-"
  },
  {
    "text": "You're able to break free from the webs, but you don't get out as quickly as you would like. Just as you're getting out, you feel a searing pain in your leg. You look and see that the spider has bitten you.\n\nYou lose @X HP.\n",
    "option1Name": "Continue",
    "option1Key": "swine792",
    "key": "siwne79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You break out of the webs and swiftly run to the far end of the cavern where a tunnel leads futher down. This tunnel is too narrow for the spider to fit in. \n\nRelieved that the ordeal is over, you lean against the wall and catch your breath.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "siwne10+"
  },
  {
    "text": "You are able to run to the far end of the cavern where a tunnel leads futher down, which is too narrow for the spider to fit in. \n\nRelieved that the ordeal is over, you lean against the wall and catch your breath.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "swine792"
  },
  {
    "text": "You find buried in some spider webs, a dagger that appears to be enchanted.\n\nYou tuck it into your belt, and move to a tunnel that leads deeper into the caverns.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "explorespidercavern2",
    "action": "addAttribute",
    "attribute": "Enchanted-Dagger"
  },
  {
    "text": "This text won't display\n",
    "option1Name": "cavetrollssleeping",
    "option1Key": "cavetrollssleeping",
    "option2Name": "cavetrollsawake",
    "option2Key": "cavetrollsawake",
    "key": "cavetrolls2",
    "action": "checkDoom",
    "amount": "1"
  },
  {
    "text": "As you approach, you realize that the figures are a pair of cave trolls, one male and one female. They appear to be a couple. Luckily for you, they are sleeping. The snoring coming from them is immense. \n\nWhat do you do?",
    "option1Name": "Sneak Past",
    "option1Key": "leavesleepingtrollslie",
    "option2Name": "Steal from Them",
    "option2Key": "stealcavetrolls",
    "key": "cavetrollssleeping"
  },
  {
    "text": "As you approach, you realize that the figures are a pair of cave trolls, one male and one female. They are about twice the size as you and they are covered in rocky protusions. They appear to be a couple. They are eating dinner when you arrive. What do you do?\n",
    "option1Name": "Approach them and try to communicate",
    "option1Key": "talktotrolls",
    "option2Name": "Attack!",
    "option2Key": "attackTrollsDay",
    "key": "cavetrollsawake"
  },
  {
    "text": "Okay, you're going to very carefully sneak through the cave and see what's on the far side.\n\nThat is going to require a dexterity roll.\n",
    "option1Name": "Roll!",
    "option1Key": "sneaktrolls6-",
    "option2Name": "sneaktrolls79",
    "option2Key": "sneaktrolls79",
    "option3Name": "sneaktrolls10+",
    "option3Key": "sneaktrolls10+",
    "key": "leavesleepingtrollslie",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "That is a very bold decision. You sneak up to the trolls. You get a really good look at them as you approach. They are roughly twice as tall as you are, and are covered in rocky protusions. \n\nYou're going to need to roll Dexterity to sneakily look through their belongings without waking them up.\n",
    "option1Name": "Roll",
    "option1Key": "stealcavetrolls6-",
    "option2Name": "stealcavetrolls79",
    "option2Key": "stealcavetrolls79",
    "option3Name": "stealcavetrolls10+",
    "option3Key": "stealcavetrolls10+",
    "key": "stealcavetrolls",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "Well, that was a good attempt anyway.\n\nBut not good enough. You are about 10 feet from the male cave troll when you step on a piece of wood that breaks and  makes a really loud sound. \n\nYou find yourself standing there with no where to run when the cave trolls wake up.\n",
    "option1Name": "Continue",
    "option1Key": "sneaktrolls6-2",
    "key": "sneaktrolls6-"
  },
  {
    "text": "As you're sneaking across the cave, you accidentally kick a rock that bounces off of a metal shield near the cave trolls making a loud GONG sound.\n\nYou quickly duck behind some rubble when you see the trolls begin to rouse.\n",
    "option1Name": "Continue",
    "option1Key": "hidingfromtrolls",
    "key": "sneaktrolls79"
  },
  {
    "text": "You successfully sneak past the cave trolls. You get a really good look at them as you walk past. They are roughly twice as tall as you are, and are covered in rocky protusions. \n\nYou are really glad that you don't have to worry about getting into a fight with them.\n",
    "option1Name": "Continue",
    "option1Key": "snuckpasttrolls",
    "key": "sneaktrolls10+"
  },
  {
    "text": "You get a really good look at the cave trolls as they stand up. They are roughly twice as tall as you are, and are covered in rocky protusions. They also seem to be pretty grumpy from being awakened by you.\n\n\"What you?\" The female one asks in broken common.\n\nHow do you respond?",
    "option1Name": "\"The Tooth Fairy\"",
    "option1Key": "toothfairy",
    "option2Name": "Just passing through",
    "option2Key": "passingthrough",
    "option3Name": "With Violence",
    "option3Key": "IattackTrolls",
    "key": "sneaktrolls6-2"
  },
  {
    "text": "You get a really good look at the cave trolls as they stand up. They are roughly twice as tall as you are, and are covered in rocky protusions. They also seem to be pretty grumpy from being awakened by you.\n\nThey pick up their clubs, and look around. What do you do?\n",
    "option1Name": "Stay hidden until they give up",
    "option1Key": "morehiding",
    "option2Name": "Reveal myself and try to explain",
    "option2Key": "passingthrough",
    "option3Name": "Attack Them",
    "option3Key": "hiddenattacktrolls",
    "key": "hidingfromtrolls"
  },
  {
    "text": "Once you are past the trolls, you see a smaller opening on the far side of the cavern that appears to go deeper into the mine.\n\nOnce you get inside, you relax a bit and lean against the wall. You didn't realize how much tension you were carrying in your shoulders as you went past the cave trolls.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "snuckpasttrolls"
  },
  {
    "text": "That was pretty stupid. You walked up to the male sleeping troll, started rifling through his belongings, and accidentally stepped on his hand. He woke up with a yelp.\n\nBefore you get a chance to jump away, you feel a huge hand clamp down on your leg. Next thing you know, you are hanging upside down in a troll's hand.\n",
    "option1Name": "Continue",
    "option1Key": "stealcavetrollscaught",
    "key": "stealcavetrolls6-"
  },
  {
    "text": "You dig through a sack of belongings that is near the male troll. You find in there what appears to be an enchanted dagger. You are just tucking it away as you feel a troll's hand clamp on your leg.\n\nNext thing you know, you are hanging upside down in a troll's hand.\n",
    "option1Name": "Continue",
    "option1Key": "stealcavetrollscaught",
    "key": "stealcavetrolls79",
    "action": "addAttribute",
    "attribute": "Enchanted-Dagger"
  },
  {
    "text": "You are a very sneaky individual. Like a ninja.\n\nYou dig through a sack of belongings that is near the male troll. You find in there what appears to be an enchanted dagger. You tuck it away, and very carefully, make your way across the cavern. \n",
    "option1Name": "Continue",
    "option1Key": "snuckpasttrolls",
    "key": "stealcavetrolls10+",
    "attribute": "Enchanted-Dagger",
    "action": "addAttribute"
  },
  {
    "text": "That is a pretty bold statement. Unfortunately, cave trolls don't have the sort of imaginative things that they tell their children about losing teeth. So, it doesn't really matter if they believe you or not. They respond by lifting their clubs and getting ready to smash you.\n",
    "option1Name": "Oh... ",
    "option1Key": "attackTrolls",
    "key": "toothfairy"
  },
  {
    "text": "\nTelling them the truth does seem like it might be a reasonable thing to do. Let's roll your Charisma to see how that works out for you.\n",
    "option1Name": "Roll",
    "option1Key": "truthtotrolls6-",
    "option2Name": "truthtotrolls79",
    "option2Key": "truthtotrolls79",
    "option3Name": "truthtotrolls10+",
    "option3Key": "truthtotrolls10+",
    "key": "passingthrough",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "Double-click this passage to edit it.\n",
    "option1Name": "attackTrollsWizard",
    "option1Key": "attackTrollsWizard",
    "option2Name": "attackTrollsFighter",
    "option2Key": "attackTrollsFighter",
    "key": "attackTrolls",
    "action": "checkClass"
  },
  {
    "text": "You tried explaining to the trolls that you needed to get through because you're looking for some kid named Jimmy who you think passed through here recently.\n\nAll that they really heard was \"I'm a silly human and I want you to squish me.\" \n\nThe trolls pick up their clubs to use for squishing you.\n\nYou have no choice but to defend yourself.",
    "option1Name": "Continue",
    "option1Key": "attackTrolls",
    "key": "truthtotrolls6-"
  },
  {
    "text": "The trolls seem to believe your story about searching for Jimmy, but they are still very upset that you woke them. In recompense, they demand that you clean their cavern for them.\n\nYou realize that since they are much bigger than you are, that you're best off doing what they ask.\n",
    "option1Name": "Continue",
    "option1Key": "cleantrollcave",
    "key": "truthtotrolls79"
  },
  {
    "text": "These are very reasonable trolls, and they recognize that it is perfectly reasonable for you to be looking for a missing kid, and that you really just needed to get by them and you were being very considering in not wanting to wake them up.\n\nThey wish you luck on your continued adventure, and let you pass through.\n",
    "option1Name": "Continue",
    "option1Key": "snuckpasttrolls",
    "key": "truthtotrolls10+"
  },
  {
    "text": "You stay hidden behind the rubble. The trolls spend several minutes looking around trying to figure out what made the noise that work them.\n\nOne of them picks up the sheild that made the sound and examines it for a minute before tossing it back down.\n\nIt takes quite a while before they fall back asleep and you feel comfortable finishing sneaking through the cave.\n",
    "option1Name": "Continue",
    "option1Key": "snuckpasttrolls",
    "key": "morehiding",
    "action": "doom"
  },
  {
    "text": "You wait until the right moment and jump out at the trolls to try to get a sneaky attack in.\n\nThe trolls, turn and look as you jump out, and they start to charge at you.\n",
    "option1Name": "Continue",
    "option1Key": "attackTrolls",
    "key": "hiddenattacktrolls"
  },
  {
    "text": "It takes you a solid couple of hours to clean the cavern to the troll's satisfaction. The male watched you very closely and several times told you to do something over. Once you are done, they let you go on your way. \n\nYou make a mental note not to come back this way.\n",
    "option1Name": "Continue",
    "option1Key": "donecleaning",
    "key": "cleantrollcave",
    "action": "doom"
  },
  {
    "text": "Once you are away from the trolls, you enter a smaller opening on the far side of the cavern that appears to go deeper into the mine.\n\nOnce you get inside, you relax a bit and lean against the wall. You didn't realize how much tension you were carrying in your shoulders dealing with the cave trolls.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "donecleaning"
  },
  {
    "text": "You're really planning on fighting a couple of giant cave trolls, rocky protusions and all?\n\nWell, that's what makes this a choose your own adventure isn't it.\n\nAs you get ready, the trolls pick up their clubs for squishing you.\n",
    "option1Name": "Continue",
    "option1Key": "attackTrolls",
    "key": "IattackTrolls"
  },
  {
    "text": "You prepare an Ice Lance spell to send spears of ice at the cave trolls. This is totally going to be super effective.\n\nLet's roll Intelligence to cast the spell.\n",
    "option1Name": "Roll",
    "option1Key": "cavetrollsicelance6-",
    "option2Name": "cavetrollsicelance79",
    "option2Key": "cavetrollsicelance79",
    "option3Name": "cavetrollsicelance10+",
    "option3Key": "cavetrollsicelance10+",
    "key": "attackTrollsWizard",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You pull out your sword and get ready to fight. Your knuckles turn white as you tighten your grip. You slide into your best fighting stance.\n\nThe trolls charge at you.\n\nRoll Strength to see what happens.\n",
    "option1Name": "Roll",
    "option1Key": "attackTrollsFighter6-",
    "option2Name": "attackTrollsFighter79",
    "option2Key": "attackTrollsFighter79",
    "option3Name": "attackTrollsFighter10+",
    "option3Key": "attackTrollsFighter10+",
    "key": "attackTrollsFighter",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "Before you are able to get the spell cast, the female troll steps up to you and plays a round of tee-ball with your head.\n\nIt does not feel very good at all. You lose @X HP.\n",
    "option1Name": "Continue",
    "option1Key": "smashedbytroll",
    "key": "cavetrollsicelance6-",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "You totally cast the spell. Shard of ice shoot out from your hand towards the cave trolls. You misjudged the ability of ice to hurt creatures made of living rock.\n\nYou do manage to get enough on the ground around them that they slip and fall down. This gives you enough of a chance to just make a run for it.\n",
    "option1Name": "Run!",
    "option1Key": "ranpasttrolls",
    "key": "cavetrollsicelance79"
  },
  {
    "text": "You hold your hand out and millions of shards of ice fly at the trolls who hold their arms in front of their faces to protect themselves. \n\nWithin moments the trolls are both encased in ice. Large icecycles jut away from the trolls in the opposite direction of you. You're pretty sure that eventually they'll be able to break out, but for the time being you are safe.\n",
    "option1Name": "Continue",
    "option1Key": "frozentrolls",
    "key": "cavetrollsicelance10+"
  },
  {
    "text": "You wake up a bit later, fortunately still alive. Although, you have a pounding headache. The trolls don't seem to be around at the moment, but your best bet is to just get out of here before they come back.\n\nYou find a smaller opening on the far side of the cavern that appears to go deeper into the mine.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "smashedbytroll"
  },
  {
    "text": "Once you are away from the trolls, you enter a smaller opening on the far side of the cavern that appears to go deeper into the mine.\n\nOnce you get inside, you relax a bit and lean against the wall. You didn't realize how much tension you were carrying in your shoulders dealing with the cave trolls.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "ranpasttrolls"
  },
  {
    "text": "You have some time, you could probably spare a few minutes to explore the cavern in more depth if you wish.\n",
    "option1Name": "Yes, let's explore",
    "option1Key": "exploretrollcave",
    "option2Name": "Nah, I'm good",
    "option2Key": "ranpasttrolls",
    "key": "frozentrolls"
  },
  {
    "text": "It appears that the history of this cavern is rich indeed. The evidence that you noticed before of the mining is very apparent. When you search around a bit more,  it looks like there had been another occupant of the cavern before the trolls arrived. There isn't a lot to go on, but someone had set up a camp here briefly. It's likely that they were driven out, possibly by the trolls, or by something worse.\n",
    "option1Name": "Continue",
    "option1Key": "exploretrollcavern2",
    "key": "exploretrollcave"
  },
  {
    "text": "You find buried in some spider webs, a dagger that appears to be enchanted.\n\nYou tuck it into your belt, and move to a tunnel that leads deeper into the caverns.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "exploretrollcavern2",
    "action": "addAttribute",
    "attribute": "Enchanted-Dagger"
  },
  {
    "text": "Your timing is terrible. You swing at the first troll way too early. She easily walks up to you, and you see a large club. It's quickly getting bigger at it rapidly approaches your face. \n\nBefore the lights go out, you think \"This is going to hurt\".\n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "smashedbytroll",
    "key": "attackTrollsFighter6-",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "It takes every ounce of swordplay training you have to fend off the onslaught of blows from the trolls.\n",
    "option1Name": "Continue",
    "option1Key": "attackTrollsFighter792",
    "key": "attackTrollsFighter79"
  },
  {
    "text": "You sweep the leg out from under the first troll as he approaches, knocking him down. You spin around to the second troll and deftly disarm him with some fancy swordplay. You put the tip of your sword against that troll's neck and place your foot on the chest of the other one.\n\nYou look a little bit ridiculous as these trolls are both twice your size.\n",
    "option1Name": "Continue",
    "option1Key": "swordbeattrolls",
    "key": "attackTrollsFighter10+"
  },
  {
    "text": "Double-click this passage to edit it.\n",
    "option1Name": "atf792exhausted",
    "option1Key": "atf792exhausted",
    "option2Name": "atf792notexhausted",
    "option2Key": "atf792notexhausted",
    "key": "attackTrollsFighter792",
    "action": "checkAttribute",
    "attribute": "exhausted"
  },
  {
    "text": "The attacks from the trolls are relentless. You quickly wear down from the exhaustion from your previous ordeal.\n\nEventually one of them knocks the sword from your hand, and the other quickly follows up with a blow to your noggin.\n\nIt hurts. You lose @X Hit Points, and everything goes dark.\n",
    "option1Name": "Continue",
    "option1Key": "smashedbytroll",
    "key": "atf792exhausted",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "The attacks from the trolls are relentless. You slowly work yourself to the far end of the cave while blocking their attacks. Just as you reach a smaller tunnel leading away from this cave, the female kicks you in the checks and you toppel over backwards into the tunnel.\n\n\"No come back!\" She says. Then the couple turn and walk away.\n",
    "option1Name": "Continue",
    "option1Key": "atfout",
    "key": "atf792notexhausted"
  },
  {
    "text": "You find yourself in a smaller tunnel that leads deeper into the mine. Feeling safe for the moment, you lean against the wall to catch your breath.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2",
    "key": "atfout"
  },
  {
    "text": "The trolls are intimidated by your quick movements, and your fancy swordplay. They ask for mercy, what do you do?\n",
    "option1Name": "I'm no Murder Hobo",
    "option1Key": "mercytotrolls",
    "option2Name": "Mercy is for the weak",
    "option2Key": "swordbeattrollskill",
    "key": "swordbeattrolls"
  },
  {
    "text": "You make the trolls give you their word that they'll let you pass through, and they won't hurt any other innocent spelunkers passing through.\n\nThey also tell you that a kid matching Jimmy's description went through here not long ago. \n\nYou thank them, and head on your way.",
    "option1Name": "Continue",
    "option1Key": "ranpasttrolls",
    "key": "mercytotrolls"
  },
  {
    "text": "You put those fancy swordplay skilsl to use to finish off the trolls in the best manner of a murderhobo.\n\nYou wipe the blood from your blade. Do you explore the cave a bit, or head out to find Jimmy?\n",
    "option1Name": "Explore",
    "option1Key": "exploretrollcave",
    "option2Name": "Jimmy can't wait!",
    "option2Key": "ranpasttrolls",
    "key": "swordbeattrollskill"
  },
  {
    "text": "Before he squishes you, the cave troll asks in broken common \"What this?\"\n\nHow do you respond?\n",
    "option1Name": "I am the Tooth Fairy",
    "option1Key": "caughttoothfairy",
    "option2Name": "Tell the truth",
    "option2Key": "caughttrolltruth",
    "key": "stealcavetrollscaught"
  },
  {
    "text": "That is a pretty bold statement. Unfortunately, cave trolls don't have the sort of imaginative things that they tell their children about losing teeth. So, it doesn't really matter if he believes you or not.\n\nHe responds by smashing you to the ground. There is a lot of pain, and then everything goes black. You lose @X hit points.\n",
    "option1Name": "Continue",
    "option1Key": "smashedbytroll",
    "key": "caughttoothfairy",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "Telling them the truth does seem like it might be a reasonable thing to do. Well, maybe not the whole truth. You leave out the part about trying to steal from them and just say you were trying to sneak by.\n\nLet's roll your Charisma to see how that works out for you.\n",
    "option1Name": "Roll",
    "option1Key": "caughttruthtotrolls6-",
    "option2Name": "caughttruthtotrolls79",
    "option2Key": "caughttruthtotrolls79",
    "option3Name": "caughttruthtotrolls10+",
    "option3Key": "caughttruthtotrolls10+",
    "key": "caughttrolltruth",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "You tried explaining to the trolls that you needed to get through because you're looking for some kid named Jimmy who you think passed through here recently.\n\nAll that they really heard was \"I'm a silly human and I want you to squish me.\" \n\nThe troll holding you responds by smashing you to the ground. There is a lot of pain, and then everything goes black. You lose @X hit points.\n",
    "option1Name": "Continue",
    "option1Key": "smashedbytroll",
    "key": "caughttruthtotrolls6-",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "The trolls seem to believe your story about searching for Jimmy, but they are still very upset that you tried stealing from them. In recompense, they demand that you clean their cavern.\n\nYou realize that since they are much bigger than you are, and you are hanging upside down, that you're best off doing what they ask.\n",
    "option1Name": "Continue",
    "option1Key": "cleantrollcave",
    "key": "caughttruthtotrolls79"
  },
  {
    "text": "These are very reasonable trolls, and they recognize that it is perfectly reasonable for you to be looking for a missing kid, and that you really just needed to get by them and you were being very considering in not wanting to wake them up.\n\nThey wish you luck on your continued adventure, and let you pass through.\n",
    "option1Name": "Continue",
    "option1Key": "snuckpasttrolls",
    "key": "caughttruthtotrolls10+"
  },
  {
    "text": "That seems a sensible thing to do.\n\nWhat are you going to say to them?\n",
    "option1Name": "Have you seen Jimmy?",
    "option1Key": "asktrollsjimmy",
    "option2Name": "Do you want to see a magic trick?",
    "option2Key": "showtrollsmagic",
    "option3Name": "Distract them!",
    "option3Key": "tricktrollsoutside",
    "key": "talktotrolls"
  },
  {
    "text": "The trolls have delt with many a wondering adventurer before. They recognize the murderous intent in your eyes. They respond by grabbing their clubs with the thought of squishing you.\n",
    "option1Name": "Continue ",
    "option1Key": "attackTrolls",
    "key": "attackTrollsDay"
  },
  {
    "text": "Telling the truth to the trolls seems like it's probably a good idea.\n\nLet's roll Charisma and see how that goes for you.\n",
    "option1Name": "Roll!",
    "option1Key": "truthtotrolls6-",
    "option2Name": "asktrollsjimmy79",
    "option2Key": "asktrollsjimmy79",
    "option3Name": "asktrollsjimmy10+",
    "option3Key": "asktrollsjimmy10+",
    "key": "asktrollsjimmy",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "Blah blah you won't see this\n",
    "option1Name": "showtrollsmagicwizard",
    "option1Key": "showtrollsmagicwizard",
    "option2Name": "showtrollsmagicfighter",
    "option2Key": "showtrollsmagicfighter",
    "key": "showtrollsmagic",
    "action": "checkClass"
  },
  {
    "text": "You point behind you and say, \"Did you see that thing that's outside? It's the most amazing thing that you'll ever see!\"\n\nRoll Charisma to see if that worked.\n",
    "option1Name": "Roll!",
    "option1Key": "tricktrolls6-",
    "option2Name": "tricktrolls79",
    "option2Key": "tricktrolls79",
    "option3Name": "tricktrolls10+",
    "option3Key": "tricktrolls10+",
    "key": "tricktrollsoutside",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "The trolls seem to believe your story about searching for Jimmy, but they are  very upset that you are waltzing through their home uninvited and you are interrupting their dinner. In recompense, they demand that you clean their cavern for them.\n\nYou realize that since they are much bigger than you are, that you're best off doing what they ask.\n",
    "option1Name": "Continue",
    "option1Key": "cleantrollcave",
    "key": "asktrollsjimmy79"
  },
  {
    "text": "You ask the trolls if they would like to see a magic trick, and they think that would be delightful.\n\nOf course, being a wizard, you can use real magic to make the trick that much more entertaining.\n\nRoll Intelligence to see how well you do.\n",
    "option1Name": "Roll!",
    "option1Key": "showtrollsmagic6-",
    "option2Name": "showtrollsmagic79",
    "option2Key": "showtrollsmagic79",
    "option3Name": "showtrollsmagic10+",
    "option3Key": "showtrollsmagic10+",
    "key": "showtrollsmagicwizard",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You ask the trolls if they would like to see a magic trick, and they think that would be delightful.\n\nOf course, being a fighter, you don't know a lick of real magic. But a little bit of slight of hand may keep them entertained enough to not smash you.\n\nRoll Intelligence to see how well you do.\n",
    "option1Name": "Roll!",
    "option1Key": "showtrollsmagic6-",
    "option2Name": "showtrollsmagic79",
    "option2Key": "showtrollsmagic79",
    "option3Name": "showtrollsmagic10+",
    "option3Key": "showtrollsmagic10+",
    "key": "showtrollsmagicfighter",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You announce that you will pull a rabbit out of a hat. However, you aren't wearing a hat. The trolls insist that you must do that trick, no other will suffice.\n\nYou try to explain to them, that you'll need to do something else, but they won't take no for an answer. They pick up their clubs and step forward to smash you.\n",
    "option1Name": "attackTrolls",
    "option1Key": "attackTrolls",
    "key": "showtrollsmagic6-"
  },
  {
    "text": "You pull out a deck of cards, and you have the male troll pick a card out of the deck. You then use some slight of hand to shuffle the deck and then reveal the same card that they pulled had picked earlier.\n\nHowever, the troll can't really tell the difference between the cards and they aren't very impressed.\n\nMaybe you should just try telling them the truth. Let's roll Charisma and see how that goes.\n",
    "option1Name": "Roll!",
    "option1Key": "truthtotrolls6-",
    "option2Name": "asktrollsjimmy79",
    "option2Key": "asktrollsjimmy79",
    "option3Name": "asktrollsjimmy10+",
    "option3Key": "asktrollsjimmy10+",
    "key": "showtrollsmagic79",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "You pull a hankerchief from your pocket.\n\nYou show it to the trolls, both front and back. You then hum a little tune while you stuff the hankercheif into your closed fist. You then have the female troll blow on your hand, and you reveal a hankerchief that is now a different color.\n\nThe trolls' minds are blown.\n",
    "option1Name": "Continue",
    "option1Key": "trollmindsblown",
    "key": "showtrollsmagic10+"
  },
  {
    "text": "After an applause that lasts long enough that it starts to be awkward, you tell the trolls that you must really be on your way. They are impressed with you, and wish you no harm. \n\nThey wish you luck on your continued adventure, and let you pass through.\n",
    "option1Name": "Continue",
    "option1Key": "snuckpasttrolls",
    "key": "trollmindsblown"
  },
  {
    "text": "These are very reasonable trolls, and they recognize that it is perfectly reasonable for you to be looking for a missing kid, and that you really just needed to get by them and you are very sorry for interrupting their dinner.\n\nThey wish you luck on your continued adventure, and let you pass through.\n",
    "option1Name": "Continue",
    "option1Key": "snuckpasttrolls",
    "key": "asktrollsjimmy10+"
  },
  {
    "text": "You get a deadpan stare from both trolls. You're not sure if they don't speak common, or they just aren't impressed with your distraction.\n\nThey pick up their clubs with the intent of squishing you.\n",
    "option1Name": "Continue",
    "option1Key": "attackTrolls",
    "key": "tricktrolls6-"
  },
  {
    "text": "The male troll laughs. \"Ha Ha, silly human, we no go outside.\"\n\nIt seems that your distraction was a miserable failure.\n\nMaybe you should just try telling them the truth. Let's roll Charisma and see how that goes.\n",
    "option1Name": "Roll!",
    "option1Key": "truthtotrolls6-",
    "option2Name": "asktrollsjimmy79",
    "option2Key": "asktrollsjimmy79",
    "option3Name": "asktrollsjimmy10+",
    "option3Key": "asktrollsjimmy10+",
    "key": "tricktrolls79",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "You can barely get out of the way fast enough when the trolls rush past you to go back the way you came. You're not sure how much time you bought, but it's probably a good bet for you to get out of this cavern quickly before they return.\n\nDo you want to explore a bit first, or press on?\n",
    "option1Name": "Explore",
    "option1Key": "exploretrollcave",
    "option2Name": "Let's just go!",
    "option2Key": "ranpasttrolls",
    "key": "tricktrolls10+"
  },
  {
    "text": "You sit down and lean against the wall of the tunnel. After a couple moments, your eyelids get heavy and you drift off to sleep.\n",
    "option1Name": "Continue",
    "option1Key": "dreamtunnel",
    "key": "resttunnel",
    "action": "shortrest"
  },
  {
    "text": "While a rest seems like it might be a good idea, Jimmy can't wait. You've already wasted enough time getting here, and who knows how much further you have to go to find him.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2cont",
    "key": "skipresttunnel"
  },
  {
    "text": "You won't see this text. At least I hope not.\n",
    "option1Name": "dream1",
    "option1Key": "dream1",
    "option2Name": "dream2",
    "option2Key": "dream2",
    "option3Name": "dream3",
    "option3Key": "dream3",
    "key": "dreamtunnel",
    "action": "randomroom"
  },
  {
    "text": "You dream of the town being on fire. There are hoardes of zombies everywhere, and you see a dark figure that seems to be directing them. You wake with a start, and find sweat on your brow.\n\nYou decide that getting a move on is a good idea.\n",
    "option1Name": "Yeah... let's go on",
    "option1Key": "tunnel2cont",
    "key": "dream1",
    "action": "doom",
    "amount": "3"
  },
  {
    "text": "When you wake up, you have the distinct impression that you had a really vivid dream. You can't really remember much about it. The only things left are the lingering sensations the smell of burned coffee and the image of the waitress from the bar.\n\nYou rub the sleep from your eyes as you stand up and get ready to go on your way.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2cont",
    "key": "dream2"
  },
  {
    "text": "You have a really strange dream. You aren't sure of what you make of it, but you get the feeling that all of your actions are being controlled by someone tapping a magical piece of glass.\n\nIt's disorientating, and makes you question reality a bit.\n\nIt's something best put out of mind so that you can continue on your way.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel2cont",
    "key": "dream3",
    "action": "doom"
  },
  {
    "text": "With the torch that you somehow managed to still have in your hand, you continue down the tunnel. This tunnel seems more of a natural formation than the one you initially entered.\n\nAfter about 100 feet, the tunnel forks. You pause and look at each tunnel. From here, you can't really tell which way Jimmy might have gone. You're going to just have to pick one and hope for the best. Which way would you like to go?\n",
    "option1Name": "Left",
    "option1Key": "lefttunnel",
    "option2Name": "Right",
    "option2Key": "righttunnel",
    "key": "tunnel2cont",
    "action": "clear"
  },
  {
    "text": "After playing eenie meenie miney moe, you pick the left tunnel. It seems like just as good a choice as any. You have a strong sensation that this is indeed the right way, and you will stick with this choice no matter what.\n",
    "option1Name": "Continue",
    "option1Key": "gc01",
    "key": "lefttunnel"
  },
  {
    "text": "You flip a coin and decide that the right tunnel is the way to go. After you walk a ways down the tunnel, you feel a rumbling and hear a loud crash coming from what is probably the other tunnel. You decide that you are glad that your coin chose this tunnel, and you give silent thanks to lady luck.\n",
    "option1Name": "Continue",
    "option1Key": "at01",
    "key": "righttunnel"
  },
  {
    "text": "You walk for an inderterminate amount of time in which nothing interesting happens. Then you just sort of notice that this tunnel is really clean. There's no dirt on the ground, just bare rock. \n\nYou rub a finger on the wall, and it comes away clean.\n\nYou're pretty sure it wasn't this clean back at the fork.\n",
    "option1Name": "Well, that's weird.",
    "option1Key": "gc02",
    "key": "gc01"
  },
  {
    "text": "You come around a corner, and you see some bones, the head of a battle axe, and a gleaming gem just sort of hanging in the air in front of you.\n\nRoll Wisdom.",
    "option1Name": "Roll!",
    "option1Key": "gcImStupid",
    "option2Name": "gcNotStupid",
    "option2Key": "gcNotStupid",
    "option3Name": "gcNotStupid",
    "option3Key": "gcNotStupid",
    "key": "gc02",
    "moveTriggered": true,
    "moveStat": "Wisdom"
  },
  {
    "text": "After you walk a bit you come to a doorway. The actual door is gone, but the frame is there. It appears to be ancient. The tunnel you were walking in shifts into more of a hallway, but keeps going forward.\n",
    "option1Name": "Continue",
    "option1Key": "at02",
    "key": "at01"
  },
  {
    "text": "After walking in the hallway a bit, you stop because you notice slots in one of the walls ahead of you. You also notice that there are some different runes carved into the blocks of the floor going ahead.\n\nRoll Intelligence to see if you know what they mean.\n",
    "option1Name": "Roll!",
    "option1Key": "decodeBlocks6-",
    "option2Name": "decodeBlocks79",
    "option2Key": "decodeBlocks79",
    "option3Name": "decodeBlocks10+",
    "option3Key": "decodeBlocks10+",
    "key": "at02",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You don't see any possible reason to be concerned. Those slots in the wall are probably just from moles. The runes on the ground are probably just some sort of decoration.\n\nYou saunter on down the hall paying no heed to what you are stepping on.\n",
    "option1Name": "Continue",
    "option1Key": "debl602",
    "key": "decodeBlocks6-"
  },
  {
    "text": "It's pretty clear that you will set off a. trap if you step on one of the runes, or perhaps many of the runes. Either way, it seems like stepping on runes is a bad idea.\n\nSince you don't know what runes are safe, you decide that trying to jump over them is the best bet.\n",
    "option1Name": "Continue",
    "option1Key": "debl7902",
    "key": "decodeBlocks79"
  },
  {
    "text": "Well, it really is obvious. An ancient buried structure in this part of the world would have been built by the worshippers of the ancient god Yhtia.\n\nYou start to step on the block that for the letter Y, but just before you put weight on it you have a sudden realization.\n",
    "option1Name": "Continue",
    "option1Key": "debl101",
    "key": "decodeBlocks10+"
  },
  {
    "text": "You carefully step on the blocks with the Yhtese runes that translate to:\nµ\nH\nT\nI\nA",
    "option1Name": "Continue",
    "option1Key": "debl103",
    "key": "debl102"
  },
  {
    "text": "You find yourself safely on the other side of the trap. Just out of curiosity, you toss a random rock onto one of the blocks that was incorrect.\n\nDozens of arrows shoot out of the slots in the wall and embed themselves into the opposite wall.\n\nIt's a really good thing you studied Ancient Yhtese Culturebwhen working on your Bachelor's of Adventuring Degree.\n",
    "option1Name": "Continue",
    "option1Key": "at03",
    "key": "debl103"
  },
  {
    "text": "Now that you are passed the arrow trap, you continue down the hall being even more careful to watch for any additional traps.\n\nThe passage continues on for quite a ways taking several turns but not branching until you eventually come to a door.\n",
    "option1Name": "Continue",
    "option1Key": "BigRoom2",
    "key": "at03"
  },
  {
    "text": "In Ancient Yhtese, the rune that translates to Y is taboo, so typically they wrote out Yhtia with a µ instead of a Y. \n\nYou carefully take your foot off the Y without putting any weight on it.\n",
    "option1Name": "Of course!",
    "option1Key": "debl102",
    "key": "debl101"
  },
  {
    "text": "You back up a ways down the hallway to give yourself some running room. Then you take off at a dead sprint to attempt to jump over the blocks with runes.\n\nRoll Dexterity to see if you make it.",
    "option1Name": "Roll!",
    "option1Key": "jumpingBlocks6-",
    "option2Name": "jumpingBlocks79",
    "option2Key": "jumpingBlocks79",
    "option3Name": "jumpingBlocks10+",
    "option3Key": "jumpingBlocks10+",
    "key": "debl7902",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "Just as you are about to jump, you notice that your shoelace is untied. Unfortunately, you are pretty committed to the jump at this point. \n\nAs you jump, your shoelace is underneath the foot that you are pushing off with. This causes you to stumble, and fall on your face onto many of the rune blocks.\n\nThe fall itself didn't hurt, and a good many of the arrows went over your head. However, some of them are now sticking out of your side.\n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "jubl602",
    "key": "jumpingBlocks6-",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You give a great leap as you get to the edge of the blocks. Unfortunately, you don't leap quite as far as you need to. Your foot lands on one of the blocks in the final row. \n\nYou hear a loud sound as hundreds of arrows fly out of slots in the wall. Luckily, you are well past the majority of them. Only a couple get stuck in you. \n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "jubl7902",
    "key": "jumpingBlocks79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "With the grace of a gazelle, you leap clear of the runes and do a perfect plant on the far side. Your former track coach would be proud of the hitch-kick that you employed to get extra distance.\n",
    "option1Name": "Continue",
    "option1Key": "jubl101",
    "key": "jumpingBlocks10+"
  },
  {
    "text": "That hurts, but at least you're still alive. You're lucky that you didn't get hit by more arrows.\n\nConfident that you have now tripped all the blocks that would cause arrows to fire, you pull yourself off the rune blocks. You lean against the wall, and pull the arrows out.\n",
    "option1Name": "Continue",
    "option1Key": "at03",
    "key": "jubl602"
  },
  {
    "text": "You take another couple steps forward to get clear of the trap.\n\nThere are two small arrows sticking out of you. One in your side, and one in your posterior.\n\nThey hurt more getting pulled out, than they did going in.\n",
    "option1Name": "Continue",
    "option1Key": "at03",
    "key": "jubl7902"
  },
  {
    "text": "You find yourself safely on the other side of the trap. Just out of curiosity, you toss a random rock onto one of the blocks with a rune on it.\n\nDozens of arrows shoot out of the slots in the wall and embed themselves into the opposite wall.\n\nThat looks like it would have hurt.\n",
    "option1Name": "Continue",
    "option1Key": "at03",
    "key": "jubl101"
  },
  {
    "text": "You hear a really loud sound as hundreds of arrows shoot out of the holes. Many of them embed themselves into the wall opposite the holes. Many of them also embed themselves into you.\n\nYou lose @X Hit Points\n",
    "option1Name": "ARROWED!!!",
    "option1Key": "debl603",
    "key": "debl602",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "OW! My Skin!\n\nThere are a lot of arrows sticking out of you. You walk the rest of the way past the blocks with runes on them that clearly had more significance than you thought.\n\nYou begin the slow painful process of removing the arrows.\n",
    "option1Name": "Continue",
    "option1Key": "debl604",
    "key": "debl603"
  },
  {
    "text": "Once you have all of the arrows removed, you can continue down the hall. You wish that maybe you would have given those blocks a little more levity than you did.\n",
    "option1Name": "Continue",
    "option1Key": "at03",
    "key": "debl604"
  },
  {
    "text": "Randomly choose a room. This text will not display.\n\n",
    "option1Name": "cockatrice",
    "option1Key": "cockatrice",
    "option2Name": "rustmonster",
    "option2Key": "rustmonster",
    "key": "BigRoom2",
    "action": "randomroom"
  },
  {
    "text": "You reach out and try to grab the gem. You touch a transparent surface that feels a bit like Jello before you get to the gem. As soon as your hand touches the surface, you feel a sharp pain.\n\nRoll Constitution to see if you are paralyzed.\n",
    "option1Name": "Oh....",
    "option1Key": "gcIS6-",
    "option2Name": "gcIS79",
    "option2Key": "gcIS79",
    "option3Name": "gcIS10+",
    "option3Key": "gcIS10+",
    "key": "gcImStupid",
    "moveTriggered": true,
    "moveStat": "Constitution"
  },
  {
    "text": "A little bit of motion makes you aware that the gem is suspended in a Gelatinous Cube. \n\nFortunately, you are not stupid enough to try to reach inside of a Gelatinous Cube. Many an adventurer has been consumed by them from the stories that you've heard.\n\nNow you just need to figure out how to get past it.\n",
    "option1Name": "Continue",
    "option1Key": "gcHowToGetPast",
    "key": "gcNotStupid"
  },
  {
    "text": "Yes. You are now paralyzed.\n\nNow that you are stuck, you can tell that your hand is engulfed in a Gelatinous Cube. You feel yourself slowly get pulled into it. While, you cannot move, the pain is excruciating as you feel your skin start to dissolve from the acidic nature of the beast.\n\nThe next several hours are filled with pain. When it finally comes, you welcome the release of death.\n\nRIP\n",
    "option1Name": "Start Over?",
    "option1Key": "end",
    "key": "gcIS6-"
  },
  {
    "text": "Your hand is engulfed in a Gelatinous Cube. Admidst the pain, you feel a slight tugging sensation pulling you forward.\n\nYou pull your hand away from the beast. While touching it the first time didn't seem to do any lasting damage, you're pretty sure that you don't want to touch it again.\n\nNow to figure out a way past it.",
    "option1Name": "Coninue",
    "option1Key": "gcHowToGetPast",
    "key": "gcIS10+"
  },
  {
    "text": "Your hand is engulfed in a Gelatinous Cube. Admidst the pain, you feel a slight tugging sensation pulling you forward. You aren't immediately paralyzed, but you do lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "gcIS792",
    "key": "gcIS79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You pull your hand away from the beast. Now that you have learned the hard way not to touch it, you need to figure out a way to get past the Gelatinous Cube.\n",
    "option1Name": "Continue",
    "option1Key": "gcHowToGetPast",
    "key": "gcIS792"
  },
  {
    "text": "You look around to get some options. The passageway that you are in is approximately 10 feet wide and 10 feet tall. The Cube in front of you is also 10 feet wide and 10 feet tall. It's also highly acidic which is why the passageway is so clean.\n\nIt's also slowly working it's way towards you. You take a couple steps back.\n",
    "option1Name": "Continue",
    "option1Key": "gcHtgP2",
    "key": "gcHowToGetPast"
  },
  {
    "text": "Double-click this passage to edit it.\n",
    "option1Name": "gcHtgPWizard",
    "option1Key": "gcHtgPWizard",
    "option2Name": "gcHtgPFighter",
    "option2Key": "gcHtgPFighter",
    "key": "gcHtgP2",
    "action": "checkClass"
  },
  {
    "text": "As a Wizard, it seems that the best option is to use magic to get past this thing. You could use something pretty destructive to attempt to kill it, or you could shrink it and just step over it.\n\nWhich do you want to do?",
    "option1Name": "Kill it",
    "option1Key": "gcWizKill",
    "option2Name": "Shrink it",
    "option2Key": "gcWizShrink",
    "key": "gcHtgPWizard"
  },
  {
    "text": "As a fighter, it seems that the best option might just be fighting the Gelatinous Cube. Of course, you don't really want to risk touching it, so you'll want to do it from a distance.\n\nYou could either use a crossbow, or you could throw something at it. Either one sounds like a perfectly reasonable course of action.\n",
    "option1Name": "Crossbow",
    "option1Key": "gcCrossbow",
    "option2Name": "Throw Something",
    "option2Key": "gcSomething",
    "key": "gcHtgPFighter"
  },
  {
    "text": "Yes, this thing is clearly a manace to adventurers everywhere, and the best thing to do is just to end it.\n\nThis sounds like a good job for lightening.\n\nRoll Intelligence to cast.\n",
    "option1Name": "Roll!",
    "option1Key": "gcWizKill6-",
    "option2Name": "gcWizKill79",
    "option2Key": "gcWizKill79",
    "option3Name": "gcWizKill10+",
    "option3Key": "gcWizKill10+",
    "key": "gcWizKill",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Yes, shrinking it would be a more humane way to deal with the creature. The spell is only temporary and will allow you to pass without doing permanent harm.\n\nLet's roll Intelligence to give that a try.",
    "option1Name": "Roll",
    "option1Key": "gcWS6-",
    "option2Name": "gcWS79",
    "option2Key": "gcWS79",
    "option3Name": "gcWS10+",
    "option3Key": "gcWS10+",
    "key": "gcWizShrink",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Maybe lightening wasn't a good idea. The Gelatinous Cube is definitely dead, but it sort of exploded. You are now covered in acidic goo.\n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "gcWizKill6-2",
    "key": "gcWizKill6-",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "Lightening certianly appears to be an effective way to get rid of a Gelatinous Cube, although it's definitely messy. The thing sort of exploded causing acidic goo to go everywhere. Your quick thinking got you to pull your cloak up as a shield to protect your skin. Unfortunately, now it's ruined.\n\nYou remove the tattered remains of your cloak, and carefully move on.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcWizKill79"
  },
  {
    "text": "Lightening certianly appears to be an effective way to get rid of a Gelatinous Cube. The thing sort of melts into a puddle of acidic goo. The remnants of it's previous victims clatter to the ground. You think briefly about picking up that gem, but you decide that it's not worth dealing with the layers of acid on it.\n\nYou carefully step over the puddle and continue on your way.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcWizKill10+"
  },
  {
    "text": "You take off your cloak which is now covered in the goo, and use a water spell to wash as much of it off yourself as you can. \n\nYou're probably goinng to have some permanent scars from this. At least the tunnel is clear and you can go on.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcWizKill6-2"
  },
  {
    "text": "You continue down the tunnel. Before long you come to a transition where it goes from a natural tunnel to an ancient hallway. Instead of just rock for the walls, it becomes something that was crafted long ago.\n\nThe passage continues on for quite a ways taking several turns but not branching until you eventually come to a door.\n",
    "option1Name": "Continue",
    "option1Key": "BigRoom2",
    "key": "pastGC"
  },
  {
    "text": "It seems that you got something mixed up in the spell. Instead of shrinking the cube, you made it get bigger. A lot bigger... very quickly.\n\nIn fact, the spot where you are standing is about to be filled with Gelatinous Cube. \n\nRoll Dexterity to see if you can avoid becoming part of the cube.\n",
    "option1Name": "Roll!",
    "option1Key": "jumpfromcube6-",
    "option2Name": "jumpfromcube79",
    "option2Key": "jumpfromcube79",
    "option3Name": "jumpfromcube10+",
    "option3Key": "jumpfromcube10+",
    "key": "gcWS6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "The good news is that your spell worked. The Gelatinous Cube totally shrank. The bad news is that when you cast the spell the gem sitting inside the cube started to glow a bit. It must have been some sort of spell amplification gem.\n\nYou are shocked to watch the cube continue to shrink down to the point where you can no longer see it. Your best guess is that it has gone subatomic and entered the quantum realm. Time and Space no longer have any meaning for it. You have probably trapped it forever.\n",
    "option1Name": "Good Job",
    "option1Key": "pastGC",
    "key": "gcWS79"
  },
  {
    "text": "Your spell worked like a charm.  The cube shrinks down to about the size of a coconut.\n\nYou simply step over the cube, and continue down the path. You feel pretty good about yourself as you left a perfectly innocent creature unharmed. It'll be back to its normal size before long.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcWS10+"
  },
  {
    "text": "You were much too slow to jump back in time. You are now stuck inside the Giant Gelatinous Cube.\n\nThere is quite a bit of pain as you are slowly dissolved. Death takes a long time to come.\n\nWould you like to try again?",
    "option1Name": "Yes",
    "option1Key": "end",
    "key": "jumpfromcube6-"
  },
  {
    "text": "You jump back away from the expanding Gelatinous Cube. You don't get away quite as quickly as you would like, and you get some of it's acid on you.\n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "jfc792",
    "key": "jumpfromcube79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You successfully jump back.\n\nYou watch as the cube slowly gets bigger and bigger. You can see that it's having trouble with the fact that the tunnel which it already filled is not expanding with it.\n\nYou're not sure that you can really read the body language of a Gelatinous Cube, but you think it's probably in a lot of pain. Can they even feel pain?\n",
    "option1Name": "Continue",
    "option1Key": "expandingCubeDeath",
    "key": "jumpfromcube10+"
  },
  {
    "text": "You watch as the cube slowly gets bigger and bigger. You can see that it's having trouble with the fact that the tunnel which it already filled is not expanding with it.\n\nYou're not sure that you can really read the body language of a Gelatinous Cube, but you think it's probably in a lot of pain. Can they even feel pain?\n",
    "option1Name": "Continue",
    "option1Key": "expandingCubeDeath",
    "key": "jfc792"
  },
  {
    "text": "The process takes a while, but eventually the spell wears off, and the cube shrinks back down to it's normal size. When it does, it does not go back into it's normal cube shape. You are confident that it died from the tunnel squeezing it.\n\nEventually you are able to get around it and continue on your way. Even if you are much delayed in that process.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "expandingCubeDeath",
    "action": "doom"
  },
  {
    "text": "Yes, using a crossbow seems like it's the more reasonable action. \n\nYou take a couple more steps back to stay away from the Gelatinous Cube, and you get your crossbow out and ready some bolts.\n\nYou don't worry too much about aim as you really can't miss. It's filling the entire passage.\n\nLet's roll some dice anyway. How about Dexterity?\n",
    "option1Name": "Roll!",
    "option1Key": "gcCB6-",
    "option2Name": "gcCB79",
    "option2Key": "gcCB79",
    "option3Name": "gcCB10+",
    "option3Key": "gcCB10+",
    "key": "gcCrossbow",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "[[gcthrowEnchantedDagger]]",
    "option1Name": "gcthrowEnchantedDagger",
    "option1Key": "gcthrowEnchantedDagger",
    "option2Name": "gccheckPrepared",
    "option2Key": "gccheckPrepared",
    "key": "gcSomething",
    "action": "checkAttribute",
    "Enchanted-Dagger": true
  },
  {
    "text": "Ok, so you do hit the Gelatinous Cube. It really wasn't possible to miss. However, you don't really seem to hurt it. \n\nAlso, you didn't know until just now that a Gelatinous Cube could expunge something inside of it, much less that it could do so at a high velocity. Remember that battle axe head that was floating inside of it? It's now flying at you very quickly.\n\nRoll Dexterity to dodge.",
    "option1Name": "Roll",
    "option1Key": "gcCBDodge6-",
    "option2Name": "gcCBDodge79",
    "option2Key": "gcCBDodge79",
    "option3Name": "gcCBDodge10+",
    "option3Key": "gcCBDodge10+",
    "key": "gcCB6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "The best way you can think to do this, is to just keep hitting the cube as quickly as you can. You keep firing crossbow bolts at it over and over. The bolts seem to be doing some damage to it, so you don't stop.\n\nYou work yourself into a bit of a frenzy and you can hear yourself screaming as you keep firing, but it doesn't register that the voice that is screaming is yours.\n\nYou don't notice that you are getting splashed by some of the cube's matter that is flying off of it.\n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "gcCB792",
    "key": "gcCB79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You take careful aim right at the ceneter of mass. With a slow exhale, you squeeze the trigger and release the crossbow bolt.\n\nThe bolt hits right in the center of the cube and hits the gleaming gem that was floating in there.\n\nYou see the gem start to crack, and light starts to come out of the cracks. You duck just as the gem explodes and sucks the Gelatinous Cube into some sort of alternate dimension.\n",
    "option1Name": "Cool!",
    "option1Key": "GCCBDodge102",
    "key": "gcCB10+"
  },
  {
    "text": "The axe head hits you right in the head. Lucky for you, Gelatinous Cubes are not proficient axe throwers, and you get hit by the broad side. It still had a lot of force behind it, and you lose @X Hit Points. \n\nAlso, everything goes black.\n",
    "option1Name": "Continue",
    "option1Key": "gcCBDodge6-2",
    "key": "gcCBDodge6-",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "You dive out of the way of the axe head. Successfully avoiding losing your head. However, you didn't really take into account the small width of the tunnel when you dove. You hit your head on the rock wall, and everything goes black.\n",
    "option1Name": "Continue",
    "option1Key": "gcCBDodge792",
    "key": "gcCBDodge79"
  },
  {
    "text": "You sidestep the axehead as it's coming for you. Then you deftly reach out and grab it. \n\nWithout thinking about it, you throw it back at the Gelatinous Cube. The axehead hits right in the center of the cube and hits the gleaming gem that was floating in there.\n\nYou see the gem start to crack, and light starts to come out of the cracks. You duck just as the gem explodes and sucks the Gelatinous Cube into some sort of alternate dimension.\n",
    "option1Name": "Cool!",
    "option1Key": "GCCBDodge102",
    "key": "gcCBDodge10+"
  },
  {
    "text": "You wake up later with a massive headache.\n\nYou sit up and look around, and the Gelatinous Cube seems to be gone. You don't know how much time has passed, and you don't know where the cube went.\n\nThese are things you probably should be worried about, but instead you decide to keep on going.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcCBDodge6-2"
  },
  {
    "text": "You wake up later with a massive headache.\n\nYou sit up and look around, and the Gelatinous Cube seems to be gone. You don't know how much time has passed, and you don't know where the cube went.\n\nThese are things you probably should be worried about, but instead you decide to keep on going.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcCBDodge792",
    "action": "doom"
  },
  {
    "text": "You're now really curious what sort of gem that was. Unfortunately, there's not much you can do to figure it out.\n\nWith a shrug, you get back on your journey.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "GCCBDodge102"
  },
  {
    "text": "When you finally stop firing, there is nothing left of the Gelatinous Cube by a slurry of slime and bolts on the ground. After you catch your breath, you carefully step over it, and continue down the path.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcCB792"
  },
  {
    "text": "The first thing you find to throw at the Gelatinous Cube is the Enchanted Dagger that you picked up earlier. \n\nWith a thought of \"easy come, easy go\" you chuck the dagger at the cube.\n\nRoll Strength.\n",
    "option1Name": "Roll",
    "option1Key": "gcTD6-",
    "option2Name": "gcTD79",
    "option2Key": "gcTD79",
    "option3Name": "gcTD10+",
    "option3Key": "gcTD10+",
    "key": "gcthrowEnchantedDagger",
    "action": "removeAttribute",
    "attribute": "Enchanted-Dagger",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "[[gcThrowpotion]]",
    "option1Name": "gcThrowpotion",
    "option1Key": "gcThrowpotion",
    "option2Name": "gcThrowRock",
    "option2Key": "gcThrowRock",
    "key": "gccheckPrepared",
    "action": "checkAttribute",
    "attribute": "Well-Prepared"
  },
  {
    "text": "You quickly dig through the pack of provisions that the bartender gave you looking for something to throw. You find a small vial inside with a label that says Gelatinous Cube Removal Potion.\n\nThat seems really oddly specific, but very useful in this situation.\n\nYou throw it at the Gelatinous Cube.\n",
    "option1Name": "Throw",
    "option1Key": "gcThrowpotion2",
    "key": "gcThrowpotion"
  },
  {
    "text": "With a lack of anything better to throw, you decide to throw a rock that you find laying nearby.\n\nRoll Strength to see how that goes for you.\n",
    "option1Name": "Roll",
    "option1Key": "gcTR6-",
    "option2Name": "gcTR6-",
    "option2Key": "gcTR6-",
    "option3Name": "gcTR10+",
    "option3Key": "gcTR10+",
    "key": "gcThrowRock",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "Well, the cube is kind of filling the. entire passage, so you can't really miss. However, the magic of the dagger seems to react badly with the Gelatinous Cube. \n\nExplosively so.\n\nThe cube bursts, pieces of it go flying everywhere. There is no way to avoid getting splashed.\n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "gcTD6-2",
    "key": "gcTD6-",
    "action": "losehp",
    "amount": "3"
  },
  {
    "text": "You hit the Gelatinous Cube with the dagger pretty square in the middle. You still have no idea what sort of enchantment is on this dagger, but you do see a lot of pretty lights coming from it.\n\nIn moments, the light gets so bright that you have to avert your eyes. Once it's gone you look and you can see no trace of the dagger or the cube.\n\nWith the hallyway clear, you move on.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcTD79"
  },
  {
    "text": "You have no idea what sort of enchantment is on this dagger, but it appears to be really powerful. \n\nThe dagger goes clear through the Gelatinous Cube like a comet. It clatters to the ground in the distance. There isn't much left of the cube. You carefully step over the remains, pick up the dagger, and continue on your way.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcTD10+",
    "action": "addAttribute",
    "attribute": "Enchanted-Dagger"
  },
  {
    "text": "You take off your cloak which is now covered in acidic goo, and use the cleanish parts to wipe as much of the goo off as you can.\n\nYou're probably goinng to have some permanent scars from this. At least the tunnel is clear and you can go on.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcTD6-2"
  },
  {
    "text": "The vial breaks on contact with the cube, and the liquid inside gets absorbed by it. Theresult is almost instant. The Gelatinous Cube starts to shrivle and shrink. You can see steam rising from it.\n\nAfter a few moments, there is just a misshapen lump on the ground. You decide that if you make it back to that same bar, you're going to give the bartender a really bit tip.\n\nWith the cube gone, you move on.\n",
    "option1Name": "Continue",
    "option1Key": "pastGC",
    "key": "gcThrowpotion2"
  },
  {
    "text": "Ok, so you do hit the Gelatinous Cube. It really wasn't possible to miss. However, the bolt didn't really seem to hurt it. \n\nAlso, you didn't know until just know that a Gelatinous Cube could expunge something inside of it, much less that it could do so at a high velocity. Remember that battle axe head that was floating inside of it? It's now flying at you very quickly.\n\nRoll Dexterity to dodge.",
    "option1Name": "Roll",
    "option1Key": "gcCBDodge6-",
    "option2Name": "gcCBDodge79",
    "option2Key": "gcCBDodge79",
    "option3Name": "gcCBDodge10+",
    "option3Key": "gcCBDodge10+",
    "key": "gcTR6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "You take careful aim right at the center of mass. With a slow exhale, you pitch the rock at the Gelatinous Cube.\n\nThe rick hits right in the center of the cube and hits the gleaming gem that was floating in there.\n\nYou see the gem start to crack, and light starts to come out of the cracks. You duck just as the gem explodes and sucks the Gelatinous Cube into some sort of alternate dimension.\n",
    "option1Name": "Cool!",
    "option1Key": "GCCBDodge102",
    "key": "gcTR10+"
  },
  {
    "text": "You enter a large feasting hall. The first thing that you notice is the smell. The room stinks like a chicken coop.\n\nTables and other furniture in various states of decay litter the room. You stop and examine the one closest to you. While you aren't an expert, it appears to be several hundred years old. It also has large claw marks on it.\n",
    "option1Name": "Continue",
    "option1Key": "cockatrice2",
    "key": "cockatrice",
    "action": "clear"
  },
  {
    "text": "You just found the room that will be written about a rust monster. It's going to be the best room. It'll have lots of witty writing and you'll enjoy a mirthful chuckle. \n\nBut, since it's not written, go to the alternate room instead.\n",
    "option1Name": "This way >",
    "option1Key": "cockatrice",
    "key": "rustmonster",
    "action": "clear"
  },
  {
    "text": "You hold your torch up, and peer into the darkness as well as you can. You hear a deafening gutteral \"bawk bawk bawk BAGOCK!\"\n\nOut of the shadows steps a creature that you have only heard about in legends. It resembles a chicken, but stands as tall as a man, it's wings are the leathery wings of a bat, and it has a tail of a snake.\n\nIt's a Cockatrice",
    "option1Name": "Continue",
    "option1Key": "cockatrice3",
    "key": "cockatrice2"
  },
  {
    "text": "As a worldly and experienced adventurer, you know that the Cockatrice is a deadly creature. This one is a large one. The gaze of a Cockatrice will turns it's victim to stone. The only cure is it's own saliva. Of course typically that comes into play when you are being eaten.\n\nWhat do you do?\n",
    "option1Name": "Run & Hide",
    "option1Key": "cocoRun",
    "option2Name": "Fight",
    "option2Key": "cocoFight",
    "key": "cockatrice3"
  },
  {
    "text": "You see a good pile of tables off to one side that would offer temporary protection. Roll Dexterity to see if you make it there.\n",
    "option1Name": "Roll",
    "option1Key": "cocoRun6-",
    "option2Name": "cocoRun79-",
    "option2Key": "cocoRun79-",
    "option3Name": "cocoRun10+",
    "option3Key": "cocoRun10+",
    "key": "cocoRun",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "Double-click this passage to edit it.",
    "option1Name": "cocoFightWiz",
    "option1Key": "cocoFightWiz",
    "option2Name": "cocoFightFight",
    "option2Key": "cocoFightFight",
    "key": "cocoFight",
    "action": "checkClass"
  },
  {
    "text": "You start to run, but the room is poorly lit, and you trip and twist your ankle. You sense a presence just behind you. You roll over and see the Cockatrice looming over you.\n\nAs it looks into your eyes, you feel a numbing sensation as you start to turn to stone.\n\nRoll Constitution to see if you can resist.\n",
    "option1Name": "Roll",
    "option1Key": "crs6-",
    "option2Name": "crs79",
    "option2Key": "crs79",
    "option3Name": "crs10+",
    "option3Key": "crs10+",
    "key": "cocoRun6-",
    "moveTriggered": true,
    "moveStat": "Constitution"
  },
  {
    "text": "You take off for the hiding place paying little heed to anything except getting out of danger. \n\nYou're able to get to the stack of tables with little problem. There is a really good space underneath just for hiding in. The problem is that it's full of rather large eggs.\n",
    "option1Name": "Continue",
    "option1Key": "cocoNest",
    "key": "cocoRun79-"
  },
  {
    "text": "You make a run for the stack of tables that you saw. You have to duck and weave through other bits of furniture while being mindful of the dilapidated stone floor.\n\nYou are relieved that you  manage to get there completely unscathed.\n",
    "option1Name": "Continue",
    "option1Key": "cocoHiding",
    "key": "cocoRun10+"
  },
  {
    "text": "You failed that roll. In fact, you just failed 2 in a row. That's unfortunate.\n\nYou feel everything go dark and cold as you turn to stone. You are now giant chicken feed.\n\nWould you like to try again?",
    "option1Name": "Yes",
    "option1Key": "end",
    "key": "crs6-"
  },
  {
    "text": "You feel a wave a nausia coming over you. You manage to roll over just as you expunge some of your most recent meal. It feels pretty rough coming up, and there are some rocky bits in it. You're pretty sure that you just lost some internal organs.\n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "crs792",
    "key": "crs79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "Suddenly the numbness goes away. You look at your hand and it's perfectly normal. You look back at the Cockatrice, and it seems just as confused as you are. You take the opportunity to scramble away and into a hiding place.\n",
    "option1Name": "Continue",
    "option1Key": "cocoHiding",
    "key": "crs10+"
  },
  {
    "text": "The Cockatrice starts to peck at your disgorged matter. You use the distraction as an opportunity to scramble away into a hiding spot.\n",
    "option1Name": "Continue",
    "option1Key": "cocoHiding",
    "key": "crs792"
  },
  {
    "text": "Okay, now you're hiding from a really big chicken in the hall of ancient underground ruins. What are you going to do now smart person?\n",
    "option1Name": "Surprise Attack when it gets close",
    "option1Key": "cocosurprise",
    "option2Name": "Try to put it to sleep",
    "option2Key": "cocosleep",
    "key": "cocoHiding"
  },
  {
    "text": "The nest has roughly a dozen eggs in it. You don't take the time to count them, so you aren't really sure. You have a larger problem to worry about at the moment. \n\nIn fact, because you can't really hide without crushing all the eggs, you are just kind of standing there when the Cockatrice sees you.\n",
    "option1Name": "Continue",
    "option1Key": "cocohidingfound",
    "key": "cocoNest"
  },
  {
    "text": "You wait until the perfect moment, then jump out of your hiding spot to attack the Cockatrice!\n",
    "option1Name": "YAAAAA",
    "option1Key": "cocoFight",
    "key": "cocosurprise"
  },
  {
    "text": "this dialog will not display\n",
    "option1Name": "cocosleepwizard",
    "option1Key": "cocosleepwizard",
    "option2Name": "cocosleepfighter",
    "option2Key": "cocosleepfighter",
    "key": "cocosleep",
    "action": "checkClass"
  },
  {
    "text": "It is quite obvious that the correct solution as a great and powerful wizard is to cast a sleep spell on the Cockatrice. This is the best solution for both you and the creature to survive.\n\nRoll Intelligence to see how you do.",
    "option1Name": "Roll",
    "option1Key": "csw6-",
    "option2Name": "csw79",
    "option2Key": "csw79",
    "option3Name": "csw10+",
    "option3Key": "csw10+",
    "key": "cocosleepwizard",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "[[cocosleeppotion]]",
    "option1Name": "cocosleeppotion",
    "option1Key": "cocosleeppotion",
    "option2Name": "cocosleepsing",
    "option2Key": "cocosleepsing",
    "key": "cocosleepfighter",
    "action": "checkAttribute",
    "Attribute": "Well-Prepared"
  },
  {
    "text": "Surely the pack that you got from the bartender has some way in it to deal with a raging cockatrice. \n\nYou dig through the pack a bit, and you find a sleeping potion. Since you dont' really want to get close enough to get the Cockatrice to drink it, your best bet is to just throw it like a molotov and hope for the best.\n\nRoll Dexterity to throw.\n",
    "option1Name": "Roll",
    "option1Key": "csp6-",
    "option2Name": "csp79",
    "option2Key": "csp79",
    "option3Name": "csp10+",
    "option3Key": "csp10+",
    "key": "cocosleeppotion",
    "moveTriggered": true,
    "mvoeStat": "Dexterity"
  },
  {
    "text": "With a lack of any better options, you decide to sing a lullaby to this mythical beast that can turn you to stone with just a glance. You are either very brave or very stupid. \n\nWe will let the dice decide which.\n\nRoll Charisma to sing.",
    "option1Name": "Roll!",
    "option1Key": "css6-",
    "option2Name": "css79",
    "option2Key": "css79",
    "option3Name": "css10+",
    "option3Key": "css10+",
    "key": "cocosleepsing",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "Ducking down in your hiding place, you prepare the spell. Once it's ready you jump up and shout \"GO TO SLEEP!\"\n\nThe cockatrice simply turns and looks at you.\n",
    "option1Name": "Well Crap.",
    "option1Key": "cocohidingfound",
    "key": "csw6-"
  },
  {
    "text": "Ducking down in your hiding place, you prepare the spell. Once it's ready you jump up and shout \"Ukulala!\"\n\nA bit to your surprise, the Cockatrice is standing right on the other side of the table you are behind. It closes it's eyes, and starts to fall forward... right at you...\n\nYou put your hands out, but as it falls down, you go down with it and end up pinned by it.\n",
    "option1Name": "Continue",
    "option1Key": "cocopinned",
    "key": "csw79"
  },
  {
    "text": "Ducking down in your hiding place, you prepare the spell. Once it's ready you jump up and shout the verbal part of the incantation.\n\nYou watch as the Cockatrice falls to the ground, sound asleep.\n\nYou are now free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "csw10+"
  },
  {
    "text": "With a lack of other options, you decide that fighting this thing is the only way to stay alive right now.\n",
    "option1Name": "Continue",
    "option1Key": "cocoFight",
    "key": "cocohidingfound"
  },
  {
    "text": "It takes a lot of effort, but you are able to push the sleeping Cockatrice off of you. The only real lingering damage that it did is to cover you in it's stench.\n\nYou're going to have to live with that for a while.\n\nYou are now free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "cocopinned"
  },
  {
    "text": "You spend some time looking around the room. It appears that someone was keeping the creature here as a source of large eggs.\n\nYou see near the far end a pile of broken statues.\n",
    "option1Name": "Continue",
    "option1Key": "cocoFood",
    "key": "cocoDown"
  },
  {
    "text": "You stand up and chuck the bottle of sleeping potion at the Cockatrice. It hits the cockatrice right in the head, which you think is an excellent result, except the bottle doesn't break, and now the beast is looking right at you.\n",
    "option1Name": "Well Crap.",
    "option1Key": "cocohidingfound",
    "key": "csp6-"
  },
  {
    "text": "You stand up and chuck the bottle at the cockatrice, which is actually almost within arms reach. The bottle explodes and sleeping potion goes everywhere. \n\nYou yawn.\nYou feel really kind of sleepy, and that nice feathered thing there looks really comfortable. Without really thinking about it, you just kind of curl up on it.\n",
    "option1Name": "Continue",
    "option1Key": "csp792",
    "key": "csp79"
  },
  {
    "text": "You stand up and chuck the sleeping potion at the Cockatrice. You have impeccible aim, as it hits the Cockatrice right in the face and shatters spilling all over it. \n\nYou watch as the Cockatrice falls to the ground, sound asleep.\n\nYou are now free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "csp10+"
  },
  {
    "text": "You wake up curled in a nice warm bed of Cockatrice. You aren't sure how much time has passed, but you are at least relieved to know that the Cockatrice is still asleep.\n\nBeing very careful to not wake it, you extricate yourself. You don't know how long it'll stay alseep, but you are free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "csp792",
    "action": "doom",
    "amount": "2"
  },
  {
    "text": "You stand up and begin to sing the best lullaby song that you can think of...\n\nwhich is Happy Birthday...\n\nYour adventuring lifestlye is not very conducive to child rearing, and it shows.\n\nThe Cockatrice looks at you quizzically.\n",
    "option1Name": "Continue",
    "option1Key": "cocohidingfound",
    "key": "css6-"
  },
  {
    "text": "You stand up, and start to sing \"Hush Little Baby\". The COckatrice looks at you, but doesn't move.\n\nHopeful that this crazy plan will work, you keep singing.\n\nThe strangest thing happens, the creature starts to sing along with you. Not the words of course, but it carries the tune. In fact, it harmonizes with you a little bit.\n\nIt doesn't move from it's spot.\n\nYou are free to explore the room, as long as you don't stop singing.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "css79"
  },
  {
    "text": "Boldy, you stand up, and start singing \"Baby Mine\" just the way that your mother sang to you when you were just a wee little one.\n\nThe Cockatrice looks at you. Without meeting it's gaze, you keep singing.\n\nIt's eyes start to droop, and it's head gets heavy. Encouraged by this, you don't let the song stop. Just as you sing the last \"Sweet as can be\" the Cockatice lays down, and goes to sleep.\n\nYou are free to explore the room.",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "css10+"
  },
  {
    "text": "No Chicken/Lizard/Bat creature can stand before the might of your arcane powers. You shall smite this thing into oblivion. You prepare an arcane blast knowing that will finish it quickly.\n\nRoll Intelligence to cast.",
    "option1Name": "Roll",
    "option1Key": "cfw6-",
    "option2Name": "cfw79",
    "option2Key": "cfw79",
    "option3Name": "cfw10+",
    "option3Key": "cfw10+",
    "key": "cocoFightWiz",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Okay, you are a guy with a sword. You need to use it to kill a giant chicken/lizard/bat thing. You got this. \n\nRoll Strength to see what happens.",
    "option1Name": "Roll!",
    "option1Key": "ccff6-",
    "option2Name": "ccff79",
    "option2Key": "ccff79",
    "option3Name": "ccff10+",
    "option3Key": "ccff10+",
    "key": "cocoFightFight",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "You cast the blast at the Cockatrice, but your spell goes wide and instead takes out a support column. \n\nWith a loud rumble, part of the ceiling falls in, and you jump to avoid getting crushed.\n\nRoll Dexterity.",
    "option1Name": "Roll!",
    "option1Key": "ccfj6-",
    "option2Name": "ccfj79",
    "option2Key": "ccfj79",
    "option3Name": "ccfj10+",
    "option3Key": "ccfj10+",
    "key": "cfw6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "The Cockatrice leaps at you just as you unleash your bolt of arcane power. You bolt hits it at nearly point blank range and it flies backward and into a lump on the ground.\n\nIt takes you a moment to notice the pain in your leg. You look down and see a sizeable gash from where the cockatrice got it's claws into you. You lose @X Hit points.\n",
    "option1Name": "Continue",
    "option1Key": "cocoblasted",
    "key": "cfw79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "The Cockatrice leaps at you. You shout \"HADOUKEN\" just as you throw a blast of energy into it's face. \n\nThe Cockatrice flies backward and lands in a lump.\n",
    "option1Name": "Continue",
    "option1Key": "cocoblasted",
    "key": "cfw10+"
  },
  {
    "text": "What a way to go. Squished in a giant underground monster chicken coop that you caused to cave in.\n\nYour name will not be remembered.\n\nWould you like to try again?",
    "option1Name": "Yes!",
    "option1Key": "end",
    "key": "ccfj6-"
  },
  {
    "text": "You avoid the majority of. the cave in, but you are still hit by a few rather large rocks. You lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "cococeilingcollapsed",
    "key": "ccfj79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You do a wonderful triple backflip avoiding each piece of falling rock. The only downside is that you wish someone could have seeen it. It was amazing.\n",
    "option1Name": "Continue",
    "option1Key": "cococeilingcollapsed",
    "key": "ccfj10+"
  },
  {
    "text": "The good news is that it appears that the Cockatrice was crushed by the collapsing ceiling.\n\nNow that you don't have a murderous chicken monster to worry about, you are free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "cococeilingcollapsed"
  },
  {
    "text": "You walk up to the cockatrice and prod it a couple of times with your boot. It appears to be quite dead. \n\nYou are now free to explore the room.",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "cocoblasted"
  },
  {
    "text": "That did not go well. You leap at the Cockatrice and swing your sword way too early, completely missing the beast. It steps in behind you and swipes it's oversized deadly talons at you.\n\nRoll Dexterity to dodge!",
    "option1Name": "Roll!",
    "option1Key": "ccffDodge6-",
    "option2Name": "ccffDodge79",
    "option2Key": "ccffDodge79",
    "option3Name": "ccffDodge10+",
    "option3Key": "ccffDodge10+",
    "key": "ccff6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "You leap at the Cockatrice and swing your sword in a great arc. You embed your sword into the beast killing it, but not before it can dig it's claws into you.\n\nYou lose @X hit points.\n",
    "option1Name": "Continue",
    "option1Key": "ccffwin",
    "key": "ccff79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You leap at the Cockatrice and in one deft move you bury your sword right into its chest piercing where you think its heart might be.\n",
    "option1Name": "Continue",
    "option1Key": "ccffwin",
    "key": "ccff10+"
  },
  {
    "text": "The last thing you feel is the claws of the Cockatrice digging into your back. The pain is excruciating, but soon dies away as does the rest of the world.\n\nEverything goes dark.\nYou have died.\n\nWould you like to play again?\n",
    "option1Name": "Yes",
    "option1Key": "end",
    "key": "ccffDodge6-"
  },
  {
    "text": "You feel excruciating pain as the cockatrice leaves a long gouge in your back. You lose @X HP.\n",
    "option1Name": "Continue",
    "option1Key": "ccffdodged",
    "key": "ccffDodge79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You duck down just in the nick of time to avoid the claws. You feel them just lightly brush over your head. \n",
    "option1Name": "Continue",
    "option1Key": "ccffdodged",
    "key": "ccffDodge10+"
  },
  {
    "text": "You spin around and strike out with your sword skewering the monstrosity!\n\nIt slumps to the ground, and you use your foot to pull your sword free.\n",
    "option1Name": "Continue",
    "option1Key": "ccffwin",
    "key": "ccffdodged"
  },
  {
    "text": "The cockatrice lays before you in a bloody heap. You prod it a couple of times with your sword to make sure that it is indeed dead. \n\nYou are free to explore the room.",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "ccffwin"
  },
  {
    "text": "Double-click this passage to edit it.",
    "option1Name": "cocoFoodalive",
    "option1Key": "cocoFoodalive",
    "option2Name": "cocoFooddead",
    "option2Key": "cocoFooddead",
    "key": "cocoFood",
    "action": "checkDoom",
    "amount": "3"
  },
  {
    "text": "As you approach the pile of statues, you notice that one of them isn't a statue at all. It's a teenage boy. He's unconcious, and seems to be roughed up a bit, but still in one piece.\n",
    "option1Name": "Wake Him",
    "option1Key": "wakeboy",
    "key": "cocoFoodalive"
  },
  {
    "text": "As you get to the pile of statues, you are very impressed in the workmanship of them. Then of course you realize that they aren't statues at all, but victims of the Cockatrice. It preserves it's food by turning it to stone. \n\nMost of these have been here a long time and are pretty broken up. One in particular catches your eye. It's a teenage boy matching the description of Jimmy. Still in once piece, but irreversibly turned to stone. If only you had gotten here sooner.\n",
    "option1Name": "Continue",
    "option1Key": "stonejimmy",
    "key": "cocoFooddead"
  },
  {
    "text": "After shaking him a bit, and getting him to drink some water, the kid rouses enough that you can talk to him.\n",
    "option1Name": "Are you Jimmy?",
    "option1Key": "talktojimmy",
    "key": "wakeboy"
  },
  {
    "text": "The boy says:\n\"Yeah, I'm Jimmy. Did my Mom send you after me? She's always worrying.\"\n\n\"I'm glad you got here when you did, any longer and I would be just another statue.\" He looks at the other statues. \"or pieces of one...\"\n",
    "option1Name": "Continue",
    "option1Key": "ttjimmy2",
    "key": "talktojimmy"
  },
  {
    "text": "\"I came down here to work with a necromancer. He tossed me out here because I made too many mistakes. Some apprentice I turned out to be.\"\n\n\"Anyway, you gotta stop him. He's going to raise an army of dead and attack the town.\"\n\nWith that, the boy passes out again. You won't be able to fight a necromancer while carrying him, so you leave him here with the intention of coming back to get him later.\n",
    "option1Name": "Continue",
    "option1Key": "pastJimmy",
    "key": "ttjimmy2"
  },
  {
    "text": "In the back of the room, you find another hallway way leading deeper into the compound.  Individual footprints are indistinguishable as the centuries of dust has been trampled down with frequent passage.\n",
    "option1Name": "Continue",
    "option1Key": "tunnel3",
    "key": "pastJimmy"
  },
  {
    "text": "You say a silent prayer to whichever god is listening before you get up to go one your way. It is clear that someone left Jimmy in here, and you are going to find out who.\n",
    "option1Name": "Continue",
    "option1Key": "pastJimmy",
    "key": "stonejimmy"
  },
  {
    "text": "Not far down this passage you find a door on either side. They are identical and both show signs of fairly regular use. Your years of adventuring experience tells you that investigating one of these side chambers will most certainly reveal some pertanent information. Which would you like to investigate?\n",
    "option1Name": "The one on the Left",
    "option1Key": "leftroom",
    "option2Name": "The one on the Right",
    "option2Key": "rightroom",
    "key": "tunnel3",
    "action": "clear"
  },
  {
    "text": "You look at the door to the room on the right. There's a painting on the door of a stick man wearing a yellow helmet and vest. He's holding up a sign that says \"Under Construction\".\n\nYou try the door handle, but it won't open. You decide that maybe you should go to the left room instead.\n",
    "option1Name": "Continue",
    "option1Key": "leftroom",
    "key": "rightroom"
  },
  {
    "text": "You open the door on the left. You find what appears to be some sort of storage room. There are a few shelves with miscellaneous things on them. Vials, scrolls, and some candles in a variety of colors.\n\nThere is also a big fat juicy treasure chest in the middle of the room.\n\nWhat would you like to do first?\n",
    "option1Name": "Check the treasure chest",
    "option1Key": "chest1",
    "option2Name": "Rifle through the shelves",
    "option2Key": "shelves1",
    "key": "leftroom"
  },
  {
    "text": "The treasure chest is made of a high quality wood. Even though it's probably very old, it has held up well over these years. The hinges and lock are all made of brass and are orantely decorated as is the rest of the chest.\n\nThis is the sort of thing that you might find in a castle, not in some dingy underground ruins.\n",
    "option1Name": "Continue",
    "option1Key": "checkChestClass",
    "key": "chest1"
  },
  {
    "text": "You dig through the shelves a bit.\nThe scrolls appear to be some sort of ancient diagrams of the human body. They might have been used by healers in days long past. They're in a language that you don't recognize, so they aren't really that useful to you.\n",
    "option1Name": "Look at the candles",
    "option1Key": "candles1",
    "key": "shelves1"
  },
  {
    "text": "The candles are candles. They might come in handy in case that torch you've been carrying this entire time, which appears to remain lit through the sheer power of the narrative, goes out at some inopportune moment.\n\nYou put a couple of them in your bag.\n",
    "option1Name": "How about those vials?",
    "option1Key": "vials1",
    "key": "candles1",
    "action": "addAttribute",
    "attribute": "HasCandles"
  },
  {
    "text": "Most of the vials are empty. They could use a good washing though. There are a couple that have some sort of liquid in them. It's kind of viscous and really indeterminate in effect.\n\nDo you want to pocket one?",
    "option1Name": "Yeah!",
    "option1Key": "pocketvial",
    "option2Name": "That seems unwise",
    "option2Key": "novial",
    "key": "vials1"
  },
  {
    "text": "You grab one of the vials and look a bit closer. Let's say it's green in color. You stick it in a pocket in your cloak.\n",
    "option1Name": "Continue",
    "option1Key": "tochestornottochest",
    "key": "pocketvial",
    "action": "addAttribute",
    "attribute": "HasVial"
  },
  {
    "text": "Yeah, sticking a glass tube of some potentially dangerous substance in your pocket is probably a bad idea. You leave it behind.\n",
    "option1Name": "Continue",
    "option1Key": "tochestornottochest",
    "key": "novial"
  },
  {
    "text": "[[doneshelves]]",
    "option1Name": "doneshelves",
    "option1Key": "doneshelves",
    "option2Name": "tochestornottochest2",
    "option2Key": "tochestornottochest2",
    "key": "tochestornottochest",
    "action": "checkHistory",
    "attribute": "chest1"
  },
  {
    "text": "You look at the door on the opposite side of the hallway. You decide that whatever is in there probably isn't worth your time, and you move on.\n",
    "option1Name": "Continue",
    "option1Key": "penult1",
    "key": "exitroom"
  },
  {
    "text": "Now, about that nice treasure chest. Do you want to go see what's inside?\n",
    "option1Name": "Of course!",
    "option1Key": "chest1",
    "option2Name": "Nah, I'm good",
    "option2Key": "tochestornottochest3",
    "key": "tochestornottochest2"
  },
  {
    "text": "Really? You don't want to see what's in the. chest?\nIt could be something really cool. Maybe a magic sword, or some sweet nunchucks that shoot fireballs, or perhaps some Lembas bread. \nHow long has it been since you've eaten?",
    "option1Name": "I said I don't want to open the chest",
    "option1Key": "nochest",
    "option2Name": "Fine, I'll open it",
    "option2Key": "chest1",
    "key": "tochestornottochest3"
  },
  {
    "text": "Okay... I guess... We'll just move on then.\n",
    "option1Name": "Finally...",
    "option1Key": "exitroom",
    "key": "nochest"
  },
  {
    "text": "You no see this text",
    "option1Name": "chestWizard",
    "option1Key": "chestWizard",
    "option2Name": "chestFighter",
    "option2Key": "chestFighter",
    "key": "checkChestClass",
    "action": "checkClass"
  },
  {
    "text": "Would you rather check the chest to see if it's locked, or just assume that it is and prepare a spell to open it?\n",
    "option1Name": "Check it",
    "option1Key": "kickchest",
    "option2Name": "Prepare the spell",
    "option2Key": "wizopen",
    "key": "chestWizard"
  },
  {
    "text": "[[preparedFighterChest]]",
    "option1Name": "preparedFighterChest",
    "option1Key": "preparedFighterChest",
    "option2Name": "unpreparedFighterChest",
    "option2Key": "unpreparedFighterChest",
    "key": "chestFighter",
    "action": "checkAttribute",
    "attribute": "WellPrepared"
  },
  {
    "text": "You eye that very innocent looking chest. \nThen you give it a hearty kick to get it to pop open.",
    "option1Name": "Continue",
    "option1Key": "kickchest2",
    "key": "kickchest"
  },
  {
    "text": "Such a chest surely would be locked. Plus, there might be some sort of trap, and your spell will mitigate that as well as open the lock.\n\nThe spell that you need to use is very delicate. You need to get close to the chest for it to work. You'll have to get down on your hands and knees.\n",
    "option1Name": "Okay, here I go.",
    "option1Key": "wizopen2",
    "key": "wizopen"
  },
  {
    "text": "There might be some sort of lock picking set inside the bag that you got from the innkeep. Do you want to dig and see if you can find one, or do you want to check the chest first and see if it's locked?\n",
    "option1Name": "Check the chest",
    "option1Key": "kickchest",
    "option2Name": "Look for picks",
    "option2Key": "lookbagchest",
    "key": "preparedFighterChest"
  },
  {
    "text": "Since you don't really have anything handy to open a lock, I guess the first thing to do is to just try to open it.\n",
    "option1Name": "Continue",
    "option1Key": "kickchest",
    "key": "unpreparedFighterChest"
  },
  {
    "text": "You pull out the bag of supplies from the innkeep. After rummaging around a little, you do find a. nice little lock picking set. You are glad that you did that little lockpicking tutorial that the thieves guild put on at the fair last month.\n\nOn get down on your knees and carefully put the picks into the lock of that very nice and innocent looking chest.\n",
    "option1Name": "Continue",
    "option1Key": "pickchest",
    "key": "lookbagchest"
  },
  {
    "text": "Suddenly, a hand springs out of the side of the chest and grabs your foot. In a shocking twist of events, this is no ordinary treasure chest. It's actually a mimic! WHAT A TWIST!\n",
    "option1Name": "Saw that coming...",
    "option1Key": "mimichasfoot",
    "key": "kickchest2"
  },
  {
    "text": "[[wizardGrabbed]]",
    "option1Name": "wizardGrabbed",
    "option1Key": "wizardGrabbed",
    "option2Name": "fighterGrabbed",
    "option2Key": "fighterGrabbed",
    "key": "mimichasfoot",
    "action": "checkClass"
  },
  {
    "text": "Suddenly, a hand springs out of the side of the chest and grabs your wrist. In a shocking twist of events, this is no ordinary treasure chest. It's actually a mimic! WHAT A TWIST!\n",
    "option1Name": "Saw that coming...",
    "option1Key": "mimichasfoot",
    "key": "pickchest"
  },
  {
    "text": "The mimic is starting to pull you towards it. You're pretty sure that it's not looking for a hug. What do you want to do?\n",
    "option1Name": "Pull free.",
    "option1Key": "pullfreew",
    "option2Name": "Use Magic, duh",
    "option2Key": "magicmimic",
    "key": "wizardGrabbed"
  },
  {
    "text": "The mimic is starting to pull you towards it. You're pretty sure that it's not looking for a hug. What do you want to do?\n",
    "option1Name": "Pull free.",
    "option1Key": "pullfree",
    "option2Name": "Stab it.",
    "option2Key": "stabmimic",
    "key": "fighterGrabbed"
  },
  {
    "text": "Yes, getting away from the beast before trying to fight it will allow you to attack it more effectively.\n\nRoll Strength to get away",
    "option1Name": "Roll",
    "option1Key": "pullfree6-",
    "option2Name": "smbfr79",
    "option2Key": "smbfr79",
    "option3Name": "smbfr10+",
    "option3Key": "smbfr10+",
    "key": "pullfree",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "Being a fighter, that is definitely right for your idiom. You are able to reach and grab your sword with no problem.\n\nRoll Strength to attack the Mimic.",
    "option1Name": "Roll",
    "option1Key": "stabmimic6-",
    "option2Name": "stabmimic79",
    "option2Key": "stabmimic79",
    "option3Name": "stabmimic10+",
    "option3Key": "stabmimic10+",
    "key": "stabmimic",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "You try to swing your sword at the mimic, but it pulls you violently just as you swing causing you to fall to the ground, your sword clatters away.\n\nYour best bet now is to try to pull away\n\nRoll strength to see if you can break it's grip.\n",
    "option1Name": "Roll",
    "option1Key": "smbfr6-",
    "option2Name": "smbfr79",
    "option2Key": "smbfr79",
    "option3Name": "smbfr10+",
    "option3Key": "smbfr10+",
    "key": "stabmimic6-",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "You do some very excellent poking at the mimic with your sword. You don't appear to do any really significant damage to it, but it's enough to get it to let go of you.\n\nYou quickly get out of the way.\n",
    "option1Name": "Continue",
    "option1Key": "brokefree",
    "key": "stabmimic79"
  },
  {
    "text": "With a wicked slash, you sever the mimic's arm that is holding you. It doesn't seem overly concerned with the lack of an arm. The look it gives you is one of unconcern, as if it were merely a scratch.\n\nYou quickly get out of the way.\n",
    "option1Name": "Continue",
    "option1Key": "brokefree",
    "key": "stabmimic10+"
  },
  {
    "text": "You are unable to remove yourself from its grip. That is very unfortunate. It pulls you in and and makes you a nice snack. \nNo, not a snack for you.\nYou are the snack.\nRIP.\nWould you likc to play again?",
    "option1Name": "Yes",
    "option1Key": "end",
    "key": "smbfr6-"
  },
  {
    "text": "You are able to pull yourself free, but you get yourself pretty scratched up by it's talon like fingers in the process.\n\nYou lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "brokefree",
    "key": "smbfr79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You twist yourself in a way that the mimic's wrist isn't meant to bend. It screeches in pain as it lets go and you roll away.\n\nWell done.",
    "option1Name": "Continue",
    "option1Key": "brokefree",
    "key": "smbfr10+"
  },
  {
    "text": "Now that you are upright, you can attack it with more vigor.\n\nOr, I suppose you could just run away like some sort of lily-livered coward. Is that what you are?\n",
    "option1Name": "I run away...",
    "option1Key": "llc",
    "option2Name": "I fight!",
    "option2Key": "fightmimic",
    "key": "brokefree"
  },
  {
    "text": "You try to pull away, but instead the mimic slams you down into the ground. Really hard. You're pretty amazed at it's strength. You lose @X hit points.\n",
    "option1Name": "Continue",
    "option1Key": "pullfree6-2",
    "key": "pullfree6-",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "Well, that didn't work so well, \nMaybe you could try distracting it?\n\nMimics do love some gold coins. You could toss some at it.",
    "option1Name": "Worth a shot!",
    "option1Key": "distractMimic",
    "key": "pullfree6-2"
  },
  {
    "text": "Okay, you chuck some of your hard earned gold coins at the mimic.\n\nLets have you roll Charisma for that.",
    "option1Name": "Roll",
    "option1Key": "distractMimic6-",
    "option2Name": "distractMimic79",
    "option2Key": "distractMimic79",
    "option3Name": "distractMimic10+",
    "option3Key": "distractMimic10+",
    "key": "distractMimic",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "You slowly back out of the room.\nAs you leave, you hear the mimic yelling \"Get back here you yellow bellied weak bag of cheese.\"\n\"Your mother was a hampster!\"\n\"You weak kneed nobody!\"\n\"I'm not finished with you!\"\n",
    "option1Name": "Turn back and fight",
    "option1Key": "fightmimic",
    "option2Name": "Just leave",
    "option2Key": "exitroomllc",
    "key": "llc"
  },
  {
    "text": "[[wfm]]",
    "option1Name": "wfm",
    "option1Key": "wfm",
    "option2Name": "ffm",
    "option2Key": "ffm",
    "key": "fightmimic",
    "action": "checkClass"
  },
  {
    "text": "As you close the door, a tear falls from your eye. The insults cut deeper than any sword.\n",
    "option1Name": "Continue",
    "option1Key": "exitroom",
    "key": "exitroomllc"
  },
  {
    "text": "Mimics are far more intelligent than you give them credit for. All that you've really done, is show it that you have gold in your pockets, and that just makes it want to eat  you even more.\n\nIts mouth gets larger and larger as it pulls you closer. You are swallowed whole and you find yourself in its belly, where you find a new definition of pain and suffering, as you are slowly digested over a thousand years.\n",
    "option1Name": "Would you like to play again?",
    "option1Key": "end",
    "key": "distractMimic6-"
  },
  {
    "text": "You manage to throw enough money at the beast to get it to let go. Unfortunately, you pretty much had to empty your pockets to do so. \n\nOnce it lets go, you quickly back away.\n",
    "option1Name": "Continue",
    "option1Key": "brokefree",
    "key": "distractMimic79",
    "action": "addAttribute",
    "attribute": "Penniless"
  },
  {
    "text": "You toss the money up in the air, and the mimic lets go and leaps up to catch the tasty treats in its mouth.\n\nYou quickly back away.\n\nThe mimic pants a bit in anticiaption of more treats. When it figures out that you aren't going to give it more, it starts to growl.\n",
    "option1Name": "Continue",
    "option1Key": "brokefree",
    "key": "distractMimic10+"
  },
  {
    "text": "Yes, getting away from the beast before trying anything elsewill allow you to cast spells more effectively.\n\nRoll Strength to get away",
    "option1Name": "Roll",
    "option1Key": "pullfree6-",
    "option2Name": "smbfr79",
    "option2Key": "smbfr79",
    "option3Name": "smbfr10+",
    "option3Key": "smbfr10+",
    "key": "pullfreew",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "You need to get the thing to let go of you as quickly as you can. The best spell you can think of for that is good old lightening. \n\nYou reach out towards the mimic, mutter the incantation, and ....\n\nRoll Intelligence to complete the sentence.",
    "option1Name": "Roll",
    "option1Key": "magicimimic6-",
    "option2Name": "magicmimic79",
    "option2Key": "magicmimic79",
    "option3Name": "magicmimic10+",
    "option3Key": "magicmimic10+",
    "key": "magicmimic",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "...you blast the mimic with electricity.\n\nThe reason that you never grab an electric fence is that the electricity will cause your hand to tighten the grip on the fence and you just keep getting shocked. Similarly, the mimic tightens ists monsterous grip on your leg causing you sever pain.\nYou loose @X hit points.\n",
    "option1Name": "Continue",
    "option1Key": "magicmimic6-2",
    "key": "magicimimic6-",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "\n... a bolt of lightning strikes the mimic. The shock surprised the mimic enough that it let go of you. Unfortunately, it didn't seem to do significant damage to the beast. \n\nYou quickly get out of the way.\n",
    "option1Name": "Continue",
    "option1Key": "brokefree",
    "key": "magicmimic79"
  },
  {
    "text": "...you hit the beast with ligtning right where the arm that is holding on to you is connected to it. The arm gets severed from the rest of it, and it lets go.\nThe mimic doesn't seem overly concerned with the lack of an arm. The look it gives you is one of unconcern, as if it were merely a scratch.\n\nYou quickly get out of the way.\n",
    "option1Name": "Continue",
    "option1Key": "brokefree",
    "key": "magicmimic10+"
  },
  {
    "text": "Since that didn't work, your best bet now is to try to pull away\n\nRoll strength to see if you can break it's grip.\n",
    "option1Name": "Roll",
    "option1Key": "pullfree6-",
    "option2Name": "smbfr79",
    "option2Key": "smbfr79",
    "option3Name": "smbfr10+",
    "option3Key": "smbfr10+",
    "key": "magicmimic6-2",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "Okay, now that you're close the this perfectly normal and innocent looking chest you are able to get a really good look at the lock.\n\nYou reach your hand out in front of you and close your eyes. You let the magic flow through you to feel the individual mechanisms.\n",
    "option1Name": "Continue",
    "option1Key": "wizopen3",
    "key": "wizopen2"
  },
  {
    "text": "Suddenly, a hand springs out of the side of the chest and grabs your wrist. In a shocking twist of events, this is no ordinary treasure chest. It's actually a mimic! WHAT A TWIST!\n",
    "option1Name": "Saw that coming...",
    "option1Key": "mimichasfoot",
    "key": "wizopen3"
  },
  {
    "text": "Time to end this. No more Mr (or Ms.) nice wizard. You are tempted in incinerate the thing, but there still might be something of value inside, so instead you cast charm.\n\nRoll Intelligence.",
    "option1Name": "Roll",
    "option1Key": "wfm6-",
    "option2Name": "wfm79",
    "option2Key": "wfm79",
    "option3Name": "wfm10+",
    "option3Key": "wfm10+",
    "key": "wfm",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You grab your sword, and ready yourself to finish this thing off. There still might be something of value inside the thing, so you need to be careful.\n\nLet's roll Strength to see what happens.\n",
    "option1Name": "Roll!",
    "option1Key": "ffm6-",
    "option2Name": "ffm79",
    "option2Key": "ffm79",
    "option3Name": "ffm10+",
    "option3Key": "ffm10+",
    "key": "ffm",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "That was not very effective.\n\nIn fact, the mimic seems to be even more angry than it was before. You didn't think that it had much of a way to move, but it's now bouncing at you very quickly.\n\nYou're going to have to roll Dexterity to dodge it.\n",
    "option1Name": "Roll!",
    "option1Key": "dodgeMimic6-",
    "option2Name": "dodgeMimic79",
    "option2Key": "dodgeMimic79",
    "option3Name": "dodgeMimic10+",
    "option3Key": "dodgeMimic10+",
    "key": "wfm6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "For a brief moment there is a sparkling sheen over the mimic. It's attitude suddenly changes from a murderous monstrosity to... well... of an overeager puppy.\n\nIt starts bouncing back and forth and it's tongue is hanging out and panting. It's also bouncing toward you very quickly.\n",
    "option1Name": "Continue",
    "option1Key": "wfm792",
    "key": "wfm79"
  },
  {
    "text": "The beast, goes still after you cast the spell. It is looking at you expectantly.\n\nCautiously you tell it to open up, and it obeys your command.\n\nInside is a bottle full of red liquid. It can only be a healing potion. There isn't a cork on it, so you can't really carry it around, but drinking it now could be helpful.\n",
    "option1Name": "Why not?",
    "option1Key": "drinkpotion",
    "key": "wfm10+"
  },
  {
    "text": "You have to pinch your nose to get it down, but you manage to swallow most of the rest liquid. The taste is awful, like moldy turpentine. However, you feel really refreshed after drinking it.\n\nYou recover all of your hit points.\n",
    "option1Name": "Continue",
    "option1Key": "toshelvesornottoshelves",
    "key": "drinkpotion",
    "action": "restoreHP"
  },
  {
    "text": "[[noshelves]]",
    "option1Name": "noshelves",
    "option1Key": "noshelves",
    "option2Name": "tsonts2",
    "option2Key": "tsonts2",
    "key": "toshelvesornottoshelves",
    "action": "checkHistory",
    "attribute": "shelves1"
  },
  {
    "text": "With nothing else left for you in the is room, you move on.\n",
    "option1Name": "Continue",
    "option1Key": "exitroom",
    "key": "noshelves"
  },
  {
    "text": "Would you like to go through the shelves before you leave the room?\n",
    "option1Name": "Yes",
    "option1Key": "shelves1",
    "option2Name": "No",
    "option2Key": "exitroom",
    "key": "tsonts2"
  },
  {
    "text": "You quickly realize that this thing is going to jump on you and probably crush you. With some quick thinking, you run out of the room and slam the door shut behind you. \n",
    "option1Name": "Continue",
    "option1Key": "exitroom",
    "key": "wfm792"
  },
  {
    "text": "You jump to the side, but not quickly enough. You feel a sharp pain as the mimic bites down on your leg. You try to pull away, but it's very strong. The pain is making it impossible to concentrate on any spells.\n\nYou feel it's talon like hands grab you, and hold you as it devours you.\n\nWould you like to play again?",
    "option1Name": "Yes",
    "option1Key": "end",
    "key": "dodgeMimic6-"
  },
  {
    "text": "You get out of the way just in time. It misses you with it's mouth, but it gets you with a claw as you dive out the door and slam it shut. You lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "exitroom",
    "key": "dodgeMimic79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "Fantastic! You evoke the image of a Matador with a giant anthropomorphic treasure chest instead of a bull. With a twirl and a dodge you get out of the way just as the mimic rams into the wall.\n\nWith it momentarily stunned, you take the opportunity to walk out of the room and close the door.\n",
    "option1Name": "Continue",
    "option1Key": "exitroom",
    "key": "dodgeMimic10+"
  },
  {
    "text": "You swing at it, but the sword just kind of glances off the mimic. That really didn't seem to do much.\n\nHowever,, the mimic seems to be even more angry than it was before. You didn't think that it had much of a way to move, but it's now bouncing at you very quickly.\n\nYou're going to have to roll Dexterity to dodge it.\n",
    "option1Name": "Roll!",
    "option1Key": "dodgeMimic6-",
    "option2Name": "dodgeMimic79",
    "option2Key": "dodgeMimic79",
    "option3Name": "dodgeMimic10+",
    "option3Key": "dodgeMimic10+",
    "key": "ffm6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "The mimic sits in front of you opening and closing it's mouth. You wait for the right moment, and swing right at the fleshy bits on the inside.\n\nOr at least that's what you try to do. But your timing is off. Your sword hits it in the wood side, which must have been a weak point as the chest itself shatters. You kill the beast.\n",
    "option1Name": "Continue",
    "option1Key": "ffm792",
    "key": "ffm79"
  },
  {
    "text": "The mimic sits in front of you opening and closing it's mouth. You wait for the right moment, and stab it right in the fleshy bits on the inside.\n\nIt lets out a terrible squeal, then goes still. \n\nYou prod it a couple of times with your sword, but it seems dead.\n",
    "option1Name": "Continue",
    "option1Key": "ffm102",
    "key": "ffm10+"
  },
  {
    "text": "Cautiously you open it up.\n\nInside is a bottle full of red liquid. It can only be a healing potion. There isn't a cork on it, so you can't really carry it around, but drinking it now could be helpful.\n",
    "option1Name": "Why not?",
    "option1Key": "drinkpotion",
    "key": "ffm102"
  },
  {
    "text": "In the shattered remains, you see some red liquid pooling around. It looks like there was a health potion inside. It's gone now.\n\nNo sense in crying over spilt potions.\n",
    "option1Name": "Continue",
    "option1Key": "toshelvesornottoshelves",
    "key": "ffm792"
  },
  {
    "text": "After walking through a twisty maze of corridors, You walk into a large chamber that was once some sort of ceremonial room. There is a dias on the far end of the room with a crumbling stone alter on it. \n\nThere are some faded murals on the wall depicting the ancient god Yhtia.\n",
    "option1Name": "Continue",
    "option1Key": "penult2",
    "key": "penult1",
    "action": "clear"
  },
  {
    "text": "This room is surprisingly well illuminated. There are several torches in holders around the room that are lit. You get the feeling that this room is used frequently. \n\nThere is a door on the right side close to the dais that you suspect leads to somewhere important. There are torches right by that door making it seem more well used. Also, the animated skeletal guardians are a bit of a dead giveaway.\n",
    "option1Name": "I see what you did there.",
    "option1Key": "penult3",
    "key": "penult2"
  },
  {
    "text": "Heh, dead giveaway, skeletons, I'm so funny.\n\nAnyway, you figure that you're pretty close to the necromancer. Not many other people would use the living dead to guard a door. You just need to figure out a way past the skeletons. There are 3 of them, and only one of you. They don't look very friendly. \n\nAlthough, the lack of any sort of facial muscles makes it difficult for skeletons to give any expressions at all, so who's to say if they're friendly or not?\n",
    "option1Name": "Continue",
    "option1Key": "penult4",
    "key": "penult3"
  },
  {
    "text": "Because you've been cautious in how you entered the room, you still have the opportunity to sneak up on the skeletons. Do you want to try sneaking up on them, or do you want to go for the direct approach?\n",
    "option1Name": "Yes, sneaky sneaky.",
    "option1Key": "sneakSkele",
    "option2Name": "Sneaking is for cowards.",
    "option2Key": "directSkele",
    "key": "penult4"
  },
  {
    "text": "Okay, you want to sneak up on them. That's probably a good idea. \n\nLet's roll Dexterity to see how sneaky you are.\n",
    "option1Name": "Roll",
    "option1Key": "sneakSkele6-",
    "option2Name": "sneakSkele79",
    "option2Key": "sneakSkele79",
    "option3Name": "sneakSkele10+",
    "option3Key": "sneakSkele10+",
    "key": "sneakSkele",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "You boldly walk up to the Skeletons with purpose.\n\nThey turn their heads and watch you with their lifeless eyes as you approach. When you get near, they each draw a sword and get ready to attack you.\n",
    "option1Name": "Continue",
    "option1Key": "skeleClassSplit",
    "key": "directSkele"
  },
  {
    "text": "You are not sneaky at all. You tripped over your own feet just walking into the room, and you crashed into some of the decaying pews in the chamber making a huge racket.\n\nYou spring back up like you meant to do that. Of course you now have their attention.\n",
    "option1Name": "Continue",
    "option1Key": "directSkele",
    "key": "sneakSkele6-"
  },
  {
    "text": "As you are sneaking through you accidentally stumble a bit making some noise. One of the skeletons looks your direction, and starts searching the room. You could probably continue to hide until it's done, but that will delay you a bit. What would you rather do?\n",
    "option1Name": "Wait and hide.",
    "option1Key": "sneakSkeleDoom",
    "option2Name": "Forget sneaking and attack.",
    "option2Key": "directSkele",
    "key": "sneakSkele79"
  },
  {
    "text": "You are stealthy like a ninja!\n\nMoving around this room without being seen is super easy for you. The skeletons might as well not even be animated bones they are so unaware of you.\n",
    "option1Name": "Continue",
    "option1Key": "sneakSkeleSuccess",
    "key": "sneakSkele10+"
  },
  {
    "text": "You duck into a nice little hidey spot between two of the pews. You have to hide out for about twenty minutes while the skeletons are on high alert.\n\nYour back starts to cramp up from laying there so long. You also hear some strange noises coming from the room behind the far door. You really wonder what's going on in there.\n",
    "option1Name": "Continue",
    "option1Key": "sneakSkeleSuccess",
    "key": "sneakSkeleDoom",
    "action": "doom",
    "amount": "2"
  },
  {
    "text": "Awesome, you snuck up on the skeletons. Because you have the advantage of them not knowing that you are there, you get +1 forward to use on your next die roll.\n",
    "option1Name": "Continue",
    "option1Key": "skeleClassSplit",
    "key": "sneakSkeleSuccess",
    "action": "+1Forward"
  },
  {
    "text": "[[skeleWiz]]",
    "option1Name": "skeleWiz",
    "option1Key": "skeleWiz",
    "option2Name": "skeleFight",
    "option2Key": "skeleFight",
    "key": "skeleClassSplit",
    "action": "checkClass"
  },
  {
    "text": "Weighing your options, it seems like the best option is to use Scorching Ray on these. It will send a direct ray out of each of your hands allowing you to potentially take down two of the Skeletons at once.\n\nRoll Intelligence.",
    "option1Name": "Roll!",
    "option1Key": "skelWiz6-",
    "option2Name": "skelWiz79",
    "option2Key": "skelWiz79",
    "option3Name": "skelWiz10+",
    "option3Key": "skelWiz10+",
    "key": "skeleWiz",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "It's a bit of a repetative action, but when the only weapon you have is a sword, all problems look like a sword holder.\n\nYou leap at Skeletons with your sword swinging.",
    "option1Name": "Roll",
    "option1Key": "skeleFight6-",
    "option2Name": "skeleFight79",
    "option2Key": "skeleFight79",
    "option3Name": "skeleFight10+",
    "option3Key": "skeleFight10+",
    "key": "skeleFight",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "It's been a really long day. You're pretty tired, so it's understandable that when you try casting such a complicated spell, that you kind of lose control of it. Or actualy, over yourself.\n\nYour hands start spewing forth burning hot rays of light. But you sort of go limp from the expenditure of power. Your arms are like firehoses with no one holding on. Scorching Rays go everywhere in the room. Through sheer luck, you manage to kill one of the Skeletons. You also manage to hit yourself with one doing @X points of damage.\n",
    "option1Name": "Continue",
    "option1Key": "2skeletonsleft",
    "key": "skelWiz6-",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "The Scorching ray shoot out of your dominant hand is really effecting at turning a skeleton to ash. The one coming from your other hand is also effective at turning things to ash, but you're not effective at aiming with two hands at once. So that ray turns some of the pews and part of the alter to ash instead.\n",
    "option1Name": "Continue",
    "option1Key": "2skeletonsleft",
    "key": "skelWiz79"
  },
  {
    "text": "You hold your hands out and blast two of the skeletons with blinding rays that are hot\n    like\n\t   something\n\t      really\n\t\t     really hot. The skeletons blow away in a cloud of ash.\n",
    "option1Name": "Cool!",
    "option1Key": "1skeletonleft",
    "key": "skelWiz10+"
  },
  {
    "text": "Since you're done in here, we'll move on.",
    "option1Name": "Continue",
    "option1Key": "exitroom",
    "key": "doneshelves"
  },
  {
    "text": "The two Skeletons that remain move in to attack you. You better dodge.\n",
    "option1Name": "Roll Dexterity",
    "option1Key": "dodge2skel6-",
    "option2Name": "dodge2skel79",
    "option2Key": "dodge2skel79",
    "option3Name": "dodge2skel10+",
    "option3Key": "dodge2skel10+",
    "key": "2skeletonsleft",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "Seeing it's comrades gone, the one remaining skeleton decides to flee and warn it's master that you are coming.\n\nRoll Dexterity to see if you can stop it.",
    "option1Name": "Roll",
    "option1Key": "stopskele6-",
    "option2Name": "stopskele79",
    "option2Key": "stopskele79",
    "option3Name": "stopskele10+",
    "option3Key": "stopskele10+",
    "key": "1skeletonleft",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "For being piles of animated bones, these things are remarkably nimble. You sprang forth with a mighty swing hoping to take all three of these skeletons out, but they simply jumped backwards out of the way. Angrily you pressed on to the one on the left. You manage to get your sword stuck in its skull. That one collapeses to the ground, but the effort left you exposed. You lose @X Hit Points as one of the others hits you from behind.\n",
    "option1Name": "Continue",
    "option1Key": "2skeletonsleft",
    "key": "skeleFight6-",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You're smart enough not to put yourself right into the middle of the fray. You go to the right of the group, and swing low. You take out the leg of the one on that side. It's having difficulty remaining upright with only one leg. You help it to the ground by following up with a might strike to the skull.\n\nIt clatters to the ground.",
    "option1Name": "Continue",
    "option1Key": "2skeletonsleft",
    "key": "skeleFight79"
  },
  {
    "text": "You move like the wind. First you strike at the one on the right with a precision blow to its spine causing it to collapse to the ground. Then you bounce back with a mighty downward swing cleaving the skull of the middle one in half. It also crumbles into a pile of bones.",
    "option1Name": "Continue",
    "option1Key": "1skeletonleft",
    "key": "skeleFight10+"
  },
  {
    "text": "You feel the point ends of their swords. They're pretty old and rusty looking swords. If you survive this, you might want to go get a tetanus shot.\n\nYou lose @X Hit Points.",
    "option1Name": "Continue",
    "option1Key": "attack2skel",
    "key": "dodge2skel6-",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "Both Skeletons swing at you at the same time. You manage to dodge one of them with no problems. The fact that you are outnumbered works against you though. The other managed to inflict a minor flesh wound. You lose @X Hit Points.",
    "option1Name": "Continue",
    "option1Key": "attack2skel",
    "key": "dodge2skel79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "The two Skeletons come in swinging their big rusty swords. You easily step out of the way of the two attacks. The skeletons may be big, but they're are very predictable in their strategy.",
    "option1Name": "Continue",
    "option1Key": "attack2skel",
    "key": "dodge2skel10+"
  },
  {
    "text": "[[a2sWiz]]",
    "option1Name": "a2sWiz",
    "option1Key": "a2sWiz",
    "option2Name": "a2sFight",
    "option2Key": "a2sFight",
    "key": "attack2skel",
    "action": "checkClass"
  },
  {
    "text": "In the middle of the fight you don't really have time to prepare any sort of complex spell. You settle for a simple blast of pure magic. It's inelegant, but it often gets the job done.",
    "option1Name": "Roll Intelligence",
    "option1Key": "a2sWiz6-",
    "option2Name": "a2sWiz79",
    "option2Key": "a2sWiz79",
    "option3Name": "a2sWiz10+",
    "option3Key": "a2sWiz10+",
    "key": "a2sWiz",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You keep on hacking and slashing at the Skeletons.\nYou know what that means.",
    "option1Name": "Roll Strength",
    "option1Key": "a2sFight6-",
    "option2Name": "a2sFight79",
    "option2Key": "a2sFight79",
    "option3Name": "a2sFight10+",
    "option3Key": "a2sFight10+",
    "key": "a2sFight",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "You dance and parry with the Skeletons waiting for the right moment. When the opportunity to single one out presents itself you attack.\n\nYou realize that you are too close to make a normal sword swinging attack. You decide the next best option is to headbutt it.\n\nYou have a very thick skull and you smash it. It also had a very thick skull. Your head hurts, and you lose @X hit points.",
    "option1Name": "Continue",
    "option1Key": "1skeletonleft",
    "key": "a2sFight6-",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You dance and parry with the Skeletons waiting for the right moment. When the opportunity to single one out presents it's self you attack.\n\nYour attack, and manage to take one out. But you overextend yourself leaving yourself open for retaliation.",
    "option1Name": "Continue",
    "option1Key": "1skeletonleft",
    "key": "a2sFight79"
  },
  {
    "text": "You dance and parry with the Skeletons waiting for the right moment. When the opportunity to single one out presents it's self you attack.\n\nWith a mighty blow you smash another of the skeletons to tiny bits.\n\nThe other one seems a little taken aback with your mighty attack. Take +1 forward.",
    "option1Name": "Continue",
    "option1Key": "1skeletonleft",
    "key": "a2sFight10+",
    "action": "+1Forward"
  },
  {
    "text": "You get back away from the Skeleton's swords and wait for the right moment. When one gets close enough you hit it with the blast.\n\nUnfortunately, this is a very short ranged attack. You blast the skeleton apart, but the pieces go everywhere and you lose @X hit points from the shrapnel.",
    "option1Name": "Continue",
    "option1Key": "1skeletonleft",
    "key": "a2sWiz6-",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You get back away from the Skeleton's swords and wait for the right moment. When one gets close enough you hit it with the blast.\n\nYou manage to take out that skeleton, but the concentration made you lose track of the other one leaving you exposed to an attack.",
    "option1Name": "Continue",
    "option1Key": "1skeletonleft",
    "key": "a2sWiz79"
  },
  {
    "text": "You get back away from the Skeleton's swords and wait for the right moment. When one gets close enough you hit it with the blast.\n\nIt shatters into 1000 pieces. The other one is somewhat taken aback. You get +1 Forward.\n",
    "option1Name": "Continue",
    "option1Key": "1skeletonleft",
    "key": "a2sWiz10+",
    "action": "+1Forward"
  },
  {
    "text": "You reach out a hand, and grab thin air just as the skeleton ducks back into the doorway that it was guarding.\n\nYou have a pretty bad feeling about that.\n",
    "option1Name": "Continue",
    "option1Key": "penultDone",
    "key": "stopskele6-",
    "action": "doom",
    "amount": "3"
  },
  {
    "text": "You reach out and grab the Skeleton by the neck just as it starts to escape. Unfortunately, it's not as well held together as you thought. The head falls off and rolls into the now slightly ajar door that it was guarding.\n\nThe magic that was animating it dissipates, but having a skull roll into your lair is a dead giveaway that something is up.\n",
    "option1Name": "Continue",
    "option1Key": "penultDone",
    "key": "stopskele79",
    "action": "doom",
    "amount": "2"
  },
  {
    "text": "Just as the Skeleton tries to get away, you grab it and forcibly throw it back into the room with you. It crashes into the alter and crumbles to pieces.\n",
    "option1Name": "Continue",
    "option1Key": "penultDone",
    "key": "stopskele10+"
  },
  {
    "text": "Okay, This is it. You're about to enter the lair of a powerful necromancer who wants to overrun the town with a hoard of zombies.\n\nAre you ready?",
    "option1Name": "Yes!",
    "option1Key": "yesReady",
    "option2Name": "No..",
    "option2Key": "noReady",
    "key": "penultDone"
  },
  {
    "text": "That's the spirit! You've come so far, now the time of yoru victory is at hand. You just need to open that door and take on whatever you find in there.\n",
    "option1Name": "Open the Door",
    "option1Key": "lastSceneChooser",
    "key": "yesReady"
  },
  {
    "text": "You're not?\nBut we've come all this way.\nWhat more do you want to do?\n\nWell, you know what? You're going in anyway. Live with it.",
    "option1Name": "Open the door",
    "option1Key": "lastSceneChooser",
    "key": "noReady"
  },
  {
    "text": "[[ending1]]",
    "option1Name": "ending1",
    "option1Key": "ending1",
    "option2Name": "lastSceneChooser2",
    "option2Key": "lastSceneChooser2",
    "key": "lastSceneChooser",
    "action": "checkDoom",
    "amount": "2"
  },
  {
    "text": "You open the door and walk into the room. You find a moderately sized room that has been turned into a workshop. It has all the accoutrements that you would expect in a Necromancer's lab. Miscellaneous skeleton parts piled in a corner, an assortment of vials on shelves full of liquids of all sorts of different colors, a handful of exhumed coffins line one wall.\n",
    "option1Name": "Continue",
    "option1Key": "meetKevin",
    "key": "ending1",
    "action": "clear"
  },
  {
    "text": "[[ending2]]",
    "option1Name": "ending2",
    "option1Key": "ending2",
    "option2Name": "ending3",
    "option2Key": "ending3",
    "key": "lastSceneChooser2",
    "action": "checkDoom",
    "amount": "6"
  },
  {
    "text": "You ended in ending 2, which isn't written yet.",
    "option1Name": "Go to Ending 1",
    "option1Key": "ending1",
    "key": "ending2",
    "action": "clear"
  },
  {
    "text": "You ended in ending 3, which isn't written yet.",
    "option1Name": "Go to Ending 1",
    "option1Key": "ending1",
    "key": "ending3",
    "action": "clear"
  },
  {
    "text": "Standing in the middle of the room is a guy who looks like a retired school teacher. His hairline goes back far enough that anyone respectable would just shave the rest off. The lines in his face make him look older than he probably actually is.\n\nIt seems that you've interrupted him in the middle of some sort of ritual involving a necklace that is on the table in front of him.\n\nWhat do you want to do?",
    "option1Name": "Say Hi.",
    "option1Key": "talkToKevin",
    "option2Name": "Attack",
    "option2Key": "justAttack",
    "key": "meetKevin"
  },
  {
    "text": "Yes, talking to him is probably a reasonable start.\n",
    "option1Name": "\"Who are are?\"",
    "option1Key": "TTK2",
    "key": "talkToKevin"
  },
  {
    "text": "Really?\nYou don't want to know what he's up to?\nIt could be important.",
    "option1Name": "Okay, I'll talk to him",
    "option1Key": "talkToKevin",
    "option2Name": "I see Necromancer, I fight Necromancer",
    "option2Key": "reallyAttack",
    "key": "justAttack"
  },
  {
    "text": "Okay, you might have been able to solve all of this without violence, but I guess we'll do it your way. You won't even get the chance to find out that his name is Kevin.\n",
    "option1Name": "Darn Right!",
    "option1Key": "fightKevin",
    "key": "reallyAttack"
  },
  {
    "text": "[[aKJAlive]]",
    "option1Name": "aKJAlive",
    "option1Key": "aKJAlive",
    "option2Name": "aKJDead",
    "option2Key": "aKJDead",
    "key": "askKevinJimmy",
    "action": "checkHistory",
    "attribute": "cocoFoodalive"
  },
  {
    "text": "\"I'm glad you asked. I've been dying to tell someone all of my nefarious plans.\"\n\nHe continues, \"Soon, this necklace will become my Phylactery as I obtain awesome power as a LICH!\"\n",
    "option1Name": "That's really interesting, tell me more",
    "option1Key": "kevinLichTalk",
    "option2Name": "Talk about something else",
    "option2Key": "TTK2List",
    "key": "KevinUpto"
  },
  {
    "text": "Kevin replies \"It's quiet, I don't have nosey neighbors and the rent is cheap. You're the first uninvited guest I've had.\" With that he gives you the stink eye.\n",
    "option1Name": "Continue",
    "option1Key": "TTK2List",
    "key": "kevinDungeon"
  },
  {
    "text": "\"I'm Kevin, lord of the undead and arbiter of the apocalypse!\" He says while looking a bit perturbed that you are here. What do you say to him?\n",
    "option1Name": "Ask about Jimmy",
    "option1Key": "askKevinJimmy",
    "option2Name": "Whatchya up to?",
    "option2Key": "KevinUpto",
    "option3Name": "Nice place you've got here.",
    "option3Key": "kevinDungeon",
    "key": "TTK2"
  },
  {
    "text": "What else do you want to say?\n",
    "option1Name": "Ask about Jimmy",
    "option1Key": "askKevinJimmy",
    "option2Name": "Whatchya up to?",
    "option2Key": "KevinUpto",
    "option3Name": "Nice place you've got here.",
    "option3Key": "kevinDungeon",
    "option4Name": "Done talking, time to fight",
    "option4Key": "fightKevin",
    "key": "TTK2List",
    "persistant": true
  },
  {
    "text": "[[fightKevinWiz]]",
    "option1Name": "fightKevinWiz",
    "option1Key": "fightKevinWiz",
    "option2Name": "fightKevinFight",
    "option2Key": "fightKevinFight",
    "key": "fightKevin",
    "action": "checkClass"
  },
  {
    "text": "You say \"I talked to Jimmy, it seems you left him for dead. That was kind of jerk move.\"\n\nKevin looks at you. \"That kid was useless. Just a wanna be Goth kid, he had no  business with a real necromancer.\"\n",
    "option1Name": "Continue",
    "option1Key": "TTK2List",
    "key": "aKJAlive"
  },
  {
    "text": "You say \"I found Jimmy's corpse. I imagine that you are responsible for that.\"\n\nKevin looks at you. \"That kid was useless. He kept making mistakes so I rid myself of him.\"\n",
    "option1Name": "Continue",
    "option1Key": "TTK2List",
    "key": "aKJDead"
  },
  {
    "text": "He seems genuinely over eager to talk to someone about his hobbies.\n\n\"Well, right now I'm just preparing this necklace as a vessel. Once complete, I will transfer my soul into it via a ritual, and then I will be immortal. No longer will I fear the cold grip of death.\"\n",
    "option1Name": "Talk about something else",
    "option1Key": "TTK2List",
    "option2Name": "Try to talk him out of it",
    "option2Key": "|talkKevinOutofit",
    "key": "kevinLichTalk"
  },
  {
    "text": "Okay, so you want to talk him out of turning himself into a lich.\n\nGo ahead an roll your Charisma for me.",
    "option1Name": "Roll",
    "option1Key": "tkooi6-",
    "option2Name": "tk00i79",
    "option2Key": "tk00i79",
    "option3Name": "tkooi10+",
    "option3Key": "tkooi10+",
    "key": "talkKevinOutofit",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "\"Have you considered that being a lich would make every adventurer in the area come hunt you?\" You ask.\n\n\"Yes, and I have a plan for those adventurers, including you.\"\n",
    "option1Name": "Well crap.",
    "option1Key": "fightKevin",
    "key": "tkooi6-"
  },
  {
    "text": "\"You know, I heard lichdom is bad for your health.\" You say to Kevin.\n\n\"Yeah, that's part of the whole being undead forever thing.\" Kevin replies. \n\nWell that didn't work.\n",
    "option1Name": "Talk about something else.",
    "option1Key": "TTK2List",
    "key": "tk00i79"
  },
  {
    "text": "You say \"Well, you know, my uncle Lawrence on my mother's side was a lich.\" \n\"Smelled awful at family reunions.\"\n\"He said that if he could take it back he would. It seems that outliving everyone that he loved just wasn't all that it was cracked up to be. Plus, you know, the flesh decays, and eventually he was suffering from some pretty bad back pain. He eventually dispelled his own phylactery just to end it all.\"\n",
    "option1Name": "Continue",
    "option1Key": "tkooiBest2",
    "key": "tkooi10+"
  },
  {
    "text": "\"Really?\" Kevin asks?\n\nIt seems to be working. Roll Charisma again to keep trying to talk him out of it.\n",
    "option1Name": "Roll",
    "option1Key": "tkooiBest6-",
    "option2Name": "tkooiBest6-",
    "option2Key": "tkooiBest6-",
    "option3Name": "tkooiBest10+",
    "option3Key": "tkooiBest10+",
    "key": "tkooiBest2",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "\"Yeah,\" you say. \"I still keep uncle Willy's Phyla...\"\n\n\"Wait a minute!\" Kevin interrupts you. \"You said his name was Lawrence!\"\n",
    "option1Name": "Oops!",
    "option1Key": "caughtinweboflies",
    "key": "tkooiBest6-"
  },
  {
    "text": "[[tkooiBest10Bottle]]",
    "option1Name": "tkooiBest10Bottle",
    "option1Key": "tkooiBest10Bottle",
    "option2Name": "tkooiBest10NoBottle",
    "option2Key": "tkooiBest10NoBottle",
    "key": "tkooiBest10+",
    "action": "checkAttribute",
    "attribute": "HasVial"
  },
  {
    "text": "\"Yeah!\" You say. \"I still carry his Phylactery around to remember him by.\"\n\nYou reach into your pocket and pull out the vial with the green liquid in it. \n",
    "option1Name": "Continue",
    "option1Key": "tkooiBest10Bottle2",
    "key": "tkooiBest10Bottle"
  },
  {
    "text": "[[tkooiBest10Coin]]",
    "option1Name": "tkooiBest10Coin",
    "option1Key": "tkooiBest10Coin",
    "option2Name": "tkooiBest10NoCoin",
    "option2Key": "tkooiBest10NoCoin",
    "key": "tkooiBest10NoBottle",
    "action": "checkAttribute",
    "attribute": "Cursed-Coin"
  },
  {
    "text": "Kevin looks at you a bit slack jawed.\n\n\"Wow, that's quite the story.\" \n\"I guess maybe I should rethink this.\"",
    "option1Name": "Continue",
    "option1Key": "talkedhimoutofit",
    "key": "tkooiBest10Bottle2"
  },
  {
    "text": "You put your arm around Kevin and guide him out of his lair.\n\nYou take him back to the village and you help him find a more productive use for his talents and time.\n",
    "option1Name": "Continue",
    "option1Key": "jimmyEnding",
    "key": "talkedhimoutofit"
  },
  {
    "text": "[[endingJimmyAlive]]",
    "option1Name": "endingJimmyAlive",
    "option1Key": "endingJimmyAlive",
    "option2Name": "endingJimmyDead",
    "option2Key": "endingJimmyDead",
    "key": "jimmyEnding",
    "action": "checkHistory",
    "attribute": "cocoFoodalive"
  },
  {
    "text": "You also got Jimmy home safely to his Mom. He has definitely learned his lesson that Necromancers are not nice people. He turns his life around and eventually enters the priesthood where he can serve life.\n\nCongratulations! You have reached the end of the adventure. Look for more Interactive Fiction games by Radical Bomb Games.\n",
    "option1Name": "Play again?",
    "option1Key": "end",
    "key": "endingJimmyAlive"
  },
  {
    "text": "You also find Jimmy's mom, and tell her the unfortunate news of his fate. There is a lot of crying. You send flowers to the funeral because you are a good person.\n\nYou have reached the end of the adventure. Look for more Interactive Fiction games by Radical Bomb Games.\n",
    "option1Name": "Play again?",
    "option1Key": "end",
    "key": "endingJimmyDead"
  },
  {
    "text": "\"Yeah!\" You say. \"I still carry his Phylactery around to remember him by.\"\n\nYou reach into your pocket and pull out the coin that you got from the guy in the bar that you tried to kill with Power Word Death.\n",
    "option1Name": "Continue",
    "option1Key": "tkooiBest10Coin2",
    "key": "tkooiBest10Coin"
  },
  {
    "text": "[[tkooiBest10dagger]]",
    "option1Name": "tkooiBest10dagger",
    "option1Key": "tkooiBest10dagger",
    "option2Name": "tkooiBest10Nothing",
    "option2Key": "tkooiBest10Nothing",
    "key": "tkooiBest10NoCoin",
    "action": "checkAttribute",
    "attribute": "Enchanted-Dagger"
  },
  {
    "text": "Kevin looks at you a bit slack jawed as he recognizes the power emanating from the coin.\n\n\"Wow, that's quite the story.\" \n\"I guess maybe I should rethink this.\"",
    "option1Name": "Continue",
    "option1Key": "talkedhimoutofit",
    "key": "tkooiBest10Coin2"
  },
  {
    "text": "\"Yeah!\" You say. \"I still carry his Phylactery around to remember him by.\"\n\nYou reach into your pocket and pull out the Enchanted Dagger that you found earlier.\n",
    "option1Name": "Continue",
    "option1Key": "tkooiBest10Dagger2",
    "key": "tkooiBest10dagger"
  },
  {
    "text": "\"Yeah!\" You say. \"I keep his Phylactery on a shelf above my fireplace to remember him by.\n",
    "option1Name": "Continue",
    "option1Key": "tkooiBest10nothing2",
    "key": "tkooiBest10Nothing"
  },
  {
    "text": "Kevin looks at you a bit slack jawed as he recognizes the power emanating from the dagger.\n\n\"Wow, that's quite the story.\" \n\"I guess maybe I should rethink this.\"",
    "option1Name": "Continue",
    "option1Key": "talkedhimoutofit",
    "key": "tkooiBest10Dagger2"
  },
  {
    "text": "Kevin looks at you a bit slack jawed.\n\n\"Wow, that's quite the story.\" \n\"I guess maybe I should rethink this.\"",
    "option1Name": "Continue",
    "option1Key": "talkedhimoutofit",
    "key": "tkooiBest10nothing2"
  },
  {
    "text": "You quickly try to cover. \"Yeah, my uncle Willy on my Father's side was also a li...\"\n\nYou can see that Kevin isn't buying it.\n",
    "option1Name": "Nevermind, I'll just fight him",
    "option1Key": "fightKevin",
    "key": "caughtinweboflies"
  },
  {
    "text": "Alright, here it is, the battle of the year. Wizard vs Necromancer.\n\nThe tension in the room is thick as you stare each other down.\n\nHe starts chanting to cast something. You try to cast Dispell Magic. ",
    "option1Name": "Roll Intelligence",
    "option1Key": "dispell6-",
    "option2Name": "dispell79",
    "option2Key": "dispell79",
    "option3Name": "dispell10+",
    "option3Key": "dispell10+",
    "key": "fightKevinWiz",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Double-click this passage to edit it.",
    "key": "fightKevinFight"
  },
  {
    "text": "Before you are able to get the Dispell cast, Kevin's hand points at you and he casts Ray of Enfeeblement. A coruscating ray of energy shoots out and hits you.\n\nRoll Constitution to save",
    "option1Name": "Roll",
    "option1Key": "enfeeblement6-",
    "option2Name": "enfeeblement79",
    "option2Key": "enfeeblement79",
    "option3Name": "enfeeeblement10+",
    "option3Key": "enfeeeblement10+",
    "key": "dispell6-",
    "moveTriggered": true,
    "moveStat": "Constitution"
  },
  {
    "text": "You don't quite get the dispell cast in time, Kevin's hand points at you and he casts Ray of Enfeeblement. A coruscating ray of energy shoots out and hits you.\n\nLuckily, your dispell is cast moments after he hits you with the ray and you are able to end it prematurely. The ray made you feel a bit tired is all.\n",
    "option1Name": "Continue",
    "option1Key": "fkcast",
    "key": "dispell79"
  },
  {
    "text": "You manage to dispell his spell before he is able to even get it cast. He must not have been in many wizard battle before as he seems a bit dumbstruck. You get +1 Foward to casting a spell.\n",
    "option1Name": "Continue",
    "option1Key": "fkcast",
    "key": "dispell10+",
    "action": "+1Forward"
  },
  {
    "text": "Now it's your turn to cast something. Since this guy has been sitting in a dark underground lair for possibly quite some time, you decide that hitting him with a sunbeam will be quite effective.\n",
    "option1Name": "Roll Intelligence",
    "option1Key": "sunbeam6-",
    "option2Name": "sunbeam79",
    "option2Key": "sunbeam79",
    "option3Name": "sunbeam10+",
    "option3Key": "sunbeam10+",
    "key": "fkcast",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "The ray saps your energy, and you fall to the ground. You manage to hit your head on the corder of a table on your way down, and you lose @X hit points.\n",
    "option1Name": "Continue",
    "option1Key": "enfeebled",
    "key": "enfeeblement6-",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "You feel yourself weaken a bit, but you manage to stay upright. You take -1 forward to your next roll.\n",
    "option1Name": "Continue",
    "option1Key": "fkcast",
    "key": "enfeeblement79",
    "action": "-1Forward"
  },
  {
    "text": "The spell has no effect on you.\n",
    "option1Name": "Continue",
    "option1Key": "fkcast",
    "key": "enfeeeblement10+"
  },
  {
    "text": "Kevin goes back to working on his ritual giving you little mind. You manage to climb back to your feet and retaliate.\n",
    "option1Name": "Continue",
    "option1Key": "fkcast",
    "key": "enfeebled"
  },
  {
    "text": "You try to bring a beam of sunlight into a underground temple that is hundreds of feet below ground. The attempt tears at the fabric of reality. You suddenly get a massive headache and fall to the ground. You lose @X Hit Points.\n",
    "option1Name": "Continue",
    "option1Key": "kevinNOTontheropes",
    "key": "sunbeam6-",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "A pillar of light engulfs Kevin. It seems to hurt him, but he quickly waves his hand and dissipates it.\n",
    "option1Name": "Continue",
    "option1Key": "kevinNOTontheropes",
    "key": "sunbeam79"
  },
  {
    "text": "A pillar of light engulfs Kevin. His fair skin starts to blister and burn. It smells a bit like Bacon.\n\nYou have him on the ropes now.\n",
    "option1Name": "Continue",
    "option1Key": "kevinontheropes",
    "key": "sunbeam10+"
  },
  {
    "text": "Double-click this passage to edit it.",
    "key": "kevinontheropes"
  },
  {
    "text": "Kevin is clearly annoyed with you now. He grabs a dagger from the table in front of him, and jumps on the table, then off it it to attack you.\n\nRoll Dexterity to dodge!",
    "option1Name": "Roll",
    "option1Key": "kevinhasaknife6-",
    "option2Name": "kevinhasaknife79",
    "option2Key": "kevinhasaknife79",
    "option3Name": "kevinhasaknife10+",
    "option3Key": "kevinhasaknife10+",
    "key": "kevinNOTontheropes",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "Double-click this passage to edit it.",
    "key": "kevinhasaknife6-"
  },
  {
    "text": "Double-click this passage to edit it.",
    "key": "kevinhasaknife79"
  },
  {
    "text": "As Kevin sails in the air at you, you step to the side and grab his wrist of the hand holding the dagger. Doing some fancy self defense type moves, you manage to flip him on the ground, take the knife from him, and put it to his neck.\n",
    "option1Name": "Finish Him",
    "option1Key": "killKevinDagger",
    "option2Name": "Spare Him",
    "option2Key": "spareKevin",
    "key": "kevinhasaknife10+"
  },
  {
    "text": "You use the dagger to slit Kevin's throat and put and end to all of this.\n\nThe first place you go when you get back to the village is to the Inn to get some rest. In the morning you find the town's guards and tell them the tale of your adventure and the crises that you helped the town avoid. You get a bit of a reward for your trouble.\n",
    "option1Name": "Continue",
    "option1Key": "jimmyEnding",
    "key": "killKevinDagger"
  },
  {
    "text": "With the dagger at his throat, Kevin is more inclined to see the error of his ways.\n\nYou take him back to the village and you help him find a more productive use for his talents and time.\n",
    "option1Name": "Continue",
    "option1Key": "jimmyEnding",
    "key": "spareKevin"
  }
]