[
  {
    "text": "This is Mines of Immortia, the first in a series of Interactive Fiction games that are Powered by the Apocalypse. This demo will take you through two scenes to give you a feel of what the final game will be like.\n\nYou can click the Menu button at any time to enter your email address and keep up with the final release of the game.\n\nAlso, if you would kindly use the menu to reset the demo before walking away that would be swell.\n",
    "option1Name": "Begin",
    "option1Key": "starthere2",
    "key": "starthere",
    "image": "MineEntrance"
  },
  {
    "text": "As you are sitting in a corner with a drink doing your best impression of Strider trying to scare off anyone who might even look at you. You notice that the guy at the table next to you is getting a little handsy with the wait staff. \n\nHow do you respond?\n",
    "option1Name": "Sword in hand, I stand up and look angry",
    "option1Key": "imafighter",
    "option2Name": "I use magic to knock him out of his seat",
    "option2Key": "imawizard",
    "option3Name": "I don't. It ain't my business",
    "option3Key": "ignorethejerk",
    "key": "sitincorner",
    "image": "HoodedFigure"
  },
  {
    "text": "Of course, you do, that's what makes you a fighter.\n\nYou step up to the guy sword in hand.\n\nWhat do you say?",
    "option1Name": "Take your stinking paws off her you damned dirty ape",
    "option1Key": "cheston",
    "option2Name": "Nothing. I just bash his head in.",
    "option2Key": "overaggressive",
    "option3Name": "Hey man, let's be cool man.",
    "option3Key": "superpassive",
    "key": "imafighter",
    "action": "imafighter"
  },
  {
    "text": "Of course, you do, you're a wizard and you like to take the subtle approach.\n\nWhat sort of spell do you want to use? Maybe just a little forceful hand to literally push him out of his chair? Maybe a fear spell so that he sees illusory monsters that are out to get him? Or, there's always Power Word Death.",
    "option1Name": "Forceful Hand",
    "option1Key": "farfightfh",
    "option2Name": "Fear",
    "option2Key": "farfightfear",
    "option3Name": "Power Word Death",
    "option3Key": "barfightpwdeath",
    "key": "imawizard",
    "action": "imawizard"
  },
  {
    "text": "Not saying anything makes you part of the problem. You don't want to be part of the problem, do you? \n\nHow do you really respond?\n",
    "option1Name": "Sword in hand, I stand up and look angry",
    "option1Key": "imafighter",
    "option2Name": "I use magic to knock him out of his seat",
    "option2Key": "imawizard",
    "option3Name": "No really, it's none of my business",
    "option3Key": "ignorethejerk2",
    "key": "ignorethejerk"
  },
  {
    "text": "Okay, look.\n\nIt's important for you to choose one of the other options for the game to go on. I'm trying to assign you a class here.",
    "option1Name": "Sword in hand, I stand up and look angry",
    "option1Key": "imafighter",
    "option2Name": "I use magic to knock him out of his seat",
    "option2Key": "imawizard",
    "key": "ignorethejerk2"
  },
  {
    "text": "The guy sneers at you and stands up. He has an unmistakable long scar going down one side of his face. You recognize him from a wanted poster that you've seen somewhere. His clothes are dirty and torn. They remind you of the bandits that you've seen in the area. \n\nHe looks at your sword and pulls his own out. \"I ain't no ape.\"\n\nHe steps in to attack.",
    "option1Name": "Roll",
    "option1Key": "fightinbar",
    "key": "cheston"
  },
  {
    "text": "You are amazed at how hard this guys head must be. You hit him with the broadside of your sword right on the side of the head. He fell out of his chair, and you figured that would have knocked him out cold, but he just stood up. It was a really satisfying hit too. It's not like you just tapped him. But now he's standing up, his own sword drawn, and he looks really angry.\n\nHe curses and steps in to attack.",
    "option1Name": "Roll!",
    "option1Key": "fightinbar",
    "key": "overaggressive"
  },
  {
    "text": "The guy sneers at you. He has an unmistakable long scar going down one side of his face. You recognize him from a wanted poster that you've seen somewhere. His clothes are dirty and torn. They remind you of the bandits that you've seen in the area. \n\n\"Mind yer own business.\"\n\nThe guy takes another drink of his mead, and when it's clear to him that you aren't going to let this go, he stands up and pulls his sword.\n\n\"Alright, if you want to make something of this, let's dance.\"",
    "option1Name": "Roll",
    "option1Key": "fightinbar",
    "key": "superpassive"
  },
  {
    "text": "In this game, you will occasionally do some sort of check that will involve rolling dice. You will always roll 2 standard six-sided dice, add them together, and add in a relevant ability score. In this case, that will be Intelligence, because you are casting a spell. \n\nIf you roll a 10 or better, then you will see the best possible outcome. \nOn a 7 - 9, you will usually get what you want, but there will be some sort of negative consequence. \nIf you roll a 6 or less, then something bad will happen.",
    "option1Name": "Continue",
    "option1Key": "fightinbar6-",
    "option2Name": "",
    "option2Key": "fightinbar79",
    "option3Name": "",
    "option3Key": "fightinbar10+",
    "key": "fightinbar",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "The handsy guy charges at you as he swings his sword. You try to sidestep, but you stumble over a chair and fall on your ass. The guy starts laughing at you. The waitress also starts laughing at you. \n\n\"He's my boyfriend,\" she says before taking the guy by the hand and leading him off to the sleeping rooms. \n\nYou get back in your seat and pull the hood of your cloak up to try to cover your shame. That really didn't go as expected. ",
    "option1Name": "Continue",
    "option1Key": "fellonass",
    "key": "fightinbar6-"
  },
  {
    "text": "The handsy guy charges at you as he swings his sword. Without thinking much, you just kind of stick your sword out in front of you and the guy impales himself on it. It really wasn't what you were expecting to happen. \n\nThe waitress screams and runs off. \n\nYou find yourself, just kind of standing there with a dead guy on your sword. There's a huge mess of blood growing at your feet.",
    "option1Name": "Continue",
    "option1Key": "deadguyonsword",
    "key": "fightinbar79"
  },
  {
    "text": "The handsy guy steps in as he swings his sword wildly. You easily deflect it with your sword, grab his wrist with your other hand, then pulling him forward and off balance, you hit him square in the temple with the pommel of your sword. He falls limply to the ground. \n\nThe waitress thanks you for intervening, then hurries off to take care of the other patrons. ",
    "option1Name": "Continue",
    "option1Key": "wonfightinbar",
    "key": "fightinbar10+"
  },
  {
    "text": "You feel a hand on your shoulder. When you turn to see who it is, you see the friendly round face of the barkeep. \n\n\"That one always was a bad egg. Thanks for standing up for my staff. Your drinks are on me tonight.\"\n\nThe barkeep heads off to pour you another round. You go back to your table and you notice a few of the other patrons of the tavern giving you appreciative nods. No one really seems to notice the pile of ruffian in the middle of the floor. In fact, after a few minutes, you seem to completely forget that he's there.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wonfightinbar"
  },
  {
    "text": "For the purposes of this demo, we are going to skip ahead a bit here. Next, you'll get to play through one of my favorite pieces of the game.\n",
    "option1Name": "Continue",
    "option1Key": "cockatrice",
    "key": "waitingforadventure"
  },
  {
    "text": "After a few moments of standing there a bit dumbstruck, the barkeep taps you on the shoulder to get your attention.\n\n\"I appreciate you wanting to stand up for my staff, but this isn't the sort of place where we take to murdering our customers... even if they are wanted.\" He says in a growling voice. \"Take the corpse outside, then go in the back and get a mop.\"",
    "option1Name": "Continue",
    "option1Key": "deadguyonsword2",
    "key": "deadguyonsword"
  },
  {
    "text": "You do as he said, and once there isn't a drop of blood left in the place, the barkeep brings you a hot meal on the house. \n\nWhen you're halfway through eating it, you notice the barkeep talking to a local guardsman who came in. You see the guardsman give the barkeep some gold, and you realize that the barkeep totally just took the reward for killing the wanted guy. You think about calling him out on it, but you decide against making yet another scene tonight. You go back to enjoying the free meal.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "deadguyonsword2"
  },
  {
    "text": "After a few minutes, the barkeep puts a mug of mead on your table.\n\n\"I appreciate the thought of standing up for my staff. Don't feel too bad lad, they're both leaving in the morning, and you'll never see them again. You're lucky that went the way it did, you could have gotten a lot more than your pride hurt.\"\n\nThe barkeep leaves, and you slowly start to feel better as you enjoy the mead.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "fellonass"
  },
  {
    "text": "That's a good choice. It's subtle, it'll embarrass him, and he'll never know that it came from you.",
    "option1Name": "Continue",
    "option1Key": "barfightfh2",
    "key": "farfightfh"
  },
  {
    "text": "Yes, this guy needs to be taught a lesson, and who better to do it than whatever terrors lurk in his own subconscious.",
    "option1Name": "Continue",
    "option1Key": "barfightfear2",
    "key": "farfightfear"
  },
  {
    "text": "Really? You know that will make him just drop dead on the spot right?\n\nSeems a little harsh for being a bit handsy.\n\nYeah, you're right. Down with the Patriarchy!",
    "option1Name": "Continue",
    "option1Key": "barfightpwdeath2",
    "key": "barfightpwdeath"
  },
  {
    "text": "In this game, you will occasionally do some sort of check that will involve rolling dice. You will always roll 2 standard six-sided dice, add them together, and add in a relevant ability score. In this case, that will be Intelligence, because you are casting a spell. \n\nIf you roll a 10 or better, then you will see the best possible outcome. \nOn a 7 - 9, you will usually get what you want, but there will be some sort of negative consequence. \nIf you roll a 6 or less, then something bad will happen.",
    "option1Name": "Roll",
    "option1Key": "barfight6-",
    "option2Name": "barfight79",
    "option2Key": "barfight79",
    "option3Name": "barfight10+",
    "option3Key": "barfight10+",
    "key": "barfightfh2",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Instead of pushing the guy over, you accidentally knock the waitress over. The handsy guy catches her on the way down saving for from hitting her head. She thanks him.\n\nYou decide that you should probably leave things alone. You watch the waitress slowly become more flirty with the guy as the night goes on. You know that he'll eventually break her heart and that she's too good for him. It's pretty depressing to watch, but there's not really much you can do. You've already made things worse.\n\nYou spend the evening trying not to watch and sipping your drink. ",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "barfight6-"
  },
  {
    "text": "Well, you totally knock him out of his chair as you intended. You probably should have waited until he was distracted. As he was going down, he felt the push and looked in your direction only to see you holding your hand out in a pushing motion. Sure you're 20 feet away, but it was still pretty obvious what had happened.\n",
    "option1Name": "Continue",
    "option1Key": "barfight79-2",
    "key": "barfight79"
  },
  {
    "text": "Awesome! You time it right when he's taking a drink, so that he falls sideways out of his chair, spills ale all over himself, and hits his head on the floor. Not so bad that he'll have a concussion or anything, just enough to give him a headache for a bit. \n\nThe barkeep yells at him \"You've had enough tonight, why don't you get back home.\"\n\nEmbarrassed, the guy picks himself up, glances around and notices that everyone in the place is watching him. Without a word, he heads out the door.",
    "option1Name": "Continue",
    "option1Key": "barfightfhdone",
    "key": "barfight10+"
  },
  {
    "text": "Satisfied that you've done a good thing without drawing any attention to yourself, you go back to sitting in the shadows enjoying your drink.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "barfightfhdone"
  },
  {
    "text": "\"You, Wizard,\" he says while picking himself up, \"You looking to pick a fight?\"\n\nHow do you respond?\n",
    "option1Name": "Deny Everything!",
    "option1Key": "wibdeny",
    "option2Name": "Kick his ass",
    "option2Key": "wibkickass",
    "option3Name": "Quick, make a distraction!",
    "option3Key": "wibdistraction",
    "key": "barfight79-2"
  },
  {
    "text": "You try to deny what he's talking about. No one else seems to have seen you make a spell, so it's your word against his.\n\nRoll + Charisma to see if you can talk your way out of this.",
    "option1Name": "Roll!",
    "option1Key": "wibdeny6-",
    "option2Name": "wibdeny79",
    "option2Key": "wibdeny79",
    "option3Name": "wibdeny10+",
    "option3Key": "wibdeny10+",
    "key": "wibdeny",
    "moveStat": "Charisma",
    "moveTriggered": true
  },
  {
    "text": "You do?\n\nReally?\n\nThat's not a very wizardly thing to do...\n\nYou can try, but it's probably not going to go well...",
    "option1Name": "YES!",
    "option1Key": "wibkacommit",
    "option2Name": "Nope. Deny Everything!",
    "option2Key": "wibdeny",
    "option3Name": "Uhh... Quick, make a distraction",
    "option3Key": "wibdistraction",
    "key": "wibkickass"
  },
  {
    "text": "Good idea, you try to cast another spell to create an illusion to get the attention off of you.",
    "option1Name": "Roll!",
    "option1Key": "wibdistraction6-",
    "option2Name": "wibdistraction79",
    "option2Key": "wibdistraction79",
    "option3Name": "wibdistraction10+",
    "option3Key": "wibdistraction10+",
    "key": "wibdistraction",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Nobody believes you. In fact, you get kicked out of the establishment and are told not to come back anytime soon.\nYou distinctly remember the barkeep saying \"No good wizard going around casting spells on my loyal patrons.\"\n\nThe worst part is that you miss the key thing that happens that really starts the story.\n\nYou spend the next few days bumming around town doing your thing, and then you die in a zombie apocalypse.\n\nThe End.\n",
    "option1Name": "Start Over",
    "option1Key": "end",
    "key": "wibdeny6-"
  },
  {
    "text": "No one is really sure who to believe. The guy has had a lot to drink, but you look kind of sketchy sitting by yourself in the dark corner looking of arcane and wizardry. The barkeep announces that he's got his eye on both of you. One more outburst and you'll be kicked out into the rain.\n\nYou go back to working on your drink, but it's not as enjoyable now that you're being watched.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibdeny79"
  },
  {
    "text": "You totally talk your way out of it. Everyone thinks that he just fell over and was trying to blame that wizard guy in the corner instead of owning up to being a little too drunk.\n\nAngrily he insults everyone's mothers and leaves the bar. You go back to sitting in the shadows enjoying your drink.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibdeny10+"
  },
  {
    "text": "Okay then.\n\nYou stand up, walk over to the guy who is now getting up off the floor. You probably say something that you think sounds really heroic about keeping his hands to himself, and you put up your dukes.",
    "option1Name": "Roll!",
    "option1Key": "wibkacommit6-",
    "option2Name": "wibkacommit79",
    "option2Key": "wibkacommit79",
    "option3Name": "wibkacommit10+",
    "option3Key": "wibkacommit10+",
    "key": "wibkacommit",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "Your head really hurts. \n\nYou open your eyes and look around, the bar is empty, and there's sunlight coming in through the windows. It seems you spent the night on the floor of the bar where you landed when you got knocked out. \n\nThe worst part is that you totally missed the key thing  that really starts the story.\n\nYou spend the next few days bumming around town doing your thing, and then you die in a zombie apocalypse.\n\nThe End.",
    "option1Name": "Start Over",
    "option1Key": "end",
    "key": "wibkacommit6-"
  },
  {
    "text": "Your hand really hurts. You probably broke a finger when you punched that guy in the nose. He did run out of the inn holding a very bloody (probably broken) nose, so that's a win.\n\nYou lose @X Hitpoints. \n\nYou'll have to use a healing potion when you get back to the room to fix your hand. \n\nYou go back to sitting in the corner enjoying your drink and wondering what inspired you to do such a thing.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibkacommit79",
    "action": "losehp",
    "amount": "1"
  },
  {
    "text": "First, there's the distinct sound of a fist hitting flesh, then the sound of a body hitting the floor, then silence as the entire place stares in shock.\n\nTonight's going to be one that people will talk about for weeks. It'll go down as the night a wizard totally dropped a guy twice his size with a throat punch.\n\nA few people buy you drinks, telling you how awesome that was, and how the guy deserved that as he's a complete jerk. The waitress who he was being handsy with thanks you, and you go back to sitting in the corner with a smug sense of satisfaction. \n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibkacommit10+"
  },
  {
    "text": "No one is fooled by your illusion of a purple hippopotamus that suddenly appears in the middle of the bar. You get kicked out of the establishment.\n\nYou distinctly remember the barkeep saying \"No good wizard going around casting spells on my loyal patrons.\"\n\nThe worst part is that you miss the key thing that happens that really starts the story.\n\nYou spend the next few days bumming around town doing your thing, and then you die in a zombie apocalypse.\n\nThe End.",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "wibdistraction6-"
  },
  {
    "text": "You create the illusion of a dragon landing outside the inn. It makes a horrible roar, and everyone dives under their tables. Someone yells for you to get rid of it because you're obviously a powerful wizard.\n\nYou spend the next 20 minutes putting on a show of fighting off the dragon that is actually your illusion. You'd really rather spend that time sitting in the corner and enjoying your drink, but you're kind of committed to the lie now. Eventually, you make your way back inside and sit back down at your table. You're exhausted. \n\nAnd your drink is missing.\nYou order a new one and go back to sitting in the corner.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibdistraction79"
  },
  {
    "text": "You create the illusion of a town guardsman coming in the door.\n\nIt points at the guy, and yells \"In the name of the king, you're under arrest!\"\n\nThe guy looks at it, then dives out one of the windows and runs away. You make the illusion look like it gives chase out the window then dispell it once it's out of sight. \n\nGreat job! The guy is gone, and no one knows that you had anything to do with it. You go back to enjoying your drink in the corner.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "wibdistraction10+"
  },
  {
    "text": "In this game, you will occasionally do some sort of check that will involve rolling dice. You will always roll 2 standard six-sided dice, add them together, and add in a relevant ability score. In this case, that will be Intelligence, because you are casting a spell. \n\nIf you roll a 10 or better, then you will see the best possible outcome. \nOn a 7 - 9, you will usually get what you want, but there will be some sort of negative consequence. \nIf you roll a 6 or less, then something bad will happen.",
    "option1Name": "Roll!",
    "option1Key": "farfightfear6-",
    "option2Name": "barfightfear79",
    "option2Key": "barfightfear79",
    "option3Name": "barfightfear10+",
    "option3Key": "barfightfear10+",
    "key": "barfightfear2",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You really need to learn to control your spells a bit better. Instead of casting it on the handsy guy, you cast it on the waitress. \n\nThe way this spell works is that the target will see illusions of whatever their darkest fears are. It's really handy for causing distractions when you're in a fight. \n\nAfter screaming in absolute terror, the waitress ran from the inn. The memories of that illusion are going to keep her awake at night for weeks. She could have handled some handsy jerk. In fact, she was about to tell him to leave. But this spell is meant to be something that breaks the human psyche. Good job.\n\nYou spend the rest of the evening sipping your drink and contemplating your mistake.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "farfightfear6-"
  },
  {
    "text": "The good news is that the spell totally worked. You don't know what that guy is seeing, and you really don't care. All you know is that he's petrified.\n\nIn fact, he fainted. The waitress got a couple of other patrons to help her carry the guy to one of the rooms. She keeps checking on him, and it's possible that she suspects something because she keeps giving you the side eye.\n\nYou spend the rest of the evening trying to keep a low profile.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "barfightfear79"
  },
  {
    "text": "That worked really well. The guy looked right at the waitress.\n\"no... no... please... no!!\"\n\nThen he took off running. Whatever it is he's afraid of, he is projecting that onto the waitress. You doubt that he'll be back to this place.\n\nYou spend the evening feeling a bit smug sipping your drink.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "barfightfear10+"
  },
  {
    "text": "In this game, you will occasionally do some sort of check that will involve rolling dice. You will always roll 2 standard six-sided dice, add them together, and add in a relevant ability score. In this case, that will be Intelligence, because you are casting a spell. \n\nIf you roll a 10 or better, then you will see the best possible outcome. \nOn a 7 - 9, you will usually get what you want, but there will be some sort of negative consequence. \nIf you roll a 6 or less, then something bad will happen.",
    "option1Name": "Roll!",
    "option1Key": "pwdeath6-",
    "option2Name": "pwdeath79",
    "option2Key": "pwdeath79",
    "option3Name": "pwdeath10+",
    "option3Key": "pwdeath10+",
    "key": "barfightpwdeath2",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "You wait until the guy takes a bite of his food, then you cast the spell. \n\nNothing happens.\n\nYou felt the surge of magic when you cast the spell, so you know that it was cast.",
    "option1Name": "???",
    "option1Key": "pwd6-2",
    "key": "pwdeath6-"
  },
  {
    "text": "You wait until the guy takes a bite of his food, then you cast the spell. \n\nThe guy slumps over. There's a thud and a clatter as his head lands on the table knocking his dinner onto the floor. Someone screams, and the waitress checks on him. She announces that he's dead, and that starts a large commotion. Someone is sent to get his wife. No one can figure out what happened, but everyone is devastated. There's a lot of crying. It appears that this guy was one of the pillars of the community. \n\nYou are very lucky that they don't know it was you.",
    "option1Name": "Continue",
    "option1Key": "pwdeath79-2",
    "key": "pwdeath79"
  },
  {
    "text": "You wait until the guy takes a bite of his food, then you cast the spell. \n\nThe guy slumps over. There's a thud and a clatter as his head lands on the table knocking his dinner onto the floor. Someone checks on him, and there's a large commotion as people realize that he's dead. You overhear a few people talk with relief that he's gone. Apparently, the guy was pretty much all around a bad egg.\n\nYou continue to eat your dinner in peace.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "pwdeath10+"
  },
  {
    "text": "You spend the rest of the evening trying to keep a low profile. You give condolences to people when appropriate, but mostly you just stay out of the way. You're forced to stick around at least for a while as it would be too suspicious for you to just leave. \n\nEventually, things start to calm down a bit, and you're able to go back to sitting in the corner nursing a drink.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "pwdeath79-2"
  },
  {
    "text": "You make a small confused sound. The guy turns to you and winks.\n\nYou're sure that the spell hit. The only possible explanation is that this isn't some ruffian. You are looking at a very powerful creature. There are very few beings that can shrug off this spell like it's nothing, and you just cast it on one of them.  Your life is pretty much in his hands. If he decides to retaliate, you are not anywhere near powerful enough to defend yourself. ",
    "option1Name": "Spend the rest of the evening looking away",
    "option1Key": "pwd6-ignore",
    "option2Name": "Buy him a drink",
    "option2Key": "pwd6-drink",
    "key": "pwd6-2"
  },
  {
    "text": "You decide that the best course of action is to just lie low and pretend that nothing happened.\n\nAfter a little while, the being whom you attacked gets up and walks out of the bar. As he passes by your table, he places a coin in front of you. You don't recognize it at all, and the script on it is unintelligible to you.\n\nIt's probably either cursed or some sort of death mark. What do you want to do with it?\n",
    "option1Name": "Pocket it",
    "option1Key": "pocketthecoin",
    "option2Name": "Pay your bar tab with it",
    "option2Key": "paywithcoin",
    "key": "pwd6-ignore"
  },
  {
    "text": "In a desperate attempt to placate this being, you order him a glass of the most expensive wine in the place. It takes most of the coin that you have to buy it, and you're not sure how you'll afford to eat tomorrow, but at least maybe you will be alive tomorrow.",
    "option1Name": "Continue",
    "option1Key": "pwd6-drink2",
    "key": "pwd6-drink"
  },
  {
    "text": "When the waitress delivers the wine, you can see her telling him that it came from you with your most sincere apologies. The being gives you a brief nod and smile. Feeling secure in that you aren't about to be squished like a bug, you go back to focusing on the drink at your own table.",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "pwd6-drink2"
  },
  {
    "text": "Double-click this passage to edit it.",
    "key": "end"
  },
  {
    "text": "You have reached 0 Hitpoints and you have died.\n\nThis happens sometimes. The good news is that you can play the game all over again! Isn't that exciting?!?!\n",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "dead"
  },
  {
    "text": "UmmmContinue this is awkward.\n\nYou shouldn't be ever seeing this.\nSomething went wrong.\nYou need to start over from the beginning.\nI'm so sorry.\nPlease report this to steve@radicalbomb.com\n",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "error"
  },
  {
    "text": "When you pick up the coin, you feel a sense of power emanating from it.\n\nYou decide to put the coin in your pocket for safe keeping. It's probably best to not let it out of your possession. It's probably going to spell your doom eventually.\n\nYou spend the rest of the evening sipping on your beverage trying to lay low.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "pocketthecoin",
    "action": "addAttribute",
    "attribute": "Cursed-Coin"
  },
  {
    "text": "Really? You're going to give the barkeep this coin that came from some unknown otherworldly entity of immense power?\n\nYeah, best not hang on to that. When you pick the coin up, it feels fairly unremarkable. The barkeep accepts it as he would any other coin. You hope that you didn't just doom him with it.",
    "option1Name": "Continue",
    "option1Key": "paywithcoin2",
    "key": "paywithcoin"
  },
  {
    "text": "You spend the rest of the evening sitting in the corner with your beverage of choice.\n",
    "option1Name": "Continue",
    "option1Key": "waitingforadventure",
    "key": "paywithcoin2"
  },
  {
    "text": "You enter a large feasting hall. The first thing that you notice is the smell. The room stinks like a chicken coop.\n\nTables and other furniture in various states of decay litter the room. You stop and examine the one closest to you. While you aren't an expert, it appears to be several hundred years old. It also has large claw marks on it.\n",
    "option1Name": "Continue",
    "option1Key": "cockatrice2",
    "key": "cockatrice",
    "action": "clear"
  },
  {
    "text": "You hold your torch up, and peer into the darkness as well as you can. You hear a deafening gutteral \"bawk bawk bawk BAGOCK!\"\n\nOut of the shadows steps a creature that you have only heard about in legends. It resembles a chicken, but stands as tall as a man, its wings are the leathery wings of a bat, and it has a tail of a snake.\n\nIt's a Cockatrice",
    "option1Name": "Continue",
    "option1Key": "cockatrice3",
    "key": "cockatrice2"
  },
  {
    "text": "As a worldly and experienced adventurer, you know that the Cockatrice is a deadly creature. This one is a large one. The gaze of a Cockatrice will turn its victim to stone. The only cure is its own saliva. Of course typically that comes into play when you are being eaten.\n\nWhat do you do?\n",
    "option1Name": "Run & Hide",
    "option1Key": "cocoRun",
    "option2Name": "Fight",
    "option2Key": "cocoFight",
    "key": "cockatrice3",
    "image": "coco"
  },
  {
    "text": "You see a good pile of tables off to one side that would offer temporary protection. Roll Dexterity to see if you make it there.\n",
    "option1Name": "Roll",
    "option1Key": "cocoRun6-",
    "option2Name": "cocoRun79-",
    "option2Key": "cocoRun79-",
    "option3Name": "cocoRun10+",
    "option3Key": "cocoRun10+",
    "key": "cocoRun",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "Double-click this passage to edit it.",
    "option1Name": "cocoFightWiz",
    "option1Key": "cocoFightWiz",
    "option2Name": "cocoFightFight",
    "option2Key": "cocoFightFight",
    "key": "cocoFight",
    "action": "checkClass"
  },
  {
    "text": "You start to run, but the room is poorly lit, and you trip and twist your ankle. You sense a presence just behind you. You roll over and see the Cockatrice looming over you.\n\nAs it looks into your eyes, you feel a numbing sensation as you start to turn to stone.\n\nRoll Constitution to see if you can resist.\n",
    "option1Name": "Roll",
    "option1Key": "crs6-",
    "option2Name": "crs79",
    "option2Key": "crs79",
    "option3Name": "crs10+",
    "option3Key": "crs10+",
    "key": "cocoRun6-",
    "moveTriggered": true,
    "moveStat": "Constitution"
  },
  {
    "text": "You take off for the hiding place paying little heed to anything except getting out of danger. \n\nYou're able to get to the stack of tables with little problem. There is a really good space underneath just for hiding in. The problem is that it's full of rather large eggs.\n",
    "option1Name": "Continue",
    "option1Key": "cocoNest",
    "key": "cocoRun79-"
  },
  {
    "text": "You make a run for the stack of tables that you saw. You have to duck and weave through other bits of furniture while being mindful of the dilapidated stone floor.\n\nYou are relieved that you  manage to get there completely unscathed.\n",
    "option1Name": "Continue",
    "option1Key": "cocoHiding",
    "key": "cocoRun10+"
  },
  {
    "text": "You failed that roll. In fact, you just failed 2 in a row. That's unfortunate.\n\nYou feel everything go dark and cold as you turn to stone. You are now giant chicken feed.\n\nWould you like to try again?",
    "option1Name": "Yes",
    "option1Key": "end",
    "key": "crs6-"
  },
  {
    "text": "You feel a wave a nausea coming over you. You manage to roll over just as you expunge some of your most recent meal. It feels pretty rough coming up, and there are some rocky bits in it. You're pretty sure that you just lost some internal organs.\n\nYou lose @X Hitpoints.\n",
    "option1Name": "Continue",
    "option1Key": "crs792",
    "key": "crs79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "Suddenly the numbness goes away. You look at your hand and it's perfectly normal. You look back at the Cockatrice, and it seems just as confused as you are. You take the opportunity to scramble away and into a hiding place.\n",
    "option1Name": "Continue",
    "option1Key": "cocoHiding",
    "key": "crs10+"
  },
  {
    "text": "The Cockatrice starts to peck at your disgorged matter. You use the distraction as an opportunity to scramble away into a hiding spot.\n",
    "option1Name": "Continue",
    "option1Key": "cocoHiding",
    "key": "crs792"
  },
  {
    "text": "Okay, now you're hiding from a really big chicken in the hall of ancient underground ruins. What are you going to do now smart person?\n",
    "option1Name": "Surprise Attack when it gets close",
    "option1Key": "cocosurprise",
    "option2Name": "Try to put it to sleep",
    "option2Key": "cocosleep",
    "key": "cocoHiding"
  },
  {
    "text": "The nest has roughly a dozen eggs in it. You don't take the time to count them, so you aren't really sure. You have a larger problem to worry about at the moment. \n\nIn fact, because you can't really hide without crushing all the eggs, you are just kind of standing there when the Cockatrice sees you.\n",
    "option1Name": "Continue",
    "option1Key": "cocohidingfound",
    "key": "cocoNest"
  },
  {
    "text": "You wait until the perfect moment, then jump out of your hiding spot to attack the Cockatrice!\n",
    "option1Name": "YAAAAA",
    "option1Key": "cocoFight",
    "key": "cocosurprise"
  },
  {
    "text": "this dialog will not display\n",
    "option1Name": "cocosleepwizard",
    "option1Key": "cocosleepwizard",
    "option2Name": "cocosleepfighter",
    "option2Key": "cocosleepfighter",
    "key": "cocosleep",
    "action": "checkClass"
  },
  {
    "text": "It is quite obvious that the correct solution as a great and powerful wizard is to cast a sleep spell on the Cockatrice. This is the best solution for both you and the creature to survive.\n\nRoll Intelligence to see how you do.",
    "option1Name": "Roll",
    "option1Key": "csw6-",
    "option2Name": "csw79",
    "option2Key": "csw79",
    "option3Name": "csw10+",
    "option3Key": "csw10+",
    "key": "cocosleepwizard",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "[[cocosleeppotion]]",
    "option1Name": "cocosleeppotion",
    "option1Key": "cocosleeppotion",
    "option2Name": "cocosleepsing",
    "option2Key": "cocosleepsing",
    "key": "cocosleepfighter",
    "action": "checkAttribute",
    "Attribute": "Well-Prepared"
  },
  {
    "text": "Surely the pack that you got from the bartender has some way in it to deal with a raging cockatrice. \n\nYou dig through the pack a bit, and you find a sleeping potion. Since you don't really want to get close enough to get the Cockatrice to drink it, your best bet is to just throw it like a Molotov and hope for the best.\n\nRoll Dexterity to throw.\n",
    "option1Name": "Roll",
    "option1Key": "csp6-",
    "option2Name": "csp79",
    "option2Key": "csp79",
    "option3Name": "csp10+",
    "option3Key": "csp10+",
    "key": "cocosleeppotion",
    "moveTriggered": true,
    "mvoeStat": "Dexterity"
  },
  {
    "text": "With a lack of any better options, you decide to sing a lullaby to this mythical beast that can turn you to stone with just a glance. You are either very brave or very stupid. \n\nWe will let the dice decide which.\n\nRoll Charisma to sing.",
    "option1Name": "Roll!",
    "option1Key": "css6-",
    "option2Name": "css79",
    "option2Key": "css79",
    "option3Name": "css10+",
    "option3Key": "css10+",
    "key": "cocosleepsing",
    "moveTriggered": true,
    "moveStat": "Charisma"
  },
  {
    "text": "Ducking down in your hiding place, you prepare the spell. Once it's ready you jump up and shout \"GO TO SLEEP!\"\n\nThe cockatrice simply turns and looks at you.\n",
    "option1Name": "Well Crap.",
    "option1Key": "cocohidingfound",
    "key": "csw6-"
  },
  {
    "text": "Ducking down in your hiding place, you prepare the spell. Once it's ready you jump up and shout \"Ukulala!\"\n\nA bit to your surprise, the Cockatrice is standing right on the other side of the table you are behind. It closes its eyes and starts to fall forward... right at you...\n\nYou put your hands out, but as it falls down, you go down with it and end up pinned by it.\n",
    "option1Name": "Continue",
    "option1Key": "cocopinned",
    "key": "csw79"
  },
  {
    "text": "Ducking down in your hiding place, you prepare the spell. Once it's ready you jump up and shout the verbal part of the incantation.\n\nYou watch as the Cockatrice falls to the ground, sound asleep.\n\nYou are now free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "csw10+"
  },
  {
    "text": "With a lack of other options, you decide that fighting this thing is the only way to stay alive right now.\n",
    "option1Name": "Continue",
    "option1Key": "cocoFight",
    "key": "cocohidingfound"
  },
  {
    "text": "It takes a lot of effort, but you are able to push the sleeping Cockatrice off of you. The only real lingering damage that it did is to cover you in its stench.\n\nYou're going to have to live with that for a while.\n\nYou are now free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "cocopinned"
  },
  {
    "text": "Congratulations, You've reached the end of the Demo to Mines of Immortia. If you haven't already, you should click the hamburger menu (Yes, that's what it's called) up in the top right corner and put in your email address. I promise I won't sell it to anyone, I'll just use it to send you some info in a few days about following along with the development of the game and then once more when the game releases. \n\nThank you for playing, enjoy your Con.\n",
    "option1Name": "Restart",
    "option1Key": "end",
    "key": "cocoDown"
  },
  {
    "text": "You stand up and chuck the bottle of sleeping potion at the Cockatrice. It hits the cockatrice right in the head, which you think is an excellent result, except the bottle doesn't break, and now the beast is looking right at you.\n",
    "option1Name": "Well Crap.",
    "option1Key": "cocohidingfound",
    "key": "csp6-"
  },
  {
    "text": "You stand up and chuck the bottle at the cockatrice, which is actually almost within arms reach. The bottle explodes and sleeping potion goes everywhere. \n\nYou yawn.\nYou feel really kind of sleepy, and that nice feathered thing there looks really comfortable. Without really thinking about it, you just kind of curl up on it.\n",
    "option1Name": "Continue",
    "option1Key": "csp792",
    "key": "csp79"
  },
  {
    "text": "You stand up and chuck the sleeping potion at the Cockatrice. You have an impeccable aim, as it hits the Cockatrice right in the face and shatters spilling all over it. \n\nYou watch as the Cockatrice falls to the ground, sound asleep.\n\nYou are now free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "csp10+"
  },
  {
    "text": "You wake up curled in a nice warm bed of Cockatrice. You aren't sure how much time has passed, but you are at least relieved to know that the Cockatrice is still asleep.\n\nBeing very careful to not wake it, you extricate yourself. You don't know how long it'll stay asleep, but you are free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "csp792",
    "action": "doom",
    "amount": "2"
  },
  {
    "text": "You stand up and begin to sing the best lullaby song that you can think of...\n\nwhich is Happy Birthday...\n\nYour adventuring lifestyle is not very conducive to child-rearing, and it shows.\n\nThe Cockatrice looks at you quizzically.\n",
    "option1Name": "Continue",
    "option1Key": "cocohidingfound",
    "key": "css6-"
  },
  {
    "text": "You stand up, and start to sing \"Hush Little Baby\". The Cockatrice looks at you but doesn't move.\n\nHopeful that this crazy plan will work, you keep singing.\n\nThe strangest thing happens, the creature starts to sing along with you. Not the words of course, but it carries the tune. In fact, it harmonizes with you a little bit.\n\nIt doesn't move from its spot.\n\nYou are free to explore the room, as long as you don't stop singing.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "css79"
  },
  {
    "text": "Boldy, you stand up and start singing \"Baby Mine\" just the way that your mother sang to you when you were just a wee little one.\n\nThe Cockatrice looks at you. Without meeting its gaze, you keep singing.\n\nIts eyes start to droop, and its head gets heavy. Encouraged by this, you don't let the song stop. Just as you sing the last \"Sweet as can be\" the Cockatrice lays down, and goes to sleep.\n\nYou are free to explore the room.",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "css10+"
  },
  {
    "text": "No Chicken/Lizard/Bat creature can stand before the might of your arcane powers. You shall smite this thing into oblivion. You prepare an arcane blast knowing that will finish it quickly.\n\nRoll Intelligence to cast.",
    "option1Name": "Roll",
    "option1Key": "cfw6-",
    "option2Name": "cfw79",
    "option2Key": "cfw79",
    "option3Name": "cfw10+",
    "option3Key": "cfw10+",
    "key": "cocoFightWiz",
    "moveTriggered": true,
    "moveStat": "Intelligence"
  },
  {
    "text": "Okay, you are a guy with a sword. You need to use it to kill a giant chicken/lizard/bat thing. You got this. \n\nRoll Strength to see what happens.",
    "option1Name": "Roll!",
    "option1Key": "ccff6-",
    "option2Name": "ccff79",
    "option2Key": "ccff79",
    "option3Name": "ccff10+",
    "option3Key": "ccff10+",
    "key": "cocoFightFight",
    "moveTriggered": true,
    "moveStat": "Strength"
  },
  {
    "text": "You cast the blast at the Cockatrice, but your spell goes wide and instead takes out a support column. \n\nWith a loud rumble, part of the ceiling falls in, and you jump to avoid getting crushed.\n\nRoll Dexterity.",
    "option1Name": "Roll!",
    "option1Key": "ccfj6-",
    "option2Name": "ccfj79",
    "option2Key": "ccfj79",
    "option3Name": "ccfj10+",
    "option3Key": "ccfj10+",
    "key": "cfw6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "The Cockatrice leaps at you just as you unleash your bolt of arcane power. You bolt hits it at nearly point blank range and it flies backward and into a lump on the ground.\n\nIt takes you a moment to notice the pain in your leg. You look down and see a sizeable gash from where the cockatrice got its claws into you. You lose @X Hitpoints.\n",
    "option1Name": "Continue",
    "option1Key": "cocoblasted",
    "key": "cfw79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "The Cockatrice leaps at you. You shout \"HADOUKEN\" just as you throw a blast of energy into its face. \n\nThe Cockatrice flies backward and lands in a lump.\n",
    "option1Name": "Continue",
    "option1Key": "cocoblasted",
    "key": "cfw10+"
  },
  {
    "text": "What a way to go. Squished in a giant underground monster chicken coop that you caused to cave in.\n\nYour name will not be remembered.\n\nWould you like to try again?",
    "option1Name": "Yes!",
    "option1Key": "end",
    "key": "ccfj6-"
  },
  {
    "text": "You avoid the majority of. the cave in, but you are still hit by a few rather large rocks. You lose @X Hitpoints.\n",
    "option1Name": "Continue",
    "option1Key": "cococeilingcollapsed",
    "key": "ccfj79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You do a wonderful triple backflip avoiding each piece of falling rock. The only downside is that you wish someone could have seen it. It was amazing.\n",
    "option1Name": "Continue",
    "option1Key": "cococeilingcollapsed",
    "key": "ccfj10+"
  },
  {
    "text": "The good news is that it appears that the Cockatrice was crushed by the collapsing ceiling.\n\nNow that you don't have a murderous chicken monster to worry about, you are free to explore the room.\n",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "cococeilingcollapsed"
  },
  {
    "text": "You walk up to the cockatrice and prod it a couple of times with your boot. It appears to be quite dead. \n\nYou are now free to explore the room.",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "cocoblasted"
  },
  {
    "text": "That did not go well. You leap at the Cockatrice and swing your sword way too early, completely missing the beast. It steps in behind you and swipes its oversized deadly talons at you.\n\nRoll Dexterity to dodge!",
    "option1Name": "Roll!",
    "option1Key": "ccffDodge6-",
    "option2Name": "ccffDodge79",
    "option2Key": "ccffDodge79",
    "option3Name": "ccffDodge10+",
    "option3Key": "ccffDodge10+",
    "key": "ccff6-",
    "moveTriggered": true,
    "moveStat": "Dexterity"
  },
  {
    "text": "You leap at the Cockatrice and swing your sword in a great arc. You embed your sword into the beast killing it, but not before it can dig its claws into you.\n\nYou lose @X Hitpoints.\n",
    "option1Name": "Continue",
    "option1Key": "ccffwin",
    "key": "ccff79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You leap at the Cockatrice and in one deft move, you bury your sword right into its chest piercing where you think its heart might be.\n",
    "option1Name": "Continue",
    "option1Key": "ccffwin",
    "key": "ccff10+"
  },
  {
    "text": "The last thing you feel is the claws of the Cockatrice digging into your back. The pain is excruciating but soon dies away as does the rest of the world.\n\nEverything goes dark.\nYou have died.\n\nWould you like to play again?\n",
    "option1Name": "Yes",
    "option1Key": "end",
    "key": "ccffDodge6-"
  },
  {
    "text": "You feel excruciating pain as the cockatrice leaves a long gouge in your back. You lose @X Hitpoints.\n",
    "option1Name": "Continue",
    "option1Key": "ccffdodged",
    "key": "ccffDodge79",
    "action": "losehp",
    "amount": "2"
  },
  {
    "text": "You duck down just in the nick of time to avoid the claws. You feel them just lightly brush over your head. \n",
    "option1Name": "Continue",
    "option1Key": "ccffdodged",
    "key": "ccffDodge10+"
  },
  {
    "text": "You spin around and strike out with your sword skewering the monstrosity!\n\nIt slumps to the ground, and you use your foot to pull your sword free.\n",
    "option1Name": "Continue",
    "option1Key": "ccffwin",
    "key": "ccffdodged"
  },
  {
    "text": "The cockatrice lays before you in a bloody heap. You prod it a couple of times with your sword to make sure that it is indeed dead. \n\nYou are free to explore the room.",
    "option1Name": "Continue",
    "option1Key": "cocoDown",
    "key": "ccffwin"
  },
  {
    "text": "You are in a tavern after a hard day of adventuring. The place is full of the normal patrons and a healthy amount of travelers who are in town for the local festival.\n",
    "option1Name": "Continue",
    "option1Key": "sitincorner",
    "key": "starthere2",
    "action": "clear"
  }
]